[{"index": 1, "Headline": "Cryptocurrency prices today: Bitcoin crosses $38,000 as outlook improves; Ether rises almost 5%", "Article": "Bitcoin, Ether and all other popular cryptocurrencies are trading higher on Thursday. (Photo: Reuters/Representational image)\n\nThe high volatility seen in the cryptocurrency market over the past month seems to be tapering, with prices of popular digital coins stabilising and rising.\n\nAt 9:50 am, Bitcoin's price increased to nearly $38,000, up over 3 per cent compared to its price 24 hours ago. Ethreum’s (Ether) value has also increased by over 4 per cent to nearly $2,800. By 10:30 am, the price of Bitcoin had crossed $38,000.\n\nMuch of the reason behind the stabilisation in prices is higher inflows in the crypto market last week after hitting record outflows in the previous two, reported news agency Reuters on the basis of data from digital currency manager CoinShares.\n\nCryptocurrency highlights: Check Wednesday's prices and trends\n\nInflows in almost all cryptocurrencies, especially Bitcoin and Ether, have increased in the past week. The higher inflows last week seems to have helped reduce the wild price swings that gripped the crypto market over the past month.\n\nMeanwhile, popular meme-based currency Dogecoin surged yesterday after digital asset exchange Coinbase said it will make the crypto unit available to its users on its trading platform.\n\nDogecoin was up over 15 per cent at the time of writing this report and the digital coin's market capitalisation has jumped to over $55 billion.\n\nAll other popular cryptocurrencies including Ripple, Cardano, Chainlink, Stellar, Polkadot and Litecoin were trading higher.\n\nHere are the latest prices and trends of popular cryptocurrencies:\n\nCryptocurrency Price (US Dollar) 24-hour change Market cap (Billion) Volume (24 Hours) Bitcoin 37,900.19 3.28% $709.68 $30.95 billion Ethereum (Ether) 2,754.10 4.72% $319.83 $40.04 billion Dogecoin 0.426253 15.36% $55.30 $11.84 billion Litecoin 188.52 3.10% $12.78 $7.16 million XRP (Ripple) 1.03 1.86% $102.84 $3.97 billion Cardano 1.77 0.15% $56.95 $4.02 billion\n\nAnother positive news that has helped the cryptocurrency market gain is the fact that Standard Chartered PLC unit intends to establish a cryptocurrency brokerage and exchange platform in Britain and Europe to target institutional clients.\n\nThe new exchange will be created by a joint venture between SC Ventures, the bank's innovation arm, and BC Technology Group, which operates Hong Kong-licensed cryptocurrency exchange OSL.\n\nThe move is a strong endorsement of cryptocurrency from a mainstream lender and could pave the way for other global banks to follow suit.\n\nStandard Chartered’s new platform will primarily target the European market, connecting institutional traders with counterparts trading Bitcoin, Ether and other digital assets, said the bank.\n\nWhile Standard Chartered’s move is in sharp contrast to rival HSBC’s stance on digital coins, it could be a turning point in the entire debate surrounding cryptocurrencies.\n\n“We have a strong conviction that digital assets are here to stay and will be adopted by the institutional market as a highly relevant asset class,” Alex Manson of SC Ventures told news agency Reuters.\n\n(DISCLAIMER: The cryptocurrency prices have been updated as of 10:15 am and will change as the day progresses. The list is intended to give a rough idea about popular cryptocurrency trends and will be updated on a daily basis.)", "Link": "https://www.indiatoday.in/business/story/cryptocurrency-prices-today-bitcoin-nears-38-000-as-outlook-improves-ether-rises-almost-5-1810263-2021-06-03", "Authors": [], "Image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202106/Screenshot_2021-06-03_at_10.20-647x363.png?3qxEzBweo2JWo45XwPgcQJ4nygg.X2ea", "Date": "03 June, 2021"}, {"index": 2, "Headline": "Cryptocurrency poses a significant risk of tax evasion", "Article": "R.Tsubin | Moment | Getty Images\n\nThe Biden administration wants to get tougher on tax cheats — and cryptocurrency is an area of interest. Virtual currencies like bitcoin and ethereum, which are collectively valued around $2 trillion, offer investors a way to shield income from tax authorities. In that way, the crypto economy contributes to the U.S. \"tax gap\" — the difference between tax paid and tax owed, according to the Treasury Department. The White House estimates a $7 trillion gap over the next decade. More from Personal Finance:\n\nBitcoin crash opens door to a tax loophole for investors\n\nSEC considers new investor protections for SPACs\n\nDebunking the myths about 529 college savings plans The Treasury seems particularly concerned about wealthy Americans who shift taxable assets into the crypto economy to avoid tax. \"Cryptocurrency already poses a significant detection problem by facilitating illegal activity broadly including tax evasion,\" according to a Treasury report issued last week, which outlined the Biden administration's tax-compliance agenda.\n\nCrypto tax evasion\n\nBut just how does cryptocurrency lead to tax evasion? It largely comes down to lax reporting requirements, according to tax experts. The IRS may not be able to trace crypto income or transactions if they go unreported by exchanges, businesses and other third parties. And that means the income may not be taxed. \"No one has put out clear rules on it, so there's a lot of non-reporting going on,\" according to Jon Feldhammer, a partner at law firm Baker Botts and a former IRS senior litigator. \"Any time you create a path of non-reporting, you create a way to benefit from tax fraud in an untraceable or a much-harder-to-trace way,\" he said. Crypto is fast becoming an alternative to cash as more merchants accept bitcoin and other virtual currencies as payment. But cash is more heavily regulated.\n\nFor example, a business that receives more than $10,000 in cash from a customer must file a currency transaction report. This may happen if a consumer buys a car for more than $10,000 in cash, if someone wins big at the casino or if a bank receives a hefty cash deposit. These reports tell the government that a buyer has lots of money that may or may not be reported on a tax return. But the same rules don't apply to crypto. A used-car business that receives $20,000 of bitcoin from a customer doesn't have to file a currency transaction report; that income may also go untaxed if it's unreported on the business owner's tax return, Feldhammer said. \"Despite constituting a relatively small portion of business income today, cryptocurrency transactions are likely to rise in importance in the next decade, especially in the presence of a broad-based financial account reporting regime,\" the Treasury report said. Plus, virtual currencies don't have to be bought or sold through an exchange, making those transactions more opaque to government officials.\n\nBiden crypto proposal\n\nAl Drago/Bloomberg via Getty Images", "Link": "https://www.cnbc.com/2021/05/31/cryptocurrency-poses-a-significant-risk-of-tax-evasion.html", "Authors": ["Greg Iacurci"], "Image": "https://image.cnbcfm.com/api/v1/image/106890035-1622218863730-gettyimages-876199432-img_5316-5626.jpeg?v=1622218901", "Date": "31 May, 2021"}, {"index": 3, "Headline": "Coinbase rival Kraken launches mobile app in U.S. to capitalize on crypto surge", "Article": "Less than two months after Coinbase's stock market debut, rival crypto exchange Kraken is bringing its mobile app to the U.S. as retail investors flock to digital currencies.\n\nStarting Wednesday, the new Kraken App will allow many users across the U.S. to securely buy and sell more than 50 crypto tokens from their mobile phones.\n\n\"This consumer app is our first major foray into supporting wider consumer adoption in a much more simplified, easy-to-use interface,\" Chief Product Officer Jeremy Welch told CNBC. The app launched in Europe earlier this year.\n\nIn terms of trading volume, Kraken is the world's fourth-largest digital currency exchange.\n\nIn a crowded field of cryptocurrency apps, Kraken claims to offer \"the lowest fees in the industry.\" It points to its speedy verification and onboarding times as a key benefit. The fastest onboarding and purchase test is under a minute, depending on the user's bank.\n\nOutside the U.S., Kraken is popular because of its margin and futures trading offerings, which are not yet available to U.S. consumers. Launched in 2013, Kraken says it has 7 million clients. It said its May trading volume grew more than sixfold from January.\n\n\"The last five months have been pretty unreal at Kraken,\" said Welch. \"We've seen a surge in new clients and in all-time highs.\"\n\nThe app does not yet allow credit and debit card payments, but the company says it plans to enhance its offerings in coming weeks and months.\n\nThe company said it doesn't offer service to residents of New York and Washington state due to the \"cost of maintaining regulatory compliance.\"\n\nThe move into the U.S. market comes at a time of regulatory uncertainty and in the midst of a particularly volatile cycle. While bitcoin has quadrupled in value in the past year, the price has dropped more than 40% from its high in April.", "Link": "https://www.cnbc.com/2021/06/02/kraken-launched-mobile-app-in-us-for-bitcoin-and-ethereum-purchases.html", "Authors": ["Mackenzie Sigalos"], "Image": "https://image.cnbcfm.com/api/v1/image/106890913-1622584440622-KrakenAppPhoto.png?v=1622584522", "Date": "02 June, 2021"}, {"index": 4, "Headline": "Google Announces New Policy for Cryptocurrency Ads – Featured Bitcoin News", "Article": "Google Announces New Policy for Cryptocurrency Ads\n\nGoogle has announced an update to its financial products and services policy, which includes its policy on cryptocurrency advertising. The new rules will take effect in August and all prior crypto exchange certifications will be revoked. Advertisers must request new cryptocurrency exchanges and wallets certification with Google.\n\nGoogle Introduces New Crypto Ad Rules\n\nGoogle Inc. posted a notice Wednesday regarding its new crypto ad policy. “This policy will apply globally to all accounts that advertise these financial products,” the Internet giant wrote.\n\nThe notice explains that Google will update its existing financial products and services policy in August “to clarify the scope and requirements to allow the advertisement of cryptocurrency related business and services.” The tech giant wrote: “Beginning August 3, advertisers offering cryptocurrency exchanges and wallets targeting the United States may advertise those products and services when they meet the following requirements and are certified by Google.”\n\nThe company proceeded to explain how advertisers can be certified. Firstly, they must be duly registered with the Financial Crimes Enforcement Network (FinCEN) “as a Money Services Business and with at least one state as a money transmitter.” Alternatively, the advertisers can be “a federal or state chartered bank entity.”\n\nFurthermore, Google noted that the advertisers must meet all relevant legal requirements, including state, local, and federal laws and they must also “Ensure their ads and landing pages comply with all Google Ads policies.” The company elaborated:\n\nAll prior cryptocurrency exchange certifications will be revoked on August 3, 2021. Advertisers must request new cryptocurrency exchanges and wallets certification with Google when the application form is published on July 8, 2021.\n\nMeanwhile, Google clarified that some ads are not allowed. They include “Ads for initial coin offerings [ICO], Defi trading protocols, or otherwise promoting the purchase, sale, or trade of cryptocurrencies or related products.” In addition, “Ad destinations that aggregate or compare issuers of cryptocurrencies or related products” are also prohibited.\n\n“ICO pre-sales or public offerings, cryptocurrency loans, initial DEX offerings, token liquidity pools, celebrity cryptocurrency endorsements, unhosted wallets, unregulated Dapps, cryptocurrency trading signals, cryptocurrency investment advice, aggregators or affiliate sites containing related content or broker reviews” are some examples of the ads that are not allowed.\n\nGoogle’s current financial products and services policy states: “We consider financial products and services to be those related to the management or investment of money and cryptocurrencies, including personalized advice.” Crypto ads are currently allowed in the U.S. and Japan.\n\nWhat do you think about Google’s new policy on cryptocurrency ads? Let us know in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/google-new-policy-cryptocurrency-ads/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2019/09/google-ads.jpg", "Date": "02 June, 2021"}, {"index": 5, "Headline": "Indians Hold Cryptocurrency Assets Worth More Than $1.5 Billion: Q&A With Paxful", "Article": "Cryptocurrency, everyone seems to think, is very cool. There are inherent risks too with investments, and if you don’t understand crypto coins as a concept, this can be complicated too. Chances are, you’d be unable to fathom why there is so much volatility when it comes to crypto pricing. And if we are to factor in the scenario unfolding in India as we speak, banking institutions are adding to the complexity by simply refusing to play ball and support cryptocurrency investment apps and platforms. Many believe these will get resolved with time. If you are ready to take the risk, you can take the plunge and invest in cryptocurrencies including Bitcoin, Ethereum, Litecoin, Cardano, Dogecoin, Shiba Inu and Polygon.\n\nWith the backdrop of the rising cryptocurrency excitement and awareness in India coupled with the banking troubles that a lot of cryptocurrency apps are reporting as well as reports that the Government intends to set up a panel of cryptocurrency experts as a first step towards regulating cryptocurrency in India, News18 spoke with Artur Schaback, Co-Founder and Chief Operating Officer of Paxful, a peer to peer (P2P) trading platform, who believes that despite the uncertainty, the expected panel of experts who will take the first step towards regulating crypto in India, is a cause to remain optimistic. Schaback also insists that the crypto investment has matured and no longer are investors afraid that the price will continue to fall.\n\nQ: How would you define cryptocurrencies and amidst all the jargon and tweeting, what would you want crypto followers to focus on?\n\nA cryptocurrency is a digital currency or asset designed as a medium of exchange. Many cryptocurrencies are decentralized systems of payment based on blockchain technology—a distributed ledger technology that certifies records and transactions without the use of a central database. This decentralized structure allows cryptocurrency to exist outside the control of a central authority. What’s most valuable is that cryptocurrency is a strong financial solution and can be used for things such as payments and e-commerce, wealth preservation, and investing. Also, by leveraging cryptocurrency within a peer-to-peer marketplace, consumers have access to practically any financial network in the world and are better enabled to gain financial freedom.\n\nQ: How do you see the cryptocurrency market developing in the next 12 months or so, particularly in India?\n\nDemand for cryptocurrency in India is rising. According to a recent IndiaTech.org report, Indian users currently hold cryptocurrency assets worth more than $1.5 billion and their daily trades in cryptocurrency are worth $350-500 million. I expect that interest and the use of cryptocurrency will only continue to grow — especially as the technology becomes more accessible to users and education around cryptocurrency becomes more prolific.\n\nQ: For crypto investors in India, how risky is it considering banks seem to be hesitant to engage with crypto trading platforms? Is there a risk of being locked out of the investment?\n\nThere is some uncertainty at this stage, but we remain optimistic, especially after hearing reports that the central government may form a fresh panel of experts to study the possibility of regulating cryptocurrency in India. There are several stakeholders involved in this conversation but we all want the same thing: to provide a strong financial solution for as many people as possible, one that is even more inclusive, robust, and safer for users.\n\nQ: Crypto startups in India have been facing challenges with banking support being pulled back. How much of a challenge will that be in the short term and long-term outlook?\n\nWe’re optimistic that the traditional banking systems and the cryptocurrency companies will work together to strengthen the cryptocurrency industry. But for Paxful, unlike traditional crypto exchanges, users don’t need a bank account to use Paxful. Our platform allows users to transact with almost 400 methods of buying and selling bitcoin including online wallets and gift cards.\n\nQ: How urgent is the need for a cryptocurrency panel in India? The government has talked about a calibrated approach.\n\nWe see the needs as urgent because education around cryptocurrency is vital. This move would help provide a fresh perspective and amplify understanding of the technology.\n\nQ: What are Paxful’s plans for India and how big will the presence be in the country?\n\nCurrently, India is within Paxful’s top five countries by volume. We have a strong user base in India and there’s still huge untapped potential. We look forward to delivering to both our new and existing users in the country.\n\nQ: Investors looking for safe investments put their money in cryptocurrency? And if yes, which ones are the safer bets? Are there any safe crypto coins?\n\nWith every investment, there comes an inherent risk factor, whether you invest in mutual funds, stocks, or cryptocurrency. There’s value in diversifying investment portfolios to mitigate this risk. Greater the volatility, the more the chances of earning a higher return investment. Volatility doesn’t make any asset class ignorable.\n\nQ: Can some random tweets from Elon Musk set such a flutter in cryptocurrency markets or are there other factors at play?\n\nThe industry is still coming into its own. What’s important to focus on is that when there is a great correction (a decline of 10% or more in the price of a security, asset, or a financial market), many investors are encouraged to buy. The market has matured in this regard and instead of being afraid that the price will continue to fall, people take the opportunity to invest. That is why the dip had a floor, sales always support the price.\n\nQ: Should investors Buy The Dip or is this more of a long term strategy once money is put in cryptocurrencies? What is the best time to invest in crypto?\n\nCryptocurrency has a variety of uses beyond speculation, from wealth preservation to remittance, payments and social good. Before someone invests in cryptocurrency such as bitcoin, it’s important to determine what the need is for. Once they determine that, they can employ either a long-term or short-term approach to their investment. For either route, one strategy to consider is dollar-cost averaging (DCA), a strategy where the investor divides up the total investment and spreads it across different assets in an effort to reduce the impact of volatility.\n\nQ: How much money should one lock with cryptocurrencies?\n\nThe main mantra of investing is that people should invest as per their capability. Only invest what you are comfortable risking.\n\nQ: What Are NFTs and how do they tie in with cryptocurrencies? How are NFT valuations so high?\n\nAt a very high-level, a non-fungible token (NFT) is a digital asset verified using blockchain technology—a distributed ledger technology that certifies records and transactions without the use of a central database. Valuations are high because NFTs are generally one of a kind and have unique identifying codes. This has contributed to its recent boom in popularity. NFTs are used as a means to buy and sell digital artwork, frequently with cryptocurrency, including images, songs, videos, and GIFs. As an example, Beeple, a digital artist, sold a NFT of his work titled “Everydays: the First 5000 Days” for $69 million earlier this year at Christie’s, the British auction house.\n\nRead all the Latest News, Breaking News and Coronavirus News here", "Link": "https://www.news18.com/news/tech/indians-hold-cryptocurrency-assets-worth-more-than-1-5-billion-qa-with-paxful-3804800.html", "Authors": [], "Image": "https://images.news18.com/ibnlive/uploads/2021/06/1622696149_artur-schaback-paxful.jpg", "Date": "03 June, 2021"}, {"index": 6, "Headline": "A new cryptocurrency X-TOKEN to empower crypto-traders", "Article": "Baden-Wurttemberg, Stuttgart, May 29, 2021 (GLOBE NEWSWIRE) -- 29 May 2021 - Cryptocurrency exploded in popularity over the past few months and is the hottest new trend in the investing world. It’s possible to make a lot of money investing in cryptocurrencies, but it’s also possible to lose a lot of money. If you do choose to invest in cryptocurrency, choose your investment wisely. Right now, there are more than a thousand cryptocurrencies in the market to make choice. So, how can you make a smart decision?\n\nA new cryptocurrency, X-TOKEN operating on Binance Smart Chain is the first token that will empower crypto traders, investors, and minorities who have no access to computers. Building decentralized BI applications and donating the usage fees will help crypto maniacs and minorities alike.\n\nX-TOKEN is a frictionless, yield-generating contract where the tokens bought will soon be able to be spent on dApps. The protocol was launched on May 6th, 2021 through a DxSale presale. The token contract employs a static reward system—10% of every transaction is split into two parts—one part is distributed to holders, while the other 5% is used to fuel the liquidity pool on the PancakeSwap decentralized exchange. The tokens are permanently locked in the LP, effectively reducing the available supply. The token was launched with the idea of creating a community token with a self-generating income mechanism for its owner.\n\nX-TOKEN differs from the rest of the De-Fi crowd because it has a passionate team working full time to develop a fully-fledged ecosystem of applications surrounding the token. “We aim to not only have a financially appealing cryptocurrency asset for short-term traders but a suitable long-term asset for serious long-term investors active in crypto. X-TOKEN is a yield-generating contract that rewards its holders” Company stated.\n\nEach trade has a 10% tax whereas 5% gets distributed to holders and another 5% gets locked in liquidity to create a solid price floor. Buying X-TOKEN is easy in a few steps: Download wallet, get BNB on Binance which you can swap to X-TOKENS, Swap on XSwap, which is also their first dApp, or on PancakeSwap.io.\n\nThe team behind X-TOKEN consists of 5 members who are experts in cryptocurrency from the early stages. They are primarily developers who deal with the implementation of BI applications, which will be paid in X-TOKEN. The Team is based mostly in Germany and Latvia.\n\nFor more info, or to get in contact, please visit:\n\nWebsite: project-x.finance\n\nTelegram: https://t.me/projectX_token\n\nDiscord: https://discord.com/invite/YjW2SrXDsB\n\nMail: info_project-x.finance@prdistribution.org\n\n“For the original news story, please visit https://www.prdistribution.com/news/a-new-cryptocurrency-x-token-to-empower-crypto-traders.html\"\n\n\n\nAttachment", "Link": "https://www.globenewswire.com/news-release/2021/05/29/2238558/0/en/A-new-cryptocurrency-X-TOKEN-to-empower-crypto-traders.html", "Authors": [], "Image": "https://ml.globenewswire.com/Resource/Download/0fe28e3e-1986-4ebb-989e-778075465aa3?size=2", "Date": "29 May, 2021"}, {"index": 7, "Headline": "Bitcoin falls below $36,000 as cryptocurrencies slip once again", "Article": "In this article TSLA\n\nDado Ruvic | Reuters\n\nBitcoin took another hit on Friday as other cryptocurrencies including ether and doge also saw their values fall. The price of bitcoin hovered around $36,000 on Friday. Bitcoin traded 7% lower at $35,997.72 by 4:10 p.m. ET, according to Coin Metrics data. Elsewhere, ethereum's price fell 9.3% to $2,501.16 a coin, while dogecoin's price fell 4% to 32 cents. Bitcoin, the world's most popular cryptocurrency has been trying to recover after a week of turmoil that saw its price tumble 30% to around $30,000 last week.\n\nIt briefly climbed back above $40,000 on Wednesday before losing some of those gains. Cryptocurrencies continue to divide opinion. In a 41-page note last week, Goldman analysts shared their views on whether the likes of bitcoin and ethereum should be considered an asset class or not. The latest price falls comes a day after longtime bitcoin bull Cathie Wood, founder and CEO of Ark Investment Management, argued that bitcoin has a place in the world of deflation. Emerging markets — where currencies are often linked closely to commodity price cyclicality — could ultimately spur outperformance in bitcoin, she said. \"I think what will happen as their currencies come under pressure, the velocity of their money will increase as more and more of their populations shift into bitcoin, and other cryptocurrencies and assets,\" Wood said at CoinDesk's Consensus 2021 conference on Thursday.", "Link": "https://www.cnbc.com/2021/05/28/bitcoin-falls-below-36000-as-cryptocurrencies-slip-once-again.html", "Authors": ["Sam Shead"], "Image": "https://image.cnbcfm.com/api/v1/image/106863816-1617660366093-bit.jpg?v=1621871168", "Date": "28 May, 2021"}, {"index": 8, "Headline": "Spouses in divorce proceedings are using cryptocurrency to hide money. Here’s how experts find it", "Article": "The dramatic rise of cryptocurrency has led to some spouses hiding those digital assets during divorce settlements, and tracking down the funds isn't easy, experts say.\n\nMore than 20 million Americans may own cryptocurrency, industry groups say, and digital currency market values grew to a record $2 trillion in April. These spikes may be enticing more spouses in divorce proceedings or those thinking about divorce to conceal their stash, experts say.\n\n\"I'm sure it's been an issue the whole time,\" says Sandra Radna, a divorce attorney based on Long Island, New York. \"The level of awareness for divorce attorneys is very recent.\"\n\nHere's how experts are tracking down a spouse's hidden funds.\n\nMore from Personal Finance:\n\nDividing cryptocurrency in a divorce settlement is complicated\n\nBitcoin crash opens door to a tax loophole for investors\n\nBiden's plans may drop a tax bomb on divorcing couples\n\n\"The hardest part for attorneys is first to determine whether there was an investment,\" says Radna. \"And then, once you have that suspicion, to go after it.\"\n\nWhile some spouses in a divorce know about cryptocurrency from past conversations, others may suspect hidden funds based on their spouse's lifestyle changes, she said.\n\nFor example, their spouse may suddenly have a bunch of extra money or they may make a large purchase, such as an expensive new car.\n\nIf a spouse thinks there may be significant amounts of hidden cryptocurrency, an attorney may file a subpoena, or court order, to get access to their spouse's computer or electronic devices, Radna says.\n\nThere are several ways to find secret cryptocurrency accounts.", "Link": "https://www.cnbc.com/2021/06/01/divorcing-spouses-are-using-cryptocurrency-to-hide-money-how-experts-find-it.html", "Authors": ["Kate Dore"], "Image": "https://image.cnbcfm.com/api/v1/image/106529059-1588968558161gettyimages-1068572030.jpeg?v=1588968677", "Date": "01 June, 2021"}, {"index": 9, "Headline": "StanChart unit to launch cryptocurrency trading platform", "Article": "A logo of Standard Chartered is displayed at its main branch in Hong Kong, China, Aug. 1, 2017. REUTERS/Bobby Yip/File Photo\n\nA Standard Chartered PLC (STAN.L) unit intends to establish a cryptocurrency brokerage and exchange platform in Britain and Europe, targeting institutional clients, the bank said on Wednesday.\n\nThe new exchange will be created by a joint venture between SC Ventures, the bank's innovation arm, and BC Technology Group (0863.HK), which operates Hong Kong-licensed cryptocurrency exchange OSL.\n\nThe move from Asia, Africa and Middle East-focused StanChart is one of the strongest endorsements yet from a mainstream lender for cryptocurrencies, as global banks juggle clients' interest in the digital coins with concerns about their risks.\n\nStanChart's new platform will target the European market, connecting institutional traders with counterparties trading bitcoin, ether and other digital assets, the bank said.\n\nThe move marks a contrast with StanChart rival HSBC, whose chief executive told Reuters last month the bank has no plans to launch a trading desk for cryptocurrencies. read more\n\n\"We have a strong conviction that digital assets are here to stay and will be adopted by the institutional market as a highly relevant asset class,\" said Alex Manson of SC Ventures.\n\nOSL was the first cryptoexchange to be licensed by Hong Kong’s Securities and Futures Commission.\n\nOur Standards: The Thomson Reuters Trust Principles.", "Link": "https://www.reuters.com/technology/stanchart-unit-launch-cryptocurrency-trading-venture-2021-06-02/", "Authors": ["Lawrence White Alun John", "Lawrence White", "Alun John"], "Image": "https://www.reuters.com/resizer/fTzPBfFpefH9yl4cdvH5kzzQf4w=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/LJYPV6IKGFIMNKTVQ52WZ6F6ZY.jpg", "Date": "02 June, 2021"}, {"index": 10, "Headline": "The crypto collapse: Here's what's behind bitcoin's sudden drop", "Article": "In this article TSLA\n\nThe dramatic pullback in bitcoin and other cryptocurrencies comes as a flurry of negative headlines and catalysts, from Tesla CEO Elon Musk to a new round of regulations by the Chinese government, have hit an asset sector that has been characterized by extreme volatility since it was created. The flagship cryptocurrency fell to more than three-month lows on Wednesday, dropping to about $30,000 at one point for a pullback of more than 30% and continuing a week of selling in the crypto space. Ether, the main coin for the Ethereum blockchain network, was also down sharply and broke below $2,000 at one point, a more than 40% drop in less than 24 hours.\n\nThe recent slide is a reversal from the dramatic rise that started in the second half of last year. The price of bitcoin is still up more than 200% since September, the product of a dramatic bull rally sparked in part by hedge fund managers, banks and other companies appearing to embrace cryptocurrency. \"A lot more people own crypto. Crypto has seeped into pockets all over our society and you had a confluence of events -- a combination of Tax Day, Elon Musk tweets, whatnot, where you started breaking down the positivity in the price action, and now we've got a liquidation event,\" longtime bitcoin bull Mike Novogratz said Wednesday on CNBC's \"Squawk Box.\"\n\nInstitutional support retreats\n\nPart of the reason for bitcoin's weakness seems to be at least a temporary reversal in the theory of broader acceptance for cryptocurrency. Earlier this year, Musk announced he was buying more than $1 billion of it for his automaker's balance sheet. Several payments firms announced they were upgrading their capabilities for more crypto actions, and major Wall Street banks began working on crypto trading teams for their clients. Coinbase, a cryptocurrency exchange company, went public through a direct listing in mid-April.\n\nHowever, Musk announced last week that Tesla would no longer accept bitcoin as payment, citing environmental concerns. He did suggest on Wednesday that Tesla is not selling its existing bitcoin holding, using emojis on Twitter to say the company has \"diamond hands.\" And Coinbase, which surged above $400 shortly after its first trade on April 14, quickly gave up those gains and was down near $220 per share on Wednesday morning. Its direct listing date is also the day of bitcoin's most-recent all-time high. Additionally, a new report from JPMorgan said that, based on futures contracts, institutional investors appeared to be moving away from bitcoin and back to gold. Bitcoin is often touted as a potential replacement for the traditional metal as a store of value.\n\nA risk-off trade?\n\nThe weakness is not isolated in crypto, suggesting that the moves could be part of a larger rotation by investors away from more speculative trades. Tech and growth stocks, many of which outperformed the broader market dramatically during the coronavirus pandemic, have also struggled in recent weeks.\n\nThe Ark Innovation ETF, a fund of high-growth stocks led by star fund manager Cathie Wood, is down more than 30% from its February highs. As of Wednesday morning, the tech-heavy Nasdaq Composite has fallen 6.9% from its most recent closing high on April 26. The small cap Russell 2000 is down 5.6% over the same period. The declines have also coincided with the delayed deadline for tax payments, which could have caused selling pressure as investors looked for cash to pay off capital gains tax liabilities.\n\nRegulatory concerns\n\nBitcoin and related assets have also come under increased scrutiny from regulators around the world as they have grown into a bigger part of the financial markets. \"We believe government crackdown on cryptocurrencies can trigger another 'crypto winter' and reduced trading activity. Harsher crackdown on crypto is possible in many developing countries which may view crypto as a threat to their fiat currencies and monetary system,\" Bernstein's Harshita Rawat said in a note Tuesday. China, which is developing its own government-run cryptocurrency, reasserted its rules against other digital currencies on Tuesday, banning financial companies from providing services for crypto trading. In the U.S., newly appointed Securities and Exchange Commission Chair Gary Gensler said earlier this month that he thought regulators should be \"technology neutral\" but more consumer protection is needed in crypto markets.", "Link": "https://www.cnbc.com/2021/05/19/the-crypto-collapse-heres-whats-behind-bitcoins-sudden-drop.html", "Authors": ["Jesse Pound"], "Image": "https://image.cnbcfm.com/api/v1/image/106885587-16214575182021-05-19t203912z_144465080_rc28jn9cpt2v_rtrmadp_0_crypto-currency-bitcoin.jpeg?v=1621457768", "Date": "19 May, 2021"}, {"index": 11, "Headline": "Bitcoin 2021: World’s Largest Cryptocurrency Conference Coming To Wynwood", "Article": "MIAMI (CBSMiami) – On Wednesday, crews were putting the final touches on the Bitcoin 2021 Convention, the world’s largest-ever crypto-currency conference to be held this weekend at the Mana Convention Center in Wynwood.\n\n“We could not be happier. Happier that organizers of the Bitcoin 2021 Conference have chosen the city of Miami”, said Miami Mayor Francis Suarez who held a virtual international crypto conference Wednesday morning.\n\nDuring the virtual conference, Mayor Suarez alluded to his 4-word tweet from months ago, which grabbed the attention of the crypto industry.\n\nOn camera, Suarez stood up showing a t-shirt, “How can I help?” Suarez said, “In the past 6 months since that tweet, we have seen an unprecedented amount of companies, technologists, and investors choose to move Miami.”\n\nMiami’s crypto conference is expected to draw 50,000 people.\n\nThe convention runs from Friday, June 4 through June 6th.\n\nThe conference places Miami firmly in the landscape as the new Silicon Valley.\n\n“Miami is becoming the new capital of capital. It’s becoming an innovative hub. It’s becoming a tier 1 city of venture capital and innovation,” said Brock Pierce. “A lot of the best and the brightest from Silicon Valley and New York have moved their businesses and their firms here.”\n\nAnd Brock Pierce should know. He’s the chairman of Bitcoin Foundation who has “mined” his way through the crypto world. Oh and by the way, he’s a billionaire.\n\n“Mayor Suarez has done an incredible job of saying ‘come here, Miami is the place.’ As a result of it, this has become the most important city in the United States,” Pierce says.\n\nPierce says Miami epitomizes the reason why start-ups and businesses are moving to Miami.\n\nThe quality of life is unparalleled. The taxes are great. But for many, bitcoin or cryptocurrency remains an enigma.\n\nSo, what exactly is it?\n\nBlake Harris, of Blake Harris Law, who specializes in cryptocurrency explains it’s a digital currency recognized worldwide that can be transferred electronically — and no, it’s not like PayPal.\n\n“PayPal is not a currency,” said Harris. PayPal is simply a transfer of fiat currency, whereas bitcoin or athereum are its own kind of currency.”\n\nCrypto is like gold, it can be invested. However, it can’t be manipulated or counterfeited and it’s immune to inflation.\n\nHarris said, “It’s considered a capital asset. It’s taxed the same way any long-term or short-term asset is taxed. If you hold it for less than a year it’s subject to short-term capital gains. If you hold it longer than a year, it’s subject to long-term capital gains.”\n\nThe currency has been used by terrorist groups such as Hamas, according to the Wall Street Journal.\n\nHarris admits until crypto is regulated, that’s a downfall of crypto.\n\n“It’s the beauty and the risk associated with it. It does not require the approval of a bank. It does not require the approval of a government. And so with that, the government and the banks don’t like what will happen.”", "Link": "https://miami.cbslocal.com/2021/06/02/bitcoin-2021-worlds-largest-cryptocurrency-conference-coming-to-wynwood/", "Authors": [], "Image": "https://miami.cbslocal.com/wp-content/uploads/sites/15909786/2021/04/GettyImages-919078630.jpg?w=1024", "Date": "02 June, 2021"}, {"index": 12, "Headline": "‘Coins like ethereum are going to be a lot higher way down the road,' market forecaster Jim Bianco says", "Article": "\"That's got a lot of promise, and that's really what's significant,\" he said. \"The problem is the other driver is kind of an out-of-control casino with people betting on these coins going up and down.\"\n\nAccording to Bianco, the speculative betting is masking a bullish long-term picture. He believes cryptocurrency is successfully remaking the financial system.\n\n\"Some of these coins like ethereum are going to be a lot higher way down the road,\" the Bianco Research president told CNBC's \" Trading Nation \" on Wednesday. \"But you're going to have to stomach through much more of what we saw in the last week coming in the next several months or year or so.\"\n\nIf you can cope with sharp drops in the cryptocurrency space, market forecaster Jim Bianco believes it will ultimately pay off in spades.\n\nBianco warns that the coins are extremely vulnerable to 50% to 70% declines at any moment because it's still a new technology.\n\nHe said once the adoption phase is over and crypto has a fundamental role in the real economy, prices overall will be vastly higher.\n\nBut it could cost investors who bailed during the asset's formative years.\n\n\"That means from that point forward the gains will be a lot less,\" Bianco said. \"The risk and the reward is now you'll have less risk and less reward once it gets adopted and the volatility slows down.\"\n\nBianco, who has owned a basket of digital coins since 2017, said he resists actively trading them. He often buys or sells them about once or twice a year. He owns ethereum, but not bitcoin.\n\nHe suggests it's also key to have exposure to crypto because the space is showing more ties to other risk assets including stocks.\n\n\"That wasn't the case three or four years ago. But it is the case now,\" Bianco said. \"If we were to get higher financial market volatility either in the stock market like the VIX index, that could help bolster the cryptocurrency space as a belief, yes, we need a new fix, and this is the fix.\"\n\nDisclosure: Jim Bianco owns a basket of cryptocurrencies, including ethereum.\n\nDisclaimer", "Link": "https://www.cnbc.com/2021/05/27/coins-like-ethereum-are-going-to-be-a-lot-higher-jim-bianco.html", "Authors": ["Stephanie Landsman"], "Image": "https://image.cnbcfm.com/api/v1/image/104893336-GettyImages-871795430.jpg?v=1622127382", "Date": "27 May, 2021"}, {"index": 13, "Headline": "Advisors pivot to cryptocurrencies as clients want in on the action", "Article": "As investors become more interested in cryptocurrencies, financial advisors are feeling a new urgency to offer the investments to clients.\n\nAbout 49% of advisors said clients have asked about cryptocurrencies in the past six months, up from 17% in 2020, according to the Financial Planning Association and the Journal of Financial Planning.\n\nMore of these financial professionals — 26% — plan to increase how much they use and recommend cryptocurrencies in the next 12 months.\n\nCurrently, 14% of advisors are using or recommending those investments. That's up from less than 1% in 2019 and 2020.\n\nMore from Personal Finance:\n\nHow divorcees are using cryptocurrency to hide money\n\nBitcoin crash opens door to a tax loophole for investors\n\nSmart money moves to make as the economy bounces back\n\n\"Folks are realizing now that it's not going away,\" said Tyrone Ross, CEO of Onramp Invest, a provider of \"cryptoasset\" management technology for financial advisors. The company collaborated with the FPA and the Journal of Financial Planning on the survey.\n\nAdvisors who don't adapt could risk getting left behind.\n\n\"Clients are coming to advisors now knowing more than the advisors,\" Ross said. \"The advisors are absolutely terrified, because you never want to look dumb in front of your client.\"", "Link": "https://www.cnbc.com/2021/06/01/investor-interest-prompts-advisors-to-explore-cryptocurrencies.html", "Authors": ["Lorie Konish"], "Image": "https://image.cnbcfm.com/api/v1/image/104543218-future.jpg?v=1587154350", "Date": "01 June, 2021"}, {"index": 14, "Headline": "Why is the price of bitcoin and other cryptocurrencies falling?", "Article": "Although the price of bitcoin has partly rebounded after last week's rout, the digital currrency remains well off its April 13 high of nearly $65,000. In early trading on Monday bitcoin fetched $38,477, up 12% from the previous day, according to Coindesk.com.\n\nThe extreme volatility that has marked bitcoin's emergence in recent years was on full display when its price plunged as much as 29% earlier this month after financial regulators in China banned domestic banks and other financial institutions from supporting bitcoin. That includes processing payments, allowing customers to hold bitcoin in their accounts and converting bitcoin into yuan or any other currency.\n\nSuch roller-coaster swings in bitcoin and other cryptocurrencies, which have also been buffeted of late, is raising questions about their risks as investments and viability as financial assets. Here's what you should know.\n\nWhat happened to the price?\n\nA on May 18 statement posted on the Chinese Banking Association's website said financial institutions should \"resolutely refrain\" from providing services using digital currencies because of their volatility.\n\nVirtually every cryptocurrency fell after the industry group's statement. Bitcoin slumped to $30,202 before recovering to $38,038, down 12% on the day, according to Coindesk. Most cryptocurrencies lost between 7% and 22% of their value and shares of Coinbase dropped 5.4%.\n\nAnd China isn't the only country clamping down on cryptocurrencies. Many banks in the Middle East are also barred from dealing in bitcoin, while U.S., regulators appear to be leaning toward more actively monitoring cryptocurrencies. On Thursday, the Treasury Department said it would require businesses to report any bitcoin payment over $10,000, citing an effort to crack down on tax evasion.\n\nThe value of bitcoin can change by thousands of dollars in a short time period. On the last trading day of 2020, bitcoin closed just under $30,000. In mid-April, it flirted with $65,000. The price bounced around after that, with some notable swings, before taking a decidedly negative turn last week.\n\nHow bitcoin works\n\nBitcoin is a digital currency that is not tied to a bank or government and allows users to spend money anonymously. The coins are created by users who \"mine\" them by lending computing power to verify other users' transactions. They receive bitcoins in exchange. The coins also can be bought and sold on exchanges with U.S. dollars and other currencies. Some businesses take bitcoin as payment, and a number of financial institutions allow it in their clients' portfolios, but overall mainstream acceptance is still limited.\n\nBitcoins are basically lines of computer code that are digitally signed each time they travel from one owner to the next. Transactions can be made anonymously, making the currency popular with libertarians as well as tech enthusiasts, speculators — and criminals.\n\nBitcoins have to be stored in a digital wallet, either online through an exchange like Coinbase, or offline on a hard drive using specialized software. According to Coinbase, there are about 18.7 million bitcoins in circulation and only 21 million will ever exist. The reason for that is unclear, and where all the bitcoins are is anyone's guess.\n\nDoesn't Elon Musk have a role here?\n\nYes, and a fairly big one. Musk announced in February that his electric car company Tesla had invested $1.5 billion in bitcoin. In March, Tesla began accepting bitcoin as payment. Those actions contributed to the run-up in bitcoin's price, and Musk also promoted the digital currency Dogecoin, which also spiked in value.\n\nHowever, Musk reversed course in just a short time, saying last week that Tesla would stop accepting bitcoin because of the potential environmental damage that can result from bitcoin mining. The announcement sent bitcoin falling below $50,000 and set the tone for the big pullback in most cryptocurrencies.\n\nA number of bitcoin fans pushed back on Musk's reasoning. Fellow billionaire Mark Cuban said that gold mining is much more damaging to the environment than the mining of bitcoin.\n\nA 2019 study by the Technical University of Munich and the Massachusetts Institute of Technology found that the bitcoin network generates an amount of CO2 similar to a large Western city or an entire developing country like Sri Lanka. But a University of Cambridge study last year estimated that on average, 39% of \"proof-of-work\" crypto mining was powered by renewable energy, primarily hydroelectric energy.\n\nBut some companies are using bitcoin?\n\nThe digital payment company Square and its CEO Jack Dorsey — also the CEO of Twitter — have been big proponents of bitcoin. Overstock.com also accepts bitcoin, and in February, BNY Mellon, the oldest bank in the U.S., said it would include digital currencies in the services it provides to clients. And Mastercard said it would start supporting \"select crypto currencies\" on its network.\n\nBitcoin has become popular enough that more than 300,000 transactions typically occur in an average day, according to bitcoin wallet site blockchain.info. Still, its popularity is low compared with cash and credit cards.\n\nThere is skepticism around bitcoin?\n\nYes, plenty of it. Tracking bitcoin's price is obviously easier than trying to figure out its value, which is why so many institutions, experts and traders are skeptical about it and cryptocurrency in general. Digital currencies were seen as replacements for paper money, but that hasn't happened so far.\n\nFederal Reserve Chair Jerome Powell has said the central bank prefers to call crypto coins \"crypto assets,\" because their volatility undermines their ability to store value, a basic function of a currency.\n\nWhile some banks and financial services companies are getting in on it, others are staying away.\n\nCould a digital currency selloff cause broader economic damage?\n\nRegulators aren't very worried about a possible crash in digital currencies dragging down the rest of the financial system or economy.\n\nEven with the recent sell-off, digital currencies have a market value of about $1.5 trillion, according to the website coinmarketcap.com. But that pales compared with the $46.9 trillion stock market, $41.3 trillion residential real estate market and nearly $21 trillion Treasury market at the start of the year.\n\nThe European Central Bank said Wednesday that the risk of cryptocurrencies affecting the financial system's stability looks \"limited at present.\" In large part, that's because they're still not widely used for payments and institutions under its purview still have little exposure to crypto-linked instruments.\n\nEarlier this month, the Federal Reserve said a survey of market contacts found roughly one in five cited cryptocurrencies as a potential shock to the system over the next 12 to 18 months. That's a turnaround from the fall, when a similar survey found none mentioning cryptocurrencies.\n\nHow much oversight is there?\n\nWashington officials have been talking about regulating digital currencies more, and worries about a heavier hand have played a role in the recent swoon in prices.\n\nGary Gensler, who took over as chairman of the Securities and Exchange Commission last month, has said that cryptocurrency markets would benefit from more oversight to protect investors.\n\nIn a hearing before the House's financial services committee earlier this month, Gensler said neither the SEC nor the Commodity Futures Trading Commission, which he used to head, has a \"regulatory framework\" for trading on cryptocurrency exchanges yet. He said he thought Congress would ultimately have to address it because \"there's really not protection against fraud or manipulation.\"\n\nHow bitcoin came to be\n\nIt's a mystery. Bitcoin was launched in 2009 by a person or group of people operating under the name Satoshi Nakamoto. Bitcoin was then adopted by a small clutch of enthusiasts. Nakamoto dropped off the map as bitcoin began to attract widespread attention. But proponents say that doesn't matter: The currency obeys its own internal logic.\n\nIn 2016, An Australian entrepreneur stepped forward and claimed to be the founder of bitcoin, only to say days later that he did not \"have the courage\" to publish proof that he is. No one has claimed credit for the currency since.", "Link": "https://www.cbsnews.com/news/crypto-price-bitcoin-down-2021-05-24/", "Authors": [], "Image": "https://cbsnews3.cbsistatic.com/hub/i/r/2021/05/19/8edc83f1-a9ea-4f02-b48e-0adb30b98046/thumbnail/1200x630/19382be932428563d70d738adcbe7e9a/2021-05-19t203900z-541777464-rc28jn928g9j-rtrmadp-3-crypto-currency-bitcoin.jpg", "Date": "24 May, 2021"}, {"index": 15, "Headline": "Cryptocurrency scams on the rise, impact felt in Lowcountry", "Article": "The Dorchester County Sheriff’s Office is warning about a phone scam from someone claiming to be with Dominion Energy. The scammer is reportedly demanding $2,000 from Dominion customers to take care of an outstanding bill. Of the two reports through the sheriff’s office, one person recognized the scam and hung up. The other person, a Summerville business owner, fell victim to the scammer and forked over the $2,000 in Bitcoin.\n\nA Dorchester County Sheriff’s official says the caller is not with Dominion Energy.\n\n“Don’t go buy gift cards. Don’t go convert cash to bitcoins or any other kind of cryptocurrency to pay a bill like that,” said Rick Carson.\n\nDominion Energy released a statement about this incident and possible future phone scams.\n\nWe want our customers to have the information and resources they need to protect themselves against scams. Utility scammers are very sophisticated, and they are working constantly to use a variety of tactics to take advantage of our customers. They continue to look for any opportunity to target customers or businesses, and they prey on the fear of having electric service disconnected. Often, scammers will work to exploit current events such as sudden changes in temperatures or even the ongoing the pandemic to scare customers and create a false sense of urgency in order to obtain immediate payment or personal information. The most important thing for customers to remember is Dominion Energy will never demand immediate payment information over the phone. If customers suspect they are the target of a scam, they should hang up immediately and always verify account information, balances, and due dates on the Dominion Energy app or online.\n\nScammers are getting more creative with their approaches and now they’re jumping on the cryptocurrency bandwagon.\n\nThe Federal Trade Commission reports that since October 2020, nearly 7,000 people across the United States have reported losses from digital currency scams. Those losses totaling over $80 million.\n\nCryptocurrency has been shrouded in questions since it came on the market nearly a decade ago.\n\nCertified Public Accountant, Tyler Gibbons, has been following the craze for years. He has been invited to speak at cryptocurrency conventions in the past. He breaks down what digital currency is.\n\n“They’re currencies that can be spent online relatively anonymously and they all run through a platform called the blockchain. Kind of like how email is to internet, digital currencies are to the blockchain,” explained Gibbons.\n\nThere are thousands of cryptocurrencies available on the market. Bitcoin was the first to launch, therefore is typically the one most people think of.\n\nIts value fluctuates and many involved in the world of cryptocurrency buy and sell it as it’s value changes.\n\nWith over 100 million people worldwide sending digital dollars back and forth, it’s no surprise scammers are too.\n\n“People need to be very wary of when they have any communication for someone wanting to transact in bitcoin. It’s the same as if someone promises you a million-dollar check in the mail. There are probably certain alarm bells that need to go up,” said Gibbons.\n\nIf you get a phone call or have fallen victim to a scam, report it to your local law enforcement agency.\n\nHere are some tips from Dominion Energy on how to avoid scams relating to the company.\n\nDominion Energy will never threaten immediate service disconnection if payment information is not provided over the phone . The company will never ask for payment using money orders, prepaid debit or gift cards. Company employees will never request to enter a customer’s home without proper identification, an appointment or a reported emergency. Additionally, employees do not ask for payment in person.\n\nOutsmart A Scammer:\n\n· Hang up. If a customer is unsure if a call is valid, even if Dominion Energy’s number shows on the caller ID, they should immediately hang up and never provide personal information.\n\n· Verify. Customers can verify their account status, balances or due dates by signing into the Dominion Energy app, checking their online account at dominionenergysc.com, or by calling the number located on their energy bill. Download the Dominion Energy app here. Customers should also not respond to suspicious emails or text messages or click on links or attachments prompting energy bill payment.\n\n· Report. Tell local authorities about suspicious calls, texts and emails.\n\nStay Vigilant. Stay Connected. Review balances and due dates each month. Customers can access a variety of payment options conveniently, 24/7 by signing into the Dominion Energy app or their online account. Company representatives can also work with customers to determine the best payment options for their unique situation. Both short-term payment extensions and long-term payment plans are available. Customers facing financial hardship can learn more about our year-round energy assistance programs here.", "Link": "https://www.counton2.com/top-stories/cryptocurrency-scams-on-the-rise-impact-felt-in-lowcountry/", "Authors": ["Katie Augustine", "Kristina Lobo", "Raymond Owens", "Tim Renaud"], "Image": "https://www.counton2.com/wp-content/uploads/sites/7/2021/05/GettyImages-887657568-1.jpg?w=1280", "Date": "02 June, 2021"}, {"index": 16, "Headline": "Bitcoin plunges 30% to $30,000 at one point in wild session, recovers somewhat to $38,000", "Article": "Bitcoin plunged 30% to near $30,000 at one point on Wednesday, continuing a major sell-off in the cryptocurrency markets that began a week ago.\n\nThe digital currency hit as low as $30,001.51 as the selling intensified Wednesday before paring some of those losses. The cryptocurrency hasn't traded at those levels since late January.\n\nBitcoin rebounded as the day went on, was down 12% to about $38,205.49 shortly after 3 p.m. ET. At its intraday low, the cryptocurrency's loss for the past week was more than 40%.\n\nThe sharp drop means bitcoin had temporarily erased all its gains following Tesla's announcement that it would purchase $1.5 billion worth of the cryptocurrency. It was also down more than 50% since hitting a record high of $64,829 in mid-April.\n\nOther cryptocurrencies also plunged on Wednesday. Ether, the digital currency that powers the Ethereum blockchain, was down more than 22% at $2,620.97, according to Coin Metrics. Dogecoin, a cryptocurrency that started as a joke and has been talked up by Tesla CEO Elon Musk, fell 25% to less than 36 cents. Both had substantially larger losses earlier in the session.\n\nAdditionally, cryptocurrency exchange Coinbase was temporarily down for some users as the coins plunged on Monday morning.", "Link": "https://www.cnbc.com/2021/05/19/bitcoin-btc-price-plunges-but-bottom-could-be-near-.html", "Authors": ["Ryan Browne Arjun Kharpal", "Ryan Browne", "Arjun Kharpal"], "Image": "https://image.cnbcfm.com/api/v1/image/105496652-1539107947284gettyimages-917296340.jpeg?v=1611325226", "Date": "19 May, 2021"}, {"index": 17, "Headline": "As much as $365 billion wiped off cryptocurrency market after Tesla stops car purchases with bitcoin", "Article": "Hundreds of billions of dollars were wiped off the entire cryptocurrency market after Tesla CEO Elon Musk tweeted that the electric vehicle maker would suspend car purchases using bitcoin.\n\nAt around 6 p.m. ET on Wednesday when Musk made the announcement, the value of the whole cryptocurrency market stood at around $2.43 trillion, according to data from Coinmarketcap.com. By 8:45 p.m., the market capitalization had dropped to around $2.06 trillion, wiping off around $365.85 billion.\n\nThe market has since pared some losses, and by around 3:00 p.m. on Thursday, the cryptocurrency market had seen around $290 billion wiped off its value since Musk's tweet. Bitcoin was down 10.6% at around $48,500, according to Coin Metrics data, its first time below the $50,000 since Apr. 24.\n\nDespite the recent pullback, bitcoin is still up over 400% in the last 12 months.\n\nIn February, Tesla announced in a regulatory filing that it had purchased $1.5 billion worth of bitcoin and planned to accept the cryptocurrency for payments.\n\nMusk cited environmental concerns on Thursday and said Tesla is \"concerned about rapidly increasing use of fossil fuels for Bitcoin mining and transactions, especially coal, which has the worst emissions of any fuel.\"\n\nBitcoin is not issued by a single entity like a central bank. Instead, it is maintained by a network of so-called \"miners.\" These miners use purpose-built computers that require a lot of energy to solve complex mathematical puzzles in order for bitcoin transactions to go through. Bitcoin's energy consumption is larger than some individual countries.", "Link": "https://www.cnbc.com/2021/05/13/bitcoin-btc-price-falls-after-tesla-stops-car-purchases-with-crypto.html", "Authors": ["Arjun Kharpal"], "Image": "https://image.cnbcfm.com/api/v1/image/106851227-1615297653733-gettyimages-1231424737-widak-teslaand210227_npq97.jpeg?v=1616615846", "Date": "13 May, 2021"}, {"index": 18, "Headline": "China bans financial, payment institutions from cryptocurrency business", "Article": "China has banned financial institutions and payment companies from providing services related to cryptocurrency transactions, and warned investors against speculative crypto trading.\n\nIt was China’s latest attempt to clamp down on what was a burgeoning digital trading market. Under the ban, such institutions, including banks and online payments channels, must not offer clients any service involving cryptocurrency, such as registration, trading, clearing and settlement, three industry bodies said in a joint statement on Tuesday.\n\n“Recently, crypto currency prices have skyrocketed and plummeted, and speculative trading of cryptocurrency has rebounded, seriously infringing on the safety of people’s property and disrupting the normal economic and financial order,” they said in the statement.\n\nChina has banned crypto exchanges and initial coin offerings but has not barred individuals from holding cryptocurrencies.\n\nA small toy figurine is seen on representations of the Bitcoin virtual currency displayed in front of an image of China's flag in this illustration picture, April 9, 2019. REUTERS/Dado Ruvic/Illustration\n\nThe institutions must not provide saving, trust or pledging services of cryptocurrency, nor issue financial product related to cryptocurrency, the statement also said.\n\nThe moves were not Beijing's first moves against digital currency. In 2017, China shut down its local cryptocurrency exchanges, smothering a speculative market that had accounted for 90% of global bitcoin trading.\n\nIn June 2019, the People's Bank of China issued a statement saying it would block access to all domestic and foreign cryptocurrency exchanges and Initial Coin Offering websites, aiming to clamp down on all cryptocurrency trading with a ban on foreign exchanges.\n\nThe statement also highlighted the risks of cryptocurrency trading, saying virtual currencies \"are not supported by real value\", their prices are easily manipulated, and trading contracts are not protected by Chinese law.\n\nThe three industry bodies are: the National Internet Finance Association of China, the China Banking Association and the Payment and Clearing Association of China.\n\nOur Standards: The Thomson Reuters Trust Principles.", "Link": "https://www.reuters.com/technology/chinese-financial-payment-bodies-barred-cryptocurrency-business-2021-05-18/", "Authors": [], "Image": "https://www.reuters.com/resizer/LLY7Khqlket92Ls2X3Y3KaVWdNg=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WUGQGUT7UBLJRAZUXWJ2SDRUQQ.jpg", "Date": "18 May, 2021"}, {"index": 19, "Headline": "This new cryptocurrency has people buzzing — its market value is at $35 billion in just 3 days", "Article": "Internet Computer, a cryptocurrency that just launched on Monday now has a market value of about $35.8 billion, according to CoinMarketCap, trading at around $289.\n\nOn Monday, the market value skyrocketed to over $90 billion (at a price of around $731), but within minutes the price fell, hitting as low as $18 billion (priced at about $146).\n\nThe cryptocurrency's founders, the Dfinity Foundation, intend for Internet Computer to become, in effect, a decentralized version of the internet.\n\nThe Internet Computer blockchain uses smart contracts — just as the Ethereum blockchain does — which can power a number of applications and platforms.\n\nFor example, one could build decentralized applications like DeFi (aka decentralized finance) apps. DeFi apps recreate traditional financial systems with cryptocurrency. In addition, developers can build websites and other internet services, like social media or messenger applications, using the Internet Computer blockchain.\n\nBut, unlike Ethereum, Dfinity says the Internet Computer blockchain runs much faster and is less costly — likening its speed and capabilities to the internet — because of the way it is set up.\n\n\"The Internet Computer works in a very different way than any other blockchain,\" Dominic Williams, founder and chief scientist at the Dfinity Foundation, recently told Bloomberg. \"Today, a lot of blockchains run largely on the cloud. The Internet Computer runs entirely on dedicated hardware that are installed by independent parties around the world.\"\n\nIt can run at web speed and can increase its capacity with demand, he said.\n\nWilliams noted that with the traditional internet, developers or users may rely on already developed programs by big tech companies. But with the Internet Computer, users can create their own applications or websites on its blockchain, which isn't run by any one entity since it is decentralized, he said.\n\nThe Internet Computer project raised more than $120 million from investors like Andreessen Horowitz and Polychain Capital.\n\nThough its market value made headlines, the future of its success will remain to be seen.\n\nSince its debut, the Internet Computer token has seen price volatility, which is common with cryptocurrency. While the price may settle as time goes on, Internet Computer does face competition from other blockchains using smart contracts, including Ethereum — especially as Ethereum undergoes its upgrade to Ethereum 2.0 — and Cardano.\n\nInternet Computer is currently ranked No. 9 among the top 10 cryptocurrencies.\n\nEther, the cryptocurrency powered by Ethereum, is at No. 2 with a market value of around $493 billion.\n\nSign up now: Get smarter about your money and career with our weekly newsletter\n\nDon't miss: Mark Cuban: The 3 ways Ethereum 'dwarfs' bitcoin", "Link": "https://www.cnbc.com/2021/05/12/new-cryptocurrency-internet-computer-hit-billions-in-value-after-debut.html", "Authors": ["Taylor Locke"], "Image": "https://image.cnbcfm.com/api/v1/image/106835258-1612439126013-gettyimages-1230723494-ROMANIA_CRYPTO.jpeg?v=1620829560", "Date": "12 May, 2021"}, {"index": 20, "Headline": "Dogecoin soars 15%, captures 5th position: Elon Musk FACTOR? Polka Dot, Shiba Inu gain big too—Check how Bitcoin, Ethereum and other top coins performed TODAY", "Article": "Dogecoin, the famous meme cryptocurrency, is in news and this time again it has got Space X CEO Elon Musk connection. Dogecoin soared over 30 per cent on Wednesday and was up over 14 per cent on Thursday, June 3, at 11.25 am. The spike in price of Doge comes after after the US billionaire tweeted about the coin on Tuesday.\n\nSee Zee Business Live TV Streaming Below:\n\nThe meme coin also broke into top 5 global rankings after yesterday's (June 2) rally, as per CoinSwitch Kuber data, the exchange that facilitates trading in cryptocurrency in INR.\n\nWell, Dogecoin price shot up after Space X CEO tweeted a picture apparently clicked in 1980. It showed Musk's workstation along with the trademark Shiba Inu dog. He tweeted, \" Found this pic of me as a child,\" further captioning the picture in the tweet, \"I have to keep the passion hidden from the public or i'll be socially ostracized.'' It appears this Elon Musk tweet acted as shot in the arm for Dogecoin and it regained first rank 6 and later went on to capture the 5th position globally.\n\nFound this pic of me as a child pic.twitter.com/hUEKluRAdP — Elon Musk (@elonmusk) June 2, 2021\n\nWith the market cap of Rs 4,19,198 crore this P2P open-source cryptocurrency was trading at Rs 33.297015 after hitting 24-hours high of Rs34.889595 and surging from day's low of 28.582358.\n\nMeanwhile, led by Dogecoin, other top-ranked and popular coins were also mostly trading at upper levels.\n\nLet's look at how other coins performed today, June 3, at 12.15 pm\n\n1. Bitcoin: Rs 29, 88,287, up 5.76 %\n\n1-day highest: Rs 29,91,807\n\n1-Day lowest: Rs 28,19, 231\n\n\n\n2. Ethereum: Rs 2,18,997, up Rs 9.98 per cent\n\n1-day highest: 2,18,997\n\n1-day lowest: Rs 2,02,99\n\n\n\n3. Polka Dot: Rs 2,139, up 16.65 per cent\n\n1-day highest: Rs 2161\n\n1-day lowest: Rs 1832\n\n\n\n4. Cardano: Rs 138, up 2 per cent\n\n1-day highest: Rs 138.98\n\n1-day lowest: Rs 133.95\n\n5. Binance Coin: Rs 32216, up 15 per cent\n\n1-day highest: Rs 32,569.31\n\n1-day lowest: Rs 28,018.27\n\nPopular Shiba Inu was up 12.79% and was trading at Rs 0.000758. It made its one-day high of Rs 0.000795 after pulling up from day's low of Rs 0.000664\n\nThe cryptocurrencies have been identified either on their global rankings and market capital or over their popularity among crypto traders. Readers should know that cryptocurrency trading is not banned in India but there is apprehension among traders due to lack of regulations. Recently, RBI has also asked banks and other financial institutions not to quote its old circular that barred these institutions from doing business with cryptocurrency exchanges in India.\n\n", "Link": "https://www.zeebiz.com/personal-finance/news-dogecoin-soars-15-captures-5th-position-elon-musk-factor-polka-dot-shiba-inu-gain-big-too-check-how-bitcoin-ethereum-and-other-top-coins-performed-today-157875", "Authors": [], "Image": "https://cdn.zeebiz.com/sites/default/files/2021/06/03/150944-crypto-musk-reuters.JPG", "Date": "03 June, 2021"}, {"index": 21, "Headline": "Bitcoin's trading action lately is wild even by crypto's standards and the drama is not over yet", "Article": "Bitcoin is still in a stretch of double-digit intraday moves after briefly halving its value last week, and Wall Street strategists say this crazy run won't be over anytime soon. It's been a rude awakening for bitcoin investors who thought they could handle the crypto volatility. The world's largest digital currency suffered a 30% one-day drop last Wednesday, falling to about $30,000 apiece. Just in mid-April, bitcoin hit a record high of $64,829. The turbulence was dramatic even by crypto's standards. The last time bitcoin saw a decline of this magnitude was March 2020 at the height of the Covid pandemic. And even then, the trading wasn't as jarring. Bitcoin has experienced 14 down days in May alone, according to Coin Metrics. So far this year, there have been 39 days with daily swings of 5% or more in either direction, based on bitcoin's closing prices. There were 42 such days in all of 2020.\n\nWhile the digital token bounced back rapidly with the price up 20% above $39,000 on Monday, heightened regulatory pressure as well as its technical picture are pointing to more wild trading ahead, strategists said. \"The drubbing that cryptocurrencies have received over the past two weeks is just a taste of things to come,\" Peter Berezin, chief global strategist at BCA Research, said in a note. \"Crypto markets will continue to face tighter regulation. ... In the near term, the pain in crypto markets could drag down other speculative assets such as tech stocks.\"\n\nThe recent fluctuations came amid elevated regulatory scrutiny in the U.S. and abroad. The U.S. Federal Reserve will soon release a paper outlining its own research into the central bank digital currency area. Meanwhile, Chinese authorities have vowed to crack down on mining and trading of the cryptocurrency. Elon Musk, a proponent of cryptocurrency, also did a sort of 180 on bitcoin when he announced the electric car maker had suspended vehicle purchases using the asset, citing environmental concerns over the so-called computational mining process. \"Bitcoin remains comically volatile,\" said Adam Crisafulli, founder of Vital Knowledge. \"The economic utility of nothing shifts this rapidly.\" Bitcoin's 31.1% intraday decline was the fourth-largest drop on record for the cryptocurrency, according to data from Cornerstone Macro.\n\nMomentum signals remain 'problematic'\n\nLooking at bitcoin futures positioning, analysts at JPMorgan believe the worst of the correction is not in the rearview mirror yet. Momentum traders have pared back their bitcoin futures bets after its failure to break above $60,000 turned sentiment bearish and induced further position unwinds, according to the Wall Street firm. \"Despite the recovery in prices to around $40k, the momentum signals, and in particular the longer lookback period one, remain problematic as a signal,\" Nikolaos Panigirtzoglou, a managing director at JPMorgan, said in a note. \"It is too early to call the end of the recent bitcoin downtrend.\" Carter Worth, chief market technician at Cornerstone Macro, said there are interested sellers waiting at the $42,000 level and this heavy overhead supply will make it hard for bitcoin to go up and breach that level. Meanwhile, buyers who picked up at its recent lows will sell if the price moves up too much, he said. \"It sold off to its trend line,\" Worth said. \"Every move it's made has been technical in nature.\"\n\nRetest of last week's lows possible", "Link": "https://www.cnbc.com/2021/05/24/bitcoins-trading-action-lately-is-wild-even-by-cryptos-standards-and-the-drama-is-not-over-yet.html", "Authors": ["Yun Li"], "Image": "https://image.cnbcfm.com/api/v1/image/104985822-GettyImages-910099824.jpg?v=1621892393", "Date": "24 May, 2021"}, {"index": 22, "Headline": "U.S. Treasury calls for stricter cryptocurrency compliance with IRS, says they pose tax evasion risk", "Article": "The Treasury Department on Thursday announced that it is taking steps to crack down on cryptocurrency markets and transactions, and said it will require any transfer worth $10,000 or more to be reported to the Internal Revenue Service.\n\n\"Cryptocurrency already poses a significant detection problem by facilitating illegal activity broadly including tax evasion,\" the Treasury Department said in a release.\n\n\"This is why the President's proposal includes additional resources for the IRS to address the growth of cryptoassets,\" the department added. \"Within the context of the new financial account reporting regime, cryptocurrencies and cryptoasset exchange accounts and payment service accounts that accept cryptocurrencies would be covered. Further, as with cash transactions, businesses that receive cryptoassets with a fair market value of more than $10,000 would also be reported on.\"\n\nBitcoin reversed course shortly after the Treasury's announcement and was last seen trading up 1.6%, according to Coin Metrics. Previously in the session, it was up more than 9%.\n\nA growing number of Wall Street analysts have over the past month sounded the alarm that regulators at the Treasury and the Securities and Exchange Commission could soon take a more active role in cryptocurrency regulation.", "Link": "https://www.cnbc.com/2021/05/20/us-treasury-calls-for-stricter-cryptocurrency-compliance-with-irs.html", "Authors": ["Thomas Franck"], "Image": "https://image.cnbcfm.com/api/v1/image/106879978-1620407029526-gettyimages-1232744953-AFP_99H77H.jpeg?v=1621537009", "Date": "20 May, 2021"}, {"index": 23, "Headline": "Cybersecurity firm NortonLifeLock will let customers mine crypto", "Article": "New York (CNN Business) Mining for bitcoin and other cryptocurrencies is typically done by companies that own massive server farms operating outside of the United States. But cybersecurity firm NortonLifeLock is hoping to bring mining to your desktop.\n\nNortonLIfeLock NLOK announced Wednesday morning that it is launching a new feature for a select group of early customers of its Norton 360 platform that will allow them to mine for ethereum, the world's second most valuable cryptocurency, on their personal computers.\n\n\"As the crypto economy continues to become a more important part of our customers' lives, we want to empower them to mine cryptocurrency with Norton, a brand they trust,\" said Vincent Pilette, CEO of NortonLifeLock, in a statement.\n\nJUST WATCHED Elon Musk meets with bitcoin miners about energy use Replay More Videos ... MUST WATCH Elon Musk meets with bitcoin miners about energy use 02:14\n\nBroadcom AVGO NortonLifeLock is the consumer cybersecurity company formerly known as Symantec. The company changed its name afterbought the enterprise security software business (which focuses on big corporate customers) of Symantec in 2019.\n\nThe new feature, dubbed Norton Crypto, will be available only to a small group of customers, but the company said it hopes to expand it to all of its nearly 13 million Norton 360 users in the coming months.\n\nRead More", "Link": "https://www.cnn.com/2021/06/02/investing/nortonlifelock-crypto-mining-ethereum/index.html", "Authors": ["Paul R. La Monica", "Cnn Business"], "Image": "https://cdn.cnn.com/cnnnext/dam/assets/210503123938-ethereum-cryptocurrency---stock-super-tease.jpg", "Date": "02 June, 2021"}, {"index": 24, "Headline": "Bitcoin traders using up to 100-to-1 leverage are driving the wild swings in cryptocurrencies", "Article": "In this article BTC.CM=\n\nBitcoin's aggressive moves are being driven by much more than the next China crackdown or Elon Musk headline. Traders taking excessive risk in the unregulated cryptocurrency market being forced to sell when prices go down were in large part responsible for last week's 30% drop in prices and outages for major exchanges, according to analysts. A burgeoning bitcoin lending market is also adding to the volatility. The price of cryptocurrencies tanked last week, with bitcoin losing roughly a third of its value in a matter of hours. Bitcoin popped to nearly $40,000 on Monday but is still down about 33% from its high.\n\nWhen traders use margin, they essentially borrow from their brokerage firm to take a bigger position in bitcoin. If prices go down, they have to pay the brokerage firm back in what's known as a \"margin call.\" As part of that, there's often a set price that triggers selling in order to make sure traders can pay the exchange back. Brian Kelly, CEO of BKCM, pointed to firms in Asia such as BitMEX allowing 100-to-1 leverage for cryptocurrency trades. Robinhood does not allow traders to use margin for cryptocurrency, and Coinbase only allows it for professional traders.\n\n\"You get this crowd factor — everybody's liquidation price tends to be somewhat near everyone else's-- when you hit that, all of these automatic sell orders come in, and the price just cascades down,\" Kelly, told CNBC. Bitcoin traders liquidated roughly $12 billion in levered positions last week as the price of the cryptocurrency spiraled, according to bybt.com. This mass exodus wiped out about 800,000 crypto accounts. \"Selling begets more selling until you come to an equilibrium on leverage in the system,\" said JMP analyst Devin Ryan. That selling begins to \"compound\" as leveraged positions are liquidated, because they can't meet those margin requirements, he said. \"Leverage in the crypto markets — particularly on the retail side — has been a big theme that accentuates the volatility,\" Ryan added. As the crypto market expands, Ryan said he expects leverage to become less of an influence, especially as more institutional capital comes in. Investors, both retail and institutional, have poured into bitcoin and other digital assets in 2021. The world's largest cryptocurrency exchange — Coinbase — said trading volume in the first quarter of the year was $335 billion, of which approximately $120 billion was retail and $215 billion was institutional. Trading volumes totaled about $30 billion in the first quarter of 2020. Mark Cuban weighed in on the leverage aspect for ether, the world's second largest cryptocurrency, on\n\nTwitter last week. \"De-Levered Markets get crushed. Doesn't matter what the asset is. Stocks. Crypto. Debt. Houses. They bring forced liquidations and lower prices. But crypto has the same problem that [high-frequency traders] bring to stocks, front-running is legal, as gas fees introduce latency that can be gamed,\" Cuban said in a tweet last week.\n\nLending\n\nThe other behind-the-scenes cause for selling may have come from the growing bitcoin lending market. Crypto companies such as BlockFi and Celsius allow bitcoin holders to store their crypto with the firm, in exchange for an interest rate of between 6% and 8%. On the back end, those firms lend bitcoin out to hedge funds and other professional traders. They also allow people to use their bitcoin holdings as collateral for loans. For example, if someone took out a $1 million loan backed by bitcoin and the price drops by 30%, they may owe 30% more to the lender. \"As you hit a certain collateral level, firms will automatically sell your bitcoin and send the collateral to the lender,\" BKCM's Brian Kelly said. \"This adds to the massive cascade effect -- there was so much volume that most of the exchanges broke.\"\n\nRegulation", "Link": "https://www.cnbc.com/2021/05/25/bitcoin-crashes-driven-by-big-margin-bets-new-crypto-banking.html", "Authors": ["Kate Rooney Maggie Fitzgerald", "Kate Rooney", "Maggie Fitzgerald"], "Image": "https://image.cnbcfm.com/api/v1/image/105496652-1539107947284gettyimages-917296340.jpeg?v=1611325226", "Date": "25 May, 2021"}, {"index": 25, "Headline": "China to hand out $6.2 million in digital currency to Beijing residents as part of trial", "Article": "A digital Chinese currency red packet is seen on a mobile phone in an arranged photograph as Chengdu city starts to distribute 200,000 E-CNY 'red packets' worth 40 million yuan on February 24, 2021 in Yichang, Hubei Province of China. VCG | Visual China Group | Getty Images\n\nGUANGZHOU, China — China will hand out 40 million renminbi ($6.2 million) of its digital currency to citizens in Beijing in a lottery. Residents of the Chinese capital can use two banking apps to apply to win one of 200,000 so-called red packets as part of the lottery, according to the Beijing Local Financial Supervision and Administration Bureau. Each envelope contains 200 yuan (about $31) of the digital currency which can be spent with selected merchants. The deadline to register is midnight on June 7.\n\nThe world's second largest economy has yet to do a nationwide rollout of the digital yuan, which it has been developing since 2014, but is instead focusing on trials in the form of lotteries around the country. Li Bo, deputy governor of the People's Bank of China (PBOC), said in April that the central bank would expand the scope of its pilot projects and could even allow foreign visitors at the 2022 Beijing Winter Olympics to use it. In February, the southwestern Chinese city of Chengdu handed out 40.2 million yuan of the digital currency. Last year, other cities such as the Chinese technology hub of Shenzhen held their own lotteries.\n\nThe digital yuan is not a cryptocurrency like bitcoin. For one, it is issued by a central authority — the PBOC — while bitcoin is not and therefore \"decentralized.\" Instead, China's efforts are an example of a central bank digital currency (CBDC) and the PBOC is aiming to digitalize bank notes and coins in circulation. In April, PBOC Deputy Governor Li reiterated the digital yuan was for domestic use and not and attempt to challenge the dominance of the U.S. dollar.", "Link": "https://www.cnbc.com/2021/06/02/china-digital-currency-beijing-to-hand-out-6point2-million-in-trial.html", "Authors": ["Arjun Kharpal"], "Image": "https://image.cnbcfm.com/api/v1/image/106846820-1614456380140-gettyimages-1303817571-vcg111318613030.jpeg?v=1621408172", "Date": "02 June, 2021"}, {"index": 26, "Headline": "Ethereum extends gains to rise 8%; bitcoin firms", "Article": "A representation of virtual currency Ethereum is seen in front of a stock graph in this illustration taken February 19, 2021. REUTERS/Dado Ruvic/Illustration/File Photo\n\nCryptocurrency Ethereum extended gains to rise more than 8% on Monday to $2,587 but remained 40% below a record high of above $4,300 hit earlier this month.\n\nAt 1153 GMT, it was trading up 7.4% at $2,565.69.\n\nLarger rival Bitcoin also gained in its wake with the world's biggest and best-known cryptocurrency rising 3.7% to $36,977 in quiet trading with London and U.S. markets shut for holidays.\n\nBitcoin has been less volatile in recent days but is down by more than 35% this month, weighed by growing regulatory pressures on the sector.\n\nLatest positioning data for the week ended May. 25 confirmed the trend with net short positions nearly doubling from the previous week, which was the smallest net short since late March last year.\n\nIn the latest salvo against the cryptocurrency, Bank of Japan Governor Haruhiko Kuroda said much of the trading was speculative. His remarks followed China's recent efforts to crack down on mining activities. read more\n\nIt is currently trading at levels last seen in February and at roughly half its peak value of $65,000 seen in April.\n\nOur Standards: The Thomson Reuters Trust Principles.", "Link": "https://www.reuters.com/technology/ethereum-rises-5-2509-bitcoin-firm-2021-05-31/", "Authors": [], "Image": "https://www.reuters.com/resizer/yeaYVdBQ4_EGCbJU5Z5E6qExbDw=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/VMU2AOPUXRPU7KWLBR6GOWQHCM.jpg", "Date": "31 May, 2021"}, {"index": 27, "Headline": "Cryptocurrency goes green: Could 'proof of stake' offer a solution to energy concerns?", "Article": "At any particular moment, thousands of computers around the world are humming away, crunching complex math problems that create and sustain bitcoin.\n\nThis network gives bitcoin its appeal: decentralized, always on and easily tradeable. But it also means the network is constantly using energy — a sticking point for many of the cryptocurrency's skeptics and critics. And it's not just a bitcoin problem. Other cryptocurrencies and blockchains including Ethereum have similar challenges.\n\nThe debate about bitcoin's environmental impact was elevated earlier this month when Tesla CEO Elon Musk, once one of the most notable bitcoin boosters, said his company would no longer accept it for the purchase of vehicles. He cited the use of fossil fuels for bitcoin mining as a reason.\n\nIt's an issue that some blockchain evangelists think they can solve — and potentially open the door to more widespread adoption of the technology.\n\n\"It's a fundamental breakthrough for humanity, we can now do things that we could not do otherwise,\" said Danny Ryan, a researcher at the Ethereum Foundation, of decentralized computer systems and blockchain technology. \"When humans find new tools they use them. So this decentralized thing, this crypto thing, it's not going anywhere, but there's also a much better way to do it.\"\n\nThe better way is called proof of stake. And for some cryptocurrencies, it's already in use.\n\nProof of work\n\nTo understand the implications of proof of stake, it's important to first detail the way bitcoin currently works: a system called proof of work.\n\nThe idea for bitcoin is generally recognized to have emerged out of a white paper published in 2008 by an anonymous author who used the pseudonym Satoshi Nakamoto. It laid out the idea for proof of work, in which separate parties take on the task of verifying the records and transactions stored in a blockchain.\n\nThe system is entirely decentralized, meaning that many computers from all over the world participate in the blockchain verification process. The underlying code of the bitcoin system governs the process, rather than any central authority.\n\nIn order to participate, bitcoin miners need to use specially constructed computers and have access to a lot of energy. Currently, those computers are in short supply but in high demand. At their core are specialized computer chips and semiconductors, both of which are in a global shortage that has already affected the manufacturing of automobiles, laptops and smartphones.\n\nThe decentralized network of specialized computers, called \"rigs\" or \"mining rigs,\" works hard to solve very complex mathematical equations. By solving the equation, they verify that the blockchain is accurate. People who participate in this verification process are called miners and they are rewarded for their efforts in the form of cryptocurrency, in this case, bitcoin.\n\nThe process is energy intensive. In order to verify that the record is accurate, so-called bitcoin miners expend a significant amount of computing power. The miners verifying the records are then rewarded for their expenditures with bitcoin.\n\nThe security of the system is built into the enormous amount of computing power that is required to run it. In order to hijack the records, an entity would have to contribute over half of the total computing power. In the case of bitcoin, this would be prohibitively expensive and, due to the shortage of hardware, is not feasible.\n\nAnd so, any cryptocurrency built on a proof of work protocol is going to be plagued by, as Musk put it, \"insane\" energy demands as it scales larger. The Cambridge Center for Alternative Finance, a part of the Cambridge Judge Business School, found that bitcoin uses about 110 terawatt-hours per year, which is similar to what Malaysia and Sweden use.\n\nProof of stake\n\nProof of stake takes a different approach to security by ensuring trust in a more old-fashioned currency: money.\n\nTo participate in the blockchain verification process in proof of stake, users create a node, that node can be run by one person or by a pool of people working together. You can think of a node as a computer. The node is required to prove its trustworthiness by locking away a certain amount of crypto coins, the same type generated by the blockchain they are verifying. Imagine putting a deposit in escrow or locking it in a security bond. This process of locking away is called staking.\n\nFor each block of transactions that needs to be verified, one node is selected by an algorithm that takes many factors into account to both reward those with more coins staked and prevent one node from getting too much control over the process. That node is responsible for checking and publishing or adding the block to the chain.\n\nThen all the other nodes get some time to make sure that everything looks good. If there is a mistake or fraud, the node that published the problematic block is punished by having some or all of their staked coins destroyed. But if everything looks good, that node is rewarded with more coins. This is both the security mechanism for the blockchain and the motivator for participation.\n\n\"Instead of buying a bunch of hardware and burning a bunch of energy, I can instead take that asset and lock it in kind of like a security bond,\" said Ryan, the researcher at the Ethereum Foundation.\n\nBecause the basis of proof of stake doesn't require any extra energy to prove trustworthiness, it is much more energy efficient. Unlike in proof of work, where specialized computing equipment like high-end graphics cards are needed, the proof of stake protocol can be run off of a laptop. The nodes are virtual spaces, not physical equipment.\n\nAs a result, participating in the \"mining\" process has a much lower barrier to entry, meaning that more people can participate in the process. And given that a core principle of cryptocurrency is decentralization, having more people participating in securing the blockchain helps secure the whole system.\n\nThe whole process uses marginally more energy than a computer would if it was just on. Researchers like Ryan believe that the result is that energy consumption for proof of stake is 99.99 percent lower than proof of work.\n\nIn practice\n\nProof of stake is already working. Cardano uses proof-of-stake and has the fourth-largest market capitalization — $50 billion — of any cryptocurrency as of mid-May. It is currently the most significant proof of stake cryptocurrency on the market.\n\nCardano surged after Musk tweeted about ending the program to allow people to buy Teslas with bitcoin due to energy efficiency concerns, which sent nearly every other cryptocurrency into steep declines. It has since followed suit and plummeted.\n\nOther already functioning cryptocurrencies that use proof of stake include Polygon, Tezos, Polkadot and EOS.\n\nBut perhaps the biggest potential impact of proof of stake is a project called Ethereum 2.0.\n\nEthereum is the second largest cryptocurrency and has become more popular over the past year as investors have looked to diversify their portfolio away from bitcoin. And at its core, Ethereum is designed to be a versatile platform for an emerging concept called decentralized finance, or the use of smart contracts to automate many financial transactions that today require middlemen.\n\nLaunched in 2015, Ethereum is also run by proof of work, but since its inception, founder Vitalik Buterin envisioned a transition to proof of stake. At the launch of Ethereum, the community agreed to set aside 430,000 ether coins to fund the Ethereum Foundation, a registered nonprofit in Switzerland. That is now equal to about $1 billion. The foundation has supported the community through grants in an effort to move toward the more energy efficient Ethereum 2.0, but in the spirit of decentralization is not leading the way.\n\n\"There's hundreds of people that work on this project,\" said Ryan, who is one of the few researchers employed by the foundation. \"The EF certainly plays a kind of coordination role, and has tried to help facilitate and keep things moving. But I would say it's certainly not centralized.\"\n\nIt is complicated to switch Ethereum to proof of stake. The engineers working on the project have to build and test the proof of stake engine and have it run parallel to the existing system, which continues to run on proof of work. This portion has already begun to slowly come online.\n\nOnce the proof of stake engine is completely online, it will run for some time while bugs are worked out. Then, when the kinks are fixed, the community will ideally come to a consensus and set a time for the swap to happen. Users of the platform and people who hold ether won't be affected; all the changes will happen on the backend. At that moment, the energy usage of the platform is expected to drop by 99.99 percent, according to the Ethereum Foundation.\n\nRyan says the goal is to get this done in 2021, but cautions that 2022 is also fairly likely. And there have been delays before.\n\n\"This is no joke. The Ethereum network is hundreds of billions of dollars, with tens of thousands of people using this platform all the time, and increasingly so,\" he said. \"And so doing it fast is important but doing it safe is more so.\"", "Link": "https://www.nbcnews.com/tech/tech-news/cryptocurrency-goes-green-proof-stake-offer-solution-energy-concerns-rcna1030", "Authors": ["Ezra Kaplan", "Ezra Kaplan Is A Producer For Nbc News."], "Image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-05/210517-crypto-farm-jm-1520-e71f96.jpg", "Date": "01 June, 2021"}, {"index": 28, "Headline": "Can cryptocurrency survive regulators? Here's what Ripple CEO says about XRP's future", "Article": "In this article XRP.BS=\n\nXRP.CM=\n\nKnown for pioneering cryptocurrency XRP, Ripple has been caught in a high-stakes legal tussle with the U.S. Securities and Exchange Commission since last year. Ripple CEO Brad Garlinghouse doubled down on his frustration surrounding the lack of clarity in U.S. regulation of digital assets in an appearance on CNBC's \"Squawk Box\" on Wednesday. He says a big part of the problem with crypto regulation in the U.S. is not the cryptocurrency players, but the lack of action from the U.S. regulators compared to global peers. The SEC charged Ripple, co-founder Chris Larsen and Garlinghouse with conducting an illegal securities offering that allegedly raised more than $1.3 billion through sales of XRP. XRP was trading up about 8% on Wednesday morning amid a crypto rebound, and it is up more than 300% year-to-date, but has fallen far from its YTD high during the recent crash in cryptocurrencies. Bitcoin had bounced back from its massive, recent decline and was hovering around $40,000 on Wednesday. \"There's a misunderstanding of how these technologies can be applied,\" Garlinghouse said. \"In the United States there has been a lack of regulatory clarity. Other countries, G20 markets, they have invested the time and energy, either through legislation or rulemaking, to provide that clarity and certainty, which allows investors to participate, entrepreneurs to build.\" Ripple ranked No. 38 on this year's CNBC Disruptor 50 list.\n\nFights between the crypto industry and regulators are ongoing — on Wednesday, the U.K. banned an advertisement advising people to buy bitcoin calling it \"irresponsible.\" An opinion article in the Wall Street Journal this week called for a ban on crypto and cited issues like hackers using cryptocurrencies to get paid for cyberattacks like the recent Colonial Pipeline ransomware incident. This year's No. 1 CNBC Disruptor company, Robinhood, says in the first quarter of 2021, 9.5 million customers traded crypto on Robinhood Crypto, compared to 1.7 million in the fourth quarter of 2020.\n\nRipple's on-demand liquidity service uses XRP as a kind of \"bridge\" between currencies, which it says allows payment providers and banks to process cross-border transactions much faster than they would over legacy payment rails. Despite this month's return of crypto volatility — bitcoin is still down more than 32% this month for its worth monthly decline since 2018 — it and other tokens like XRP surged to new heights this year. Ripple owns most of the XRP tokens in circulation and sells a tiny fraction of its holdings each month. \"XRP is an open-source technology very analogous to bitcoin,\" Garlinghouse explained. \"But the SEC is making the assertion that these are investment contracts ... that Ripple sales of XRP to our customers is actually an investment contract. That isn't true. If you buy XRP, you don't have ownership of Ripple and ironically you have XRP owners who have tried to sue the SEC for even bringing the case.\"\n\nBitcoin, energy use and Elon Musk", "Link": "https://www.cnbc.com/2021/05/26/can-crypto-survive-regulators-heres-what-ripple-ceo-says-about-xrp.html", "Authors": ["Riley De León"], "Image": "https://image.cnbcfm.com/api/v1/image/105624742-1544683311895gettyimages-951165762.jpeg?v=1544683371", "Date": "26 May, 2021"}, {"index": 29, "Headline": "Cryptocurrencies bounce back after sell-off – here’s what market analysts are saying", "Article": "Bitcoin and other cryptocurrencies bounced back Thursday, recovering some of the losses seen during a major sell-off a day earlier.\n\nExperts give their thoughts on what that fall in the cryptos means for the future of the space.\n\nDavid Rubenstein, co-founder and co-executive chairman of The Carlyle Group, remains optimistic.\n\n\"I think it's here to stay. Cryptocurrency is not going away, just like gold is not going away. Yes, it's had its ups and downs and [Wednesday] was not a good day for it but that's true of anything that is relatively new. … It's here because people in the market want something other than just the traditional currencies that we've had and whether that's right or wrong, it's clearly something that the market wants.\"\n\nMore education will lead to less volatility, said Binance.US CEO Brian Brooks.\n\n\"I would argue the problem is as much educating investors about this stuff as it is about building infrastructure because I think we're at a point in time where many investors don't know the difference between ethereum and filecoin and solana. They just all see it as crypto and you wouldn't buy stocks that way. So, I think we need to focus more on what these tokens represent, what the network value is that is backing them and when we have that level of education, you're going to see some amount of the volatility go away.\"\n\nAnthony Scaramucci, founder of Skybridge Capital, discusses how bitcoin will bounce back.\n\n\"The bull market is intact for bitcoin. If you go back over the different slides in bitcoin over the last 12 years, this is consistent with those slides. Having said that, you had a very big run-up at the beginning of the year because of all the expectation but … most of the smaller players are using tremendous amounts of leverage. Think of the GameStop situation. … So long term, bitcoin is bouncing back, I think that's a flight to quality in the crypto space but if you look at the altcoins I think it's good for crypto and ethereum because they really got blasted.\"\n\nJim Cramer, host of CNBC's \"Mad Money,\" gives his take on the \"hidden\" aspect of bitcoin trading.\n\n\"I think the main concern is how hidden it is. Now I know blockchain is terrific in giving it the power of being hidden but the lack of regulation is causing the IRS to be unsure, you have to check all the boxes of whether you did bitcoin. … This is not a meme, this is a major business.\"\n\nRich Repetto, managing director at Piper Sandler, said volatility is to be anticipated.\n\n\"Expect volatility in these cryptocurrencies. What happened over the past few days. while painful, it's not unusual with how crypto has been priced over the last 10 years. You've seen every year, at least a 28% drop and you've seen three solid cycles of resetting prices. Coinbase is tied to and totally focused on the crypto economy, so we'd expect the stock to reflect some of that volatility as well.\"\n\nSean Horgan, equity research analyst at Rosenblatt Securities, weighs in on the positive aspects of volatility.\n\n\"Volatility is not all bad for an exchange, right? When there's more volatility, there's more engagement, more MTUs, monthly transaction users, there's more trading volumes and that means more revenue, so I actually don't think it's all negative in the short term and it's certainly not in the long term.\"\n\nIan Balina, founder and CEO of Token Metrics, said volatility also means upside potential.\n\n\"Cryptocurrencies, one of the beauties of them is that they're very volatile but as a result of that there's lots of upside. Lots of retail investors and traders are joining the space because of the huge gains whether in bitcoin, whether in ethereum, dogecoins or meme coins but at the end of the day they should zoom out and have a big-picture view. Because right now bitcoin and cryptocurrencies are building the future of finance, the future of open money and if they have that big picture then they should huddle and think long term. We think bitcoin is great technology, but we think bitcoin's days are almost over because bitcoin was designed to be digital cash but now it's just becoming purely a store of value, it's becoming digital gold.\"\n\nMaciej Cegłowski, founder of Pinboard, called it out as a pyramid scheme.\n\n\"My bear case is that it's a giant pyramid scheme. And people are getting sucked into it. Unfortunately, it's a pyramid scheme that has a core of true believers and a core of people that are really fascinated by technology, so it becomes difficult. It also has a group of very smart investors and all kinds of people who are heavily pouring money into it, so it becomes difficult to call it out. But I think it's very necessary to call it out because in the end, like every pyramid scheme, people are going to get hurt\"\n\nDisclaimer", "Link": "https://www.cnbc.com/2021/05/20/cryptocurrencies-bounce-back-after-sell-off-what-market-analysts-are-saying.html", "Authors": ["Marcelle Owona"], "Image": "https://image.cnbcfm.com/api/v1/image/106800765-1606130262265-gettyimages-872670764-set04375-bitcoin_9nov2017_kw0618.jpeg?v=1621541661", "Date": "20 May, 2021"}, {"index": 30, "Headline": "Cryptocurrency crunch is 'a great opportunity to buy,' trader says amid slew of negative catalysts", "Article": "Cryptocurrencies collapsed Wednesday, with bitcoin plunging as much as 30% in a single session amid regulatory pressures overseas and negative headlines on the home front.\n\nIn an interview with CNBC's \"Trading Nation,\" New Street Advisors Group founder and CEO Delano Saporu said that \"for investors that are thinking long term, this is actually a great opportunity to buy at prices you may not see for a while.\"\n\nHe looked back on the history of bitcoin, citing its last major correction in 2017. Though the dip lasted until 2019, the cryptocurrency later took off, hitting records through the beginning of this year.\n\nWith new negative catalysts cropping up — from China's financial institutions barring crypto transactions to Tesla halting vehicle purchases paid in bitcoin — Saporu said this may be a great entry point for long-term investors. He warned, however, that bitcoin will likely move lower in the short term.\n\nAs for the best time to buy into bitcoin, Saporu suggests using dollar-cost averaging.\n\n\"I think right now would be a great time,\" he said. \"If you were buying at the higher levels, you should be buying now.\"\n\nIn the same interview, JC O'Hara, chief market technician at MKM Partners, shared his take on the turbulent trading.\n\n\"What a day for crypto. I think it serves as a good reminder about just how volatile these currencies can be,\" he said, adding that volatility can often evoke emotional responses from investors.\n\nTo get an unbiased read on the trade, he suggested using technical charts.\n\n\"When I look at the chart of bitcoin, I don't think the selling is over just yet,\" O'Hara said.", "Link": "https://www.cnbc.com/2021/05/19/bitcoin-cryptocurrency-drop-a-great-opportunity-to-buy-trader-says.html", "Authors": ["Ernestine Siu", "In Ernestinesiu"], "Image": "https://image.cnbcfm.com/api/v1/image/106119912-1568053295707rts2pvok.jpg?v=1603394729", "Date": "19 May, 2021"}, {"index": 31, "Headline": "Cryptocurrency ethereum hits new record high again; dogecoin slumps", "Article": "A representation of virtual currency Ethereum is seen in front of a stock graph in this illustration taken February 19, 2021. REUTERS/Dado Ruvic/Illustration/File Photo\n\nCryptocurrency ethereum climbed to a new peak for a third straight day on Monday on continued optimism about further growth in decentralized finance or \"DeFi\", although some analysts said it was overvalued at current levels.\n\nEthereum has soared this year, fuelled by the boom in DeFi, which are platforms that facilitate crypto-denominated lending outside traditional banking. Many DeFi applications are embedded in the ethereum blockchain. read more\n\nEthereum, the second-largest coin by market capitalization, hit an all-time high of $4,200 and was last up around 5.2% at $4,133.40.\n\n\"The myriad possibilities of decentralized ledger technologies should be likened to a technological force of nature that will continue to disrupt finance and other businesses,\" said Paolo Ardoino, chief technology officer of cryptocurrency exchange Bitfinex.\n\nAn upcoming technical change to its software seen as reducing its supply has also provided a boost, while new institutional investors in the crypto sector have warmed to it amid a tepid quarter so far for bitcoin.\n\n\"(Crypto has) got a lot more institutional involvement than people who haven't followed the market believe,\" said Chris Weston, head of research at brokerage Pepperstone.\n\nBut some analysts said ethereum's increasing valuation was not underpinned by data of how widely it is used.\n\n\"The continued divergence of its price relative to network activity raise questions about its valuation,\" J.P. Morgan analysts wrote in a report to clients dated May 7.\n\nFactors such as the number of active digital addresses in its network would be more consistent with a price of around $1,000, the U.S. bank said.\n\nBITCOIN STAGNANT\n\nBitcoin , the largest cryptocurrency, rose to a three-week high above $59,600 on Monday. But it was last down 2.9% at $56,632.\n\nBlockchain data provider Glassnode, in a research report on Monday, said there are indications that a portion of bitcoin capital is rotating toward ethereum and dogecoin.\n\nDogecoin, a recent outperformer, however, dropped sharply and was last down 10% at 48.2 cents, according to CoinGecko.com. The currency has been hurt by Tesla Inc (TSLA.O) chief Elon Musk calling it a \"hustle.\" read more\n\nSmaller cryptocurrencies, like dogecoin, known as \"altcoins,\" have been in demand in the past few weeks, pushing bitcoin's share of the overall $2.5 trillion digital currency market to its lowest in around two years.\n\nDogecoin, which began as a social media joke in 2013, is up more than 700% in the last month. It hit a record high on Saturday of 73.15 cents, according to crypto data tracker CoinGecko.com.\n\nMusk's commercial rocket company SpaceX said it would accept the meme-inspired cryptocurrency dogecoin as payment. read more\n\nOur Standards: The Thomson Reuters Trust Principles.", "Link": "https://www.reuters.com/technology/ether-bursts-past-4000-other-cryptos-firm-2021-05-10/", "Authors": ["Tom Westbrook Gertrude Chavez-Dreyfuss Tom Wilson", "Tom Westbrook", "Gertrude Chavez-Dreyfuss", "Tom Wilson"], "Image": "https://www.reuters.com/resizer/RWf8YlrorXy57AvLkLrpGv7IU7s=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/QFS5CLPP3BNR3HJ2YF3DZRLVRA.jpg", "Date": "10 May, 2021"}, {"index": 32, "Headline": "Trader Confesses Cryptocurrency Addiction Led to Criminal Charges, Hospital Treatment – Featured Bitcoin News", "Article": "Trader Confesses Cryptocurrency Addiction Led to Criminal Charges, Hospital Treatment\n\nA British man has shared his story of how his cryptocurrency addiction has led to criminal charges and landed him in a hospital for addiction treatment. He lost more than a million dollars of other people’s money trying to duplicate his previous success in cryptocurrency trading.\n\nCrypto Addiction on the Rise, One Hospital Is Treating Over 100 Crypto Addicts\n\nA British man has shared his story of how his cryptocurrency addiction turned him into a criminal, the BBC reported. Referring to him as Jake, the publication noted Sunday that he is currently in treatment at one of the only hospitals in the U.K. that treats people obsessed with gambling on the value of cryptocurrencies. His identity is not disclosed due to him still being treated at the hospital.\n\nJake lost millions of pounds trading cryptocurrencies. He first bought bitcoin in 2015 but his addiction problem only started a couple of years ago. “I can pinpoint the exact moment it became a problem,” he described. “I had been eroding the sum I put aside, but I entered a trade, and I was willing to risk that last amount I had.” He continued:\n\nI ended up making back pretty much everything I lost in a single trade. The feeling was one of absolute euphoria.\n\nThis euphoric feeling coupled with problems in his marriage and personal life quickly turned him into a crypto trading addict.\n\nAt the time, he was working at a job where was in charge of millions of pounds of other people’s money. He soon began trading with clients’ money hoping to duplicate his previous cryptocurrency trading success. He shared: “The first time I took it, I lost it all in about 20 minutes one night. The market moved very rapidly and I liquidated everything.”\n\nJake faced criminal charges for embezzlement but was able to pay his employer back 1.5 million pounds with the help of his family. He is now in treatment for his addiction.\n\nThere are no stats on the number of people with a severe addiction to cryptocurrency trading. However, Tony Marini, the lead counselor at the bitcoin addiction clinic at Castle Craig hospital in Peebles, said they are seeing an increasing number of addicted individuals in Scotland. In the past few years, the clinic has treated over 100 people for cryptocurrency addictions.\n\nWhile there are people who have lost money trading cryptocurrencies or to crypto scams, there are also those who vow that cryptocurrency has saved them from financial ruin, particularly during the coronavirus pandemic.\n\nCameron is a freelance musician who has been severely hurt by the Covid-19 crisis and the subsequent lockdown, the publication conveyed. He said the situation was “devastating” for him as “Gigs came to an end, schools closed, all my sources of income completely vanished.” He decided to invest in cryptocurrency when the lockdown hit in March last year. “It’s been a really great year of these assets increasing in value to the point where, at least for the short-term, I’m not going to have any financial worries … It’s been such a relief.”\n\nWhat do you think about people with crypto addiction? Let us know in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/trader-cryptocurrency-addiction-criminal-charges-hospital-treatment/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2019/09/addiction.jpg", "Date": "02 June, 2021"}, {"index": 33, "Headline": "Biden Administration Expanding Cryptocurrency Analysis to Find Criminal Transactions – Bitcoin News", "Article": "Biden Administration Expanding Cryptocurrency Analysis to Find Criminal Transactions\n\nThe U.S. government is expanding its cryptocurrency analysis in a strategy to find and pursue criminal transactions. This comes in the wake of a rising problem of ransomware involving cryptocurrency, such as bitcoin. “Combating ransomware is a priority for the administration,” said a spokesperson for the White House.\n\nUS Government to Expand Cryptocurrency Analysis\n\nThe Biden administration unveiled its strategy to combat cryptocurrency ransomware in a White House press briefing Tuesday.\n\n“Combating ransomware is a priority for the administration,” White House Principal Deputy Press Secretary Karine Jean-Pierre said. “President Biden has already launched a rapid strategic review to address the increased threat of ransomware to include four lines of effort.”\n\nJean-Pierre described that one line of effort targets the “distribution of ransomware infrastructure and actors working closely with the private sector,” while another focuses on “building an international coalition to hold countries who harbor ransom actors accountable.” There is also an effort to review “USG’s ransomware policies,” she affirmed, adding that another line of effort is:\n\nExpanding cryptocurrency analysis to find and pursue criminal transactions.\n\nThe White House’s principal deputy press secretary further explained that the four lines of effort build on President Joe Biden’s executive order which “outlines five high-priority cybersecurity initiatives that, if implemented, will reduce the risk of cyberattacks including ransomware.”\n\nRansomware attacks are on the rise worldwide. In the U.S., several major companies have recently been hit with ransomware demanding payments in bitcoin. JBS, the world’s largest meat producer, has reportedly been dealing with what it called an “organized cybersecurity attack” since the end of May.\n\nThe Colonial Pipeline, which supplies the East Coast with nearly half of its fuel needs, also shut down in May for several days when a ransomware attack locked up some of its systems. The pipeline was back online in less than a week but the company admitted to paying a ransom of millions of dollars in bitcoin.\n\nWhat do you think about the Biden administration expanding cryptocurrency analysis? Let us know in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/biden-administration-expanding-cryptocurrency-analysis-criminal-transactions/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2019/09/ransomware.jpg", "Date": "02 June, 2021"}, {"index": 34, "Headline": "Navalny Ally Urges Donors to Use Cryptocurrency Due to Crackdown", "Article": "MOSCOW (Reuters) - An ally of jailed Kremlin critic Alexei Navalny told supporters on Wednesday to move to using cryptocurrencies to help fund their cause as a crackdown threatens to make donations illegal.\n\nRussia has moved to ban Navalny's Anti-Corruption Foundation and regional groups as \"extremist\", dealing a blow to the network built up by President Vladimir Putin's most outspoken opponent. It is illegal to donate to \"extremist\" groups.\n\nA court is next due to consider whether to approve a prosecutorial request to ban Navalny's movement on June 9.\n\nFor years, he and his allies have crowdfunded donations from their supporters via their foundation's website and through other platforms, including using bitcoin, which cannot be traced by Russia's authorities.\n\nOn Wednesday, Leonid Volkov, a close Navalny ally who is based abroad, said it was vital for the group to continue raising funds, but that they needed to protect their supporters.\n\nPolitical Cartoons on World Leaders View All 81 Images\n\nThe group's regular donation point on its website was unavailable on Wednesday and appeared to have been taken down. Volkov did not say anything about such a move.\n\n\"It's not so easy now - the movement of money within the Russian banking system is clear and transparent to the Russian state, and therefore you and I need to get away from it,\" Volkov said in comments on YouTube.\n\n\"Since the state is squeezing us out of simple and understandable collection of donations through the normal banking system, it means we will patiently teach everyone to use cryptocurrencies, and we will learn ourselves,\" he said.\n\nNavalny is serving a 2-1/2-year jail sentence for parole violations he calls trumped up.\n\n(Reporting by Anton Zverev; Writing by Tom Balmforth; Editing by Alison Williams)", "Link": "https://www.usnews.com/news/world/articles/2021-06-02/navalny-ally-urges-donors-to-use-cryptocurrency-due-to-crackdown", "Authors": ["June", "At P.M."], "Image": "https://www.usnews.com/dims4/USNEWS/fbc8dbc/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2Fa2%2F51d6d8934427e6ded99c17f2a6b41f%2Ftag%3Areuters.com%2C2021%3Anewsml_LYNXNPEH5117G%3A12021-06-02T182254Z_1_LYNXNPEH5117G_RTROPTP_3_RUSSIA-POLITICS-NAVALNY-DONATIONS.JPG", "Date": "02 June, 2021"}, {"index": 35, "Headline": "What is mina? Investors warned about ‘wild price swings’ in new cryptocurrency", "Article": "Bitcoin’s wild price moves stem from its design – and you’ll need strong nerves to trade it.\n\nBitcoin’s wild price moves stem from its design – and you’ll need strong nerves to trade it....\n\nMina is one of the latest cryptocurrencies to hit the market, but investors are being warned about “wild price swings”.\n\nInvestors looking to put cash in cryptocurrencies need to be aware that they, like any investment, are a risky business. Making money is never guaranteed and you should make sure you can afford to lose the money you put it in.\n\nCryptocurrencies are highly volatile, so the value of your investments can go down as well as up in the blink of an eye.\n\nNewer cryptocurrencies are also riskier than older ones such as bitcoin, and make you more open to scams.\n\nRELATED: Bitcoin pizza guy squandered a $500 million haul\n\nRELATED: Cryptocurrency’s uncertain future after market crash\n\nWhat is mina?\n\nMina launched in mid-March but it’s been listed on major data tracking website CoinMarketCap for less than 24 hours.\n\nIt claims to be world’s lightest blockchain and is the size of a couple of tweets, according to its website.\n\nThanks to this, it’s said that anyone can connect peer-to-peer and quickly sync and verify the chain.\n\nCryptocurrency exchange platform Kraken listed mina tokens on its website today, meaning deposits and withdrawals are now open.\n\nHowever, it noted that mina trading isn’t currently available for citizens in the US, Canada, Japan and Australia for now.\n\nHow much is mina worth?\n\nThe price of mina tokens is currently sitting at $3.54, according to CoinMarketCap.\n\nIn comparison, it was worth $9.42 earlier on June 1 but there’s not enough data to say price changes over 24 hours.\n\nMina currently has a market cap of more than $513 million.\n\nHow risky is mina?\n\nInvesting is always a risk but investing in cryptocurrency is an even higher risk as they are very volatile, so you should be prepared to lose cash.\n\nThere is also no guarantee that you can convert cryptoassests back into cash, as it may depend on the demand and supply in the existing market.\n\nPlus, fees and charges may be higher than with regulated investment products.\n\nCryptocurrency firms aren’t regulated in the way that other financial firms are. This means that you won’t have any protection if things go wrong.\n\nMyron Jobson, personal finance campaigner for Interactive Investor, told The Sun cryptocurrencies are “notorious for wild price swings”.\n\nHe said: “It is not uncommon for the value of cryptocurrencies to quickly fall by hundreds.\n\n“The yo-yo-ing price of the asset is simply too much for many investors to stomach.\n\n“Cryptocurrencies, and those involved in the space, remain highly speculative and should only be a tiny portion of a portfolio – whatever your risk appetite is.\n\n“It is important to approach new cryptos with extreme caution.”\n\nInvestors are also being warned about other new cryptocurrencies, such as shiba inu coin.\n\nIn January, the UK’s Financial Conduct Authority warned that households risk losing ALL of their money if they invest in cryptocurrencies.\n\nThe value of bitcoin and ethereum crashed a few weeks ago after China announced a further crackdown on cryptocurrencies.\n\nThis story was first published on The US Sun and is reproduced with permission", "Link": "https://www.news.com.au/finance/money/investing/what-is-mina-investors-warned-about-wild-price-swings-in-new-cryptocurrency/news-story/58febfafefc8e918c61b7303a441f94c", "Authors": ["Alice Grahns", "The Us Sun"], "Image": "https://cdn.newsapi.com.au/image/v1/3cdce5065b62670d47089ab4a4b0d958?width=1280", "Date": "02 June, 2021"}, {"index": 36, "Headline": "Comptroller candidate Reshma Patel talks cryptocurrency", "Article": "NEW YORK — Aiming to become the city’s top financial officer, Democrat Reshma Patel on Wednesday evening defended proposing a small portion of the city’s pension funds be invested in cryptocurrencies, arguing some states have seen success with such a move.\n\nIn an interview with “Inside City Hall” Anchor Errol Louis on Wednesday night, Patel, a candidate for city comptroller who was once a financial advisor for the office, urged the trustees of the New York City Employees’ Retirement Systems to allocate between 1 to 3% of their assets into cryptocurrencies like Bitcoin and Ethereum.\n\nPatel cited success stories from pension funds in other states that adopted similar cryptocurrency strategies, while positioning the investment as a hedge against inflation or a potential downturn in traditional stock markets.\n\n“There are two pension funds in Virginia which had invested in a blockchain fund two years ago and then they increased that because the returns had done well,” Patel said.\n\nWhile Patel acknowledged the volatility of cryptocurrency markets, she countered that traditional stock markets also see periods of relatively high risk, too.\n\n“I understand there’s risk — especially in the last few weeks there’s been tremendous risk in this — but last March we had a lot of risk in the S&P [500] as well,” Patel explained.\n\nPatel also vowed to expand the city’s digital banking efforts, specifically in vulnerable, low-income communities, in order to ensure all New Yorkers have access to financial services. Hundreds of thousands of New Yorkers do not have a bank account.\n\nPatel also emphasized her ability to execute financial strategies, citing her years in public finance, as well as the importance of diversity in government.\n\n“I believe that we have a lot of great policy initiatives in our city, but we often fail when it comes to implementation, and this past year really showed the fault lines in our city government. It showed that we can’t have business as usual,” Patel said. “I believe we need more diversity in our city government’s leadership. I believe we need more women and I think we need people, in the role of comptroller especially, who have the technical expertise, which I do.”\n\n------\n\nDid you know you can now watch, read and stay informed with NY1 wherever and whenever you want? Get the new Spectrum News app here.\n\n------\n\nWatch the full interview above.\n\n------\n\nLooking for an easy way to learn about the issues affecting New York City?\n\nListen to our \"Off Topic/On Politics\" podcast: Apple Podcasts | Google Play | Spotify | iHeartRadio | Stitcher | RSS", "Link": "https://www.ny1.com/nyc/all-boroughs/inside-city-hall/2021/06/03/comptroller-candidate-reshma-patel-looks-to-cryptocurrency-to-boost-nyc-s-investment-strategies-", "Authors": ["Patrick Adcroft", "Published Pm Et Jun."], "Image": "https://s7d2.scene7.com/is/image/TWCNews/bitcoin_ap_1", "Date": "03 June, 2021"}, {"index": 37, "Headline": "Cryptocurrencies are close to reaching a big milestone versus gold by one Wall Street firm's count", "Article": "Crypto has gone mainstream amid support from companies and institutional players, and investors are increasingly viewing digital currencies as a reliable store of value and a way to diversify portfolios. Bitcoin , the largest cryptocurrency, traded around $43,300 on Tuesday, putting its market cap at roughly $800 billion, according to data from Coin Metrics.\n\n\"Investors need to find return streams that can hedge debasement risk and be a diversifier of equity risk at higher levels of inflation. These assets [cryptocurrencies] might have the potential to perform that function,\" the firm said Tuesday in a note to clients.\n\nThe total value of the cryptocurrency market now stands above $2 trillion, putting it on nearly equal footing with the amount of gold held for private investment purposes, according to a new report from Bernstein.\n\nCrypto bulls have long championed bitcoin as a modern-day replacement for gold, and by one measure, the new market is already close to surpassing bullion in that respect.\n\nBut Bernstein was quick to note that both gold and digital currencies have other uses. When gold jewelry is thrown into the equation, the precious metal's market worth is closer to $8 trillion, by Bernstein's calculations, making it roughly four times the size of the crypto universe.\n\nAdditionally, there are important differences between cryptocurrencies. Bernstein said bitcoin is primarily used as a store of value, while other digital currencies such as ethereum have functionality beyond being held as an investment.\n\nBernstein's call echoes comments from large money managers who have pointed to the ease with which bitcoin is traded as potentially making it more attractive than gold as a safe haven asset and hedge against inflation.\n\n\"It's easily transportable and can be sent anywhere in the world if you have a smart phone, so it's a much better version, as a store of value, than gold,\" Bill Miller, founder and chief investment officer at Miller Value Partners, told CNBC in April.\n\n\"It [bitcoin] is so much more functional than passing a bar of gold around,\" noted Rick Rieder, chief investment officer of global fixed income at BlackRock.\n\nStill, questions remain around bitcoin's long-term viability, including from regulatory and environmental standpoints. Last week bitcoin prices dropped after Tesla CEO Elon Musk said the company was suspending accepting the cryptocurrency as a form of payment for vehicles due to the \"rapidly increasing use of fossil fuels for bitcoin mining.\" Musk later clarified on Monday that the company has not sold any of its bitcoin position, which was first revealed in February as worth $1.5 billion.\n\nLooking forward, Bernstein's Harshita Rawat said she believes bitcoin can displace gold once some of the regulatory and environmental questions are answered.\n\n\"Bitcoin can more easily be used as a store of value in any part of world (especially in countries with unstable fiat currencies) and is very liquid,\" she noted, pointing to the cryptocurrency's 24x7 network and near instantaneous transactions. \"The implications as a store of value, particularly in certain countries/regimes, are significant.\"\n\nShe said bitcoin and cryptocurrencies more generally have \"reached a tipping point\" in terms of \"institutional/retail adoption, dollar investments, talent working in the industry and liquidity.\"\n\nThat said, Rawat's colleague Inigo Fraser-Jenkins is less certain about how investors will ultimately view bitcoin over the long term. Among other things, he pointed to gold's 5,000-year history, compared to investors only recently viewing bitcoin as able to retain its value.\n\nHe argues that it will be many years before bitcoin can establish enough widespread trust to make it a true safe-haven asset. \"There are very broad economic, legal and cultural issues at play here. Any claim that these can be overcome in a short period of time seems hard to accept given their deep social nature,\" he said.\n\nBecome a smarter investor with CNBC Pro.\n\nGet stock picks, analyst calls, exclusive interviews and access to CNBC TV.\n\nSign up to start a free trial today\n\n— CNBC's Michael Bloom contributed reporting.", "Link": "https://www.cnbc.com/2021/05/18/cryptocurrencies-are-close-to-reaching-a-big-milestone-versus-gold-by-one-wall-street-firms-count.html", "Authors": ["Pippa Stevens"], "Image": "https://image.cnbcfm.com/api/v1/image/106849567-16148981002021-03-04t224621z_1639063173_rc2m4m9rhypv_rtrmadp_0_usa-funds-bitcoin.jpeg?v=1614898543", "Date": "18 May, 2021"}, {"index": 38, "Headline": "Stocks could be volatile in week ahead amid turbulence from cryptocurrency", "Article": "Traders on the floor of the New York Stock Exchange. Source: NYSE\n\nThe trading pattern of the past two weeks – particularly alongside cryptocurrency's movements – suggests stocks could continue to be volatile in the week ahead. Investors are watching the wild swings in bitcoin and trying to gauge whether technology shares can gain traction after a rally attempt in the past week. The Dow and S&P 500 were lower in the past week, but Nasdaq was slightly higher, helped by a positive move in tech, as well as buying in biotech and big cap growth names like FANG members Alphabet, Facebook and Netflix. A steep plunge in bitcoin after China announced new regulations soured the mood for risk assets during the past week. The U.S. also called for stricter compliance with the IRS. Further, on Friday, China said it would crack down on bitcoin mining and trading. \"What's interesting is the market is being bullied around by where bitcoin goes,\" said Peter Boockvar, chief investment officer with Bleakley Advisory Group. Bitcoin plunged by as much as 30% on Wednesday, to about $30,000. Though it recovered to above $42,000, it slid again on Friday. The cryptocurrency was down about 9% late Friday, hovering around $36,000, according to Coin Metrics. \"Bitcoin is a poster child for risk appetite,\" said Boockvar. \"It tells you the stock market is more on uneven ground, if we're getting dragged along by bitcoin.\"\n\nThere is some key data in the week ahead. Consumer confidence, home price data and new home sales are out on Tuesday. Durable goods will be released Thursday, and the consumer sentiment report is issued Friday. But the most important data will be the personal income and spending data, which includes the personal consumption expenditure price deflator, the Fed's preferred inflation measure. \"The key to next week is going to be the inflation numbers. The inflation numbers are now becoming the new payroll numbers in terms of market performance,\" said Boockvar. \"What will also be interesting is inside the consumer confidence numbers, is where the inflation expectations go.\" The consumer price index was surprisingly hot when released last week, showing core inflation at a year over year pace of 3% in April. The core PCE price index was up 1.8% year over year in March. In the week ahead, earnings season is winding down but there continue to be reports from retailers, like Best Buy, Costco and Nordstrom. NVIDIA and Dell also report.\n\nNo correction yet\n\nAs the market has chopped around this month, dip buyers have stepped into the declines and snapped up perceived bargains. Some strategists do not see a correction just yet, though pullbacks could continue.\n\n\"For me, my framework is we can only get a 10% correction when we have a liquidity set back, when we have a policy tightening,\" said Barry Knapp, managing partner of Ironsides Macroeconomics. \"In any of the little disturbances, we are getting about a 4% to 6% pullback. Knapp said investors are fretting too much about higher interest rates being a problem for technology companies. \"You should be in the cyclical parts of tech,\" he said. Knapp noted that subsectors like semiconductors and software should do well with the economic reopening and global manufacturing rebound.\n\nTech squeaked out a slight gain in the past week, gaining 0.1%, but semiconductors popped nearly 3%. Software was up 0.2%. The Nasdaq was 0.3% higher on the week to 13,470, while the Dow was off a half percent at 34,207. The S&P 500 was down 0.4% to 4,155. The best performing sector was real estate investment trusts, up 0.9%, followed by health care, up 0.7%. Biotech was higher on the week with the IBB iShares Nasdaq Biotech ETF, up 1.1%. \"It wouldn't shock me if we went straight back to new highs,\" Knapp said. \"Part of the reason I thought we would trade in a range, was earnings season was done but net revisions is surging.\" He said earnings for the S&P 500 are now expected to be up 7% more for the year than when the first quarter reporting season began. Knapp expects the Fed may discuss tapering its bond buying at its Jackson Hole meeting in late summer, and that is the likely trigger for a correction. Back to World War II, he said the first correction after a recession was triggered by the Fed normalizing policy. \"Last cycle, we had eight of those,\" he said. \"Every attempt they made to normalize policy caused one of these risk off events.\" Knapp said it's natural for investors to be focused on the Fed now. \"It's an uncertainty shock,\" he said. \"It will cause a correction and everyone is focused on it. The Fed has not really changed its policy since the depths of the pandemic.\" Knapp said Treasury yields have drifted lower during efforts in Washington to reach a bipartisan plan on infrastructure spending. But he expects the market to react differently in the next two weeks, since he expects those efforts will clearly fail and Democrats will focus on a big spending program that will increase the deficit. The bitcoin crypto mania was lifted by the idea of big spending from Washington, and the infrastructure spending could be positive. \"The thing that was the surprise in 2021 that really drove the mania was the blue wave and then the spending blowout,\" he said, noting bitcoin gained on the potential for inflation and big deficit spending.\n\nWeek ahead calendar", "Link": "https://www.cnbc.com/2021/05/21/stocks-could-be-volatile-in-week-ahead-amid-turbulence-from-cryptocurrency.html", "Authors": ["Patti Domm", "In"], "Image": "https://image.cnbcfm.com/api/v1/image/106882214-16208517468072-SMWB-OB-Photo-210512-PRESS-24-jpg?v=1620851806", "Date": "21 May, 2021"}, {"index": 39, "Headline": "Cryptocurrency Related Scams Flood Tribunals in Spain – Bitcoin News", "Article": "Cryptocurrency Related Scams Flood Tribunals in Spain\n\nSpain has not been a stranger to the popularity of cryptocurrencies, and with this popularity, also comes the attention of people and organizations wanting to capitalize on the subject. Spanish tribunals have been flooded lately with lawsuits involving cryptocurrency scams related to bitcoin and ethereum based platforms, and the people using these to scam other users for millions of euros.\n\nCryptocurrency-Related Scams Flood Tribunals in Spain\n\nTribunals from Spain are now being flooded with cryptocurrency scam-related cases, that are affecting thousands of citizens, according to local reports. With the recent price increase of cryptocurrencies, scammers are always looking to do a quick buck, and they have been successful in Spain. One of the biggest scams reported is the one associated with a company named Algorithms Group, which scammed more than 280 million euros from 300+ investors.\n\nThe brain behind this scam is a man called Javier Biosca, who acted as a broker buying and selling cryptocurrencies and offering weekly interests of 25% per investment. However, the business went sour quickly and Biosca disappeared with the money of investors. Emilia Zaballos, the lawyer that is representing private investors, states the scam could have affected 4,000 people. She stressed:\n\nAmong those affected are people of all kinds. From notaries, lawyers, national police, businessmen, to tax inspectors and even judges. But also domestic workers, retirees, and the unemployed. And great fortunes.\n\nNimbus, another investment-based Ponzi scheme, is estimated to have defrauded 136 million euros from more than 4,000 investors in the country. The company, which also operated internationally, offered returns to investors for their deposits in cryptocurrencies. Other important companies that are facing similar trials are Kuailian and Arbistar 2.0, Ponzi schemes that also face money laundering charges.\n\nMore Organization Is Needed\n\nEmilia Zaballos, the lawyer that is in the Algorithms Group case, states that more organization is needed for facing this kind of scam schemes affecting more citizens each day. She is now pushing for the establishment of new courts just for attending this kind of crypto-related crimes, and for more guidance from the established institutions when dealing with these structures. Till now, national regulators limit their actions to alert investors about the possible dangers of using these investment tools, but they haven’t exerted any direct actions against them.\n\nBut she is not just waiting for action. Zaballos is the president of an organization called “Asociación de Afectados por Inversiones por Criptomonedas,” that groups the users affected by these organizations and helps them execute legal actions against them.\n\nWhat do you think about the rise of cryptocurrency scams in Spain? Let us know in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/cryptocurrency-related-scams-flood-tribunals-in-spain/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2021/05/shutterstock_1884679732.jpg", "Date": "01 June, 2021"}, {"index": 40, "Headline": "Crypto Firms Fall Short on Anti-Money Laundering Rules, UK Watchdog Says", "Article": "By Tom Wilson\n\nLONDON (Reuters) -Many cryptocurrency firms are not meeting Britain's anti-money laundering and counter-terrorism financing rules, the country's financial watchdog said on Thursday, showing how some parts of the emerging sector are struggling to meet required standards.\n\nThe cryptocurrency world has been plagued through its 12-year life by lax standards on money laundering and other illicit activities.\n\nWhile standards are widely seen to have improved, global regulators and policymakers have in recent months expressed concerns over the illicit use of crypto.\n\nSince January, cryptocurrency-related firms have had to register with Britain's Financial Conduct Authority (FCA) - which oversees their compliance with UK laws designed to prevent money laundering and terrorist financing - before doing business.\n\n\"The FCA will only register firms where it is confident that processes are in place to identify and prevent this activity,\" it said.\n\nOnly five firms are registered with https://register.fca.org.uk/s/search?predefined=CA the FCA. As of May 12, another 90 https://register.fca.org.uk/servlet/servlet.FileDownload?file=0154G0000062BtF have temporary registration, allowing them to continue trading while their applications are assessed. The FCA says this status does not deem them \"fit and proper\".\n\nThe watchdog will extend the end date of its temporary registrations regime from July 9 to the end of March 2022, it said.\n\nThe FCA said 51 firms have withdrawn their applications for registration and can no longer trade. Firms that do not do so are subject to FCA enforcement, it added.\n\n(Reporting by Tom WilsonEditing by Rachel Armstrong, John Stonestreet and Jane Merriman)", "Link": "https://www.usnews.com/news/technology/articles/2021-06-03/uk-regulator-says-cryptoasset-firms-not-meeting-anti-money-laundering-rules", "Authors": ["June", "At A.M."], "Image": "https://www.usnews.com/dims4/USNEWS/1460204/2147483647/thumbnail/970x647/quality/85/?url=http%3A%2F%2Fmedia.beam.usnews.com%2Fac%2F1cd93262429cc3a6e8e75a70e751e0%2Ftag%3Areuters.com%2C2021%3Anewsml_LYNXNPEH52096%3A12021-06-03T064451Z_1_LYNXNPEH52096_RTROPTP_3_CHINA-CRYPTOCURRENCY.JPG", "Date": "03 June, 2021"}, {"index": 41, "Headline": "Elon Musk’s \"Childhood Pic\" with cryptocurrency Dogecoin twist is creating a flutter on Twitter; know why it is making BIG NEWS", "Article": "Tesla Inc Chief Executive Officer (CEO) is in the news once again. This time for tweeting a photo which apparently summed up his childhood. This picture has already seen over 153.6k likes while 22.1k retweets. Twitterati thronged his timeline to post their comments and reactions. At the time of filing the story, he has already received over 22000 replies. Take a look at what he tweeted.\n\nElon Musk Tweet\n\nFound this pic of me as a child pic.twitter.com/hUEKluRAdP — Elon Musk (@elonmusk) June 2, 2021\n\n“Found this pic of me as a child,” Musk tweeted. When the Tesla Inc CEO tweeted that he had found a “pic” from his childhood, Twitter users flocked his timeline to see what actually this picture was all about. To their surprise, Tesla and SpaceX CEO was not sharing an actual photo of his younger days and instead he shared a funny image that apparently summed up his childhood.\n\nSee Zee Business Live TV Streaming Below:\n\nThe photo features a Shiba Inu, a dog breed that is also the face of cryptocurrency Dogecoin. Musk has recently tweeted about Dogecoin – a cryptocurrency, which has been in a lot of news because of his tweets. He has been tweeting about it constantly for a few months now, and his posts have led to fluctuations in its value.\n\nHis tweets on Dogecoin came following his tweets on Bitcoin, in which he recently invested USD 1.5 billion and even went on to say that he would accept bitcoins for Tesla cars. He also took a you turn later tweeting about the energy consumption that Bitcoin did, causing a crash in the prices.\n\nThis picture shows this dog being surrounded by a number of computer screens and keyboards. This picture also carries a note which reads “1980: I have to keep my passion hidden from the public or I will be publicly ostracized.” Along with the post, Mr Musk wrote, “Found this pic of me as a child.”\n\nOne user said that the tech billionaire's interest in Dogecoin is clearly a longstanding one.\n\nAnother user commented on the reference to chess in the image.\n\nYoy can also tweet your reply or reaction in case you have any.", "Link": "https://www.zeebiz.com/world/news-elon-musk-s-childhood-pic-with-cryptocurrency-dogecoin-twist-is-creating-a-flutter-on-twitter-know-why-it-is-making-big-news-157834", "Authors": [], "Image": "https://cdn.zeebiz.com/sites/default/files/2021/06/02/150893-elon-musk-reuters.JPG", "Date": "02 June, 2021"}, {"index": 42, "Headline": "Cryptocurrency: A Financial Fad Or The Future Of Money?", "Article": "THURSDAY on \"The Source\" — People are becoming more and more interested in digital currencies and the price of prominent cryptocurrencies like Bitcoin and Ethereum have skyrocketed, putting the total crypto market value at about $2 trillion.\n\nWhat is cryptocurrency and blockchain technology? What are the different kinds and how do they work? What myths need busting?\n\nDoes virtual cash have real financial legitimacy? What are the conversion rates? How is cryptocurrency audited?\n\nWhat should people know about investing in crypto? What are the risks? How volatile is the market?\n\nWhat are the economic implications of crypto's rising popularity and increasing mainstream adoption?\n\nHow could it affect global financial markets? How could it be regulated?\n\nIs crypto a fad, a scam, or the future of money and finance?\n\nGuests:\n\n\n\n\"The Source\" is a live call-in program airing Mondays through Thursdays from 12-1 p.m. Leave a message before the program at (210) 615-8982. During the live show, call 833-877-8255, email thesource@tpr.org or tweet @TPRSource.\n\n*This interview will be recorded on Thursday, June 3.", "Link": "https://www.tpr.org/podcast/the-source/2021-06-02/cryptocurrency-101-a-financial-fad-or-the-future-of-currency-what-do-you-need-to-know", "Authors": [], "Image": "https://npr.brightspotcdn.com/dims4/default/2c76ea4/2147483647/strip/true/crop/4592x2411+0+519/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9c%2F84%2Fbbe69d0646daa573a301af5a923d%2Fpexels-pixabay-315788.jpg", "Date": "02 June, 2021"}, {"index": 43, "Headline": "Cryptocurrency investors should be prepared to lose all their money, Bank of England governor says", "Article": "LONDON — Cryptocurrencies \"have no intrinsic value\" and people who invest in them should be prepared to lose all their money, Bank of England Governor Andrew Bailey said.\n\nDigital currencies like bitcoin, ether and even dogecoin have been on a tear this year, reminding some investors of the 2017 crypto bubble in which bitcoin blasted toward $20,000, only to sink as low as $3,122 a year later.\n\nAsked at a press conference Thursday about the rising value of cryptocurrencies, Bailey said: \"They have no intrinsic value. That doesn't mean to say people don't put value on them, because they can have extrinsic value. But they have no intrinsic value.\"\n\n\"I'm going to say this very bluntly again,\" he added. \"Buy them only if you're prepared to lose all your money.\"\n\nBailey's comments echoed a similar warning from the U.K.'s Financial Conduct Authority.\n\n\"Investing in cryptoassets, or investments and lending linked to them, generally involves taking very high risks with investors' money,\" the financial services watchdog said in January.\n\n\"If consumers invest in these types of product, they should be prepared to lose all their money.\"\n\nBailey, who was formerly the chief executive of the FCA, has long been a skeptic of crypto. In 2017, he warned: \"If you want to invest in bitcoin, be prepared to lose all your money.\"", "Link": "https://www.cnbc.com/2021/05/07/bank-of-englands-bailey-crypto-investors-risk-losing-all-their-money.html", "Authors": ["Ryan Browne"], "Image": "https://image.cnbcfm.com/api/v1/image/106879713-1620381578303-gettyimages-1206515432-UK_BOE.jpeg?v=1620381661", "Date": "07 May, 2021"}, {"index": 44, "Headline": "Bitcoin hovers around $40,000 after a wild week of trading", "Article": "The price of bitcoin briefly climbed back above $40,000 on Wednesday morning, a week after its price tumbled 30% to around $30,000.\n\nThe world's most popular cryptocurrency traded 6.9% higher at $40,196.06 at 9:00 a.m. ET on Wednesday, according to Coin Metrics data. Bitcoin was last trading about 2.3% higher at $38,469.84 by 4:05 p.m. ET.\n\nOther major digital coins were also in the green Wednesday. Ethereum's price jumped about 7.2% higher to $2,735.71, while dogecoin's price was 1.8% higher at 34 cents a coin.", "Link": "https://www.cnbc.com/2021/05/26/bitcoin-price-bounces-back-above-40000-after-a-wild-week-of-trading.html", "Authors": ["Sam Shead"], "Image": "https://image.cnbcfm.com/api/v1/image/106888428-1622028919907-gettyimages-1232967074-omarques_18052021_crypto_3.jpeg?v=1622028961", "Date": "26 May, 2021"}, {"index": 45, "Headline": "What is Polygon (MATIC) Indian Cryptocurrency? How to Invest?", "Article": "What is Poplygon (Matic) Token?\n\nThe Matic Polygon coin, unlike Bitcoin and Ethereum, is unaffected by high transaction fees owing to congestion. It's an open-source technology that gives developers the tools they need to create a stand-alone network or a secure sidechain using smart contracts and the Ethereum network's security.\n\nLast week, the market capitalization of Polygon, which was created by three Indians, surpassed $10 billion. And, according to Coinmarketcap.com, it is presently among the top 20 crypto tokens in the world, with a market cap of $13 billion.\n\nCoinbase, a Nasdaq-listed company, began trading the Polygon currency in March. Polygon is a set of side roads that Ethereum developers can utilise to construct apps on the Ethereum blockchain more rapidly and cheaply. It's a priceless network.\n\nThe most technically advanced cryptocurrencies with the most intrinsic worth applications - is the key to striking it big in the crypto market right now.\n\nPolygon Matic Coin Details\n\nName: Polygon\n\nSymbol: MATIC\n\nPrice: $1.80\n\nIndian Price: RS 139\n\nRank: 16\n\nMarket Cap: $ 11.26 billion\n\nAll-time high (daily avg.): $ 2.29 on 5/18/2021\n\nPolygon uses a variety of technologies such as\n\nPOS Chain: Polygon's main chain is the Matic POS Chain, an Ethereum sidechain that adds a proof-of-stake (POS) security layer to blockchains created on the platform.\n\nPlasma Chains: Polygon employs Plasma, a scaling technique that allows assets to be moved between the root and child chains using Plasma bridges.\n\nZK-rollups: An alternative scaling approach that uses zero-knowledge proofs for the final public record on the Ethereum main chain to bundle a large number of off-chain transactions into a single transaction.\n\nOptimistic rollups: A system built on top of Ethereum that uses \"fraud proofs\" to enable near-instant transactions.\n\nHow to Buy Polygon (MATIC) in India?\n\nBinance and Coinbase have backed Polygon (previously Matic Network), a Layer 2 scaling solution. The project aims to increase cryptocurrency acceptance by addressing scalability issues across several blockchains.\n\nWazirX offers Polygon\n\nThey are one of the most respected exchanges offering Polygon (MATIC) trading, and they accept clients from all over the world. This exchange is a member of the Binance Group, which guarantees a high level of service.\n\nPolygon (previously Matic), a blockchain scalability platform, was founded by Jaynti Kanani, Sandeep Nailwal, and Anurag Arjun in 2017. It was developed to address the issue of high transaction costs and slowness on ethereum, the world's second-largest cryptocurrency by market value.", "Link": "https://www.goodreturns.in/classroom/what-is-polygon-matic-cryptocurrency-how-to-invest-in-indian-polygon-matic-coin-1210920.html", "Authors": ["Oi-Sneha Kulkarni"], "Image": "https://www.goodreturns.in/img/2021/06/polygon-network-logo-1622691154.jpg", "Date": "03 June, 2021"}, {"index": 46, "Headline": "Goldman Sachs internal memo unveils new cryptocurrency trading team", "Article": "A trader works at the Goldman Sachs stall on the floor of the New York Stock Exchange.\n\nGoldman Sachs has formally kicked off the cryptocurrency trading era on Wall Street.\n\nThe bank informed its markets personnel on Thursday that a newly created cryptocurrency desk had successfully traded two kinds of bitcoin-linked derivatives, according to an internal memo obtained exclusively by CNBC.\n\nThe crypto team exists within the firm's global currencies and emerging markets trading division, reporting to Goldman partner Rajesh Venkataramani, who wrote the memo, and is part of the bank's overall digital assets effort led by Mathew McDermott.\n\nGoldman Sachs, a dominant global investment bank for trading fixed income and equities, had been mulling the creation of a bitcoin trading desk since at least 2017. The firm tabled those plans initially and restarted the crypto trading team in March, Reuters reported earlier this year. Thursday's memo was the first time New York-based Goldman officially acknowledged its involvement in crytpocurrency trading.\n\nUnder CEO David Solomon, Goldman has said it is seeking to broaden its market presence by \"selectively onboarding\" crypto trading institutions to expand offerings. The firm also said it launched a new software platform this week that provides the latest cryptocurrency prices and news to clients.\n\nBanks, including Goldman and rival Morgan Stanley, had announced plans to offer bitcoin investments to rich clients in their wealth management divisions but have mostly stayed away from the volatile asset in their Wall Street trading operations. Traders at firms including JPMorgan Chase have been asking managers when they could begin handling bitcoin, CNBC has reported.\n\nThe derivatives Goldman traded, bitcoin futures and nondeliverable forwards, are ways to wager on the price of bitcoin. The contracts are settled in cash and don't require that Goldman deals with actual bitcoin, called \"physical bitcoin\" in the industry, because the bank isn't yet in a position to do so, Venkataraman noted in the memo.\n\nHere is the memo:\n\n\n\nMay 6, 2021\n\nFormation of Cryptocurrency Trading Team\n\nI am pleased to announce the formation of the firm's cryptocurrency trading team, which will be our centralized desk for managing cryptocurrency risk for our clients. The Crypto trading team will be a part of Global Currencies and Emerging Markets (GCEM), reporting to me, within the firm's Digital Assets effort led by Mathew McDermott.\n\nAs part of our initial launch, we have successfully executed Bitcoin (BTC) NDFs and CME BTC future trades on a principal basis, all cash settling. Looking ahead, as we continue to broaden our market presence, albeit in a measured way, we are selectively onboarding new liquidity providers to help us in expanding our offering.\n\nIn addition, yesterday we launched our Digital Assets dashboard which provides daily and intraday cryptocurrency market data and news to our clients. We invite you to highlight the dashboard to your clients. For more information on trade approval and onboarding, contact the Digital Assets team.\n\nPlease note, the firm is not in a position to trade bitcoin, or any cryptocurrency (including Ethereum) on a physical basis.\n\n\n\nRajesh Venkataramani", "Link": "https://www.cnbc.com/2021/05/07/goldman-sachs-unveils-new-cryptocurrency-trading-team-in-employee-memo.html", "Authors": ["Hugh Son Natasha Turak", "Hugh Son", "Natasha Turak"], "Image": "https://image.cnbcfm.com/api/v1/image/106767146-16039250942020-10-14t141641z_1865342820_rc2eij91c9d6_rtrmadp_0_goldman-sachs-results.jpeg?v=1603925162", "Date": "07 May, 2021"}, {"index": 47, "Headline": "Private equity billionaire David Rubenstein says cryptocurrencies like bitcoin are 'here to stay'", "Article": "Billionaire private equity titan David Rubenstein told CNBC on Thursday he believes cryptocurrencies will remain a part of the financial landscape for years to come, dismissing concerns that the burgeoning asset class is a fad destined to fade away.\n\nIn an interview on \"Squawk Box,\" Rubenstein said he's personally invested in companies that facilitate crypto trading, although not the digital tokens directly. \"I did that, in part, because I think it's here to stay. Cryptocurrency is not going away, just like gold is not going away,\" the Carlyle Group co-founder and co-chairman said, adding some investors see bitcoin as a substitute for gold.\n\nRubenstein's comments Thursday came one day after a hugely volatile day for bitcoin, the world's largest cryptocurrency by market capitalization, and a host of other digital assets. The entire crypto market saw hundreds of billions of dollars of value wiped out after bitcoin plunged more than 30% at its lowest point Wednesday to around $30,000 per token. Bitcoin later recovered some of those losses and traded back up over $41,000 on Thursday.\n\n\"It has its ups and downs, and yesterday was not a good day,\" Rubenstein said, referring to Wednesday's collapse. \"But that's true of anything that is relatively new, and I don't think you're going to see anything like crypto going away and disappearing. It's here.\"\n\nBitcoin and other digital coins traded off their session highs after the Treasury Department on Thursday called for stricter cryptocurrency compliance with the IRS.\n\nAnthony Scaramucci, founder of hedge fund SkyBridge Capital, shared Rubenstein's view around volatility, saying later on \"Squawk Box\" that bitcoin's plunge Wednesday was hardly a historic anomaly. \"I think the bull market is intact for bitcoin. If you go back over the different slides in bitcoin over the last 12 years, this is consistent with those slides,\" Scaramucci said.\n\nSome people remain skeptical of bitcoin, even as Rubenstein and a range of other high-profile investors tout its long-term viability. For example, Berkshire Hathaway Vice Chairman Charlie Munger said earlier this month that the \"whole damn development\" of bitcoin is \"disgusting and contrary to the interests of civilization.\"\n\nRubenstein said that whether people think bitcoin and cryptocurrencies are \"right or wrong,\" it's clear that there's an appetite for an alternative to the current financial system. \"It's here because people in the market want something other than just the traditional currencies that we've had,\" he said.\n\n\"If you go into cryptocurrencies, you should expect big ups and downs and big fluctuations. If you're not prepared for that, don't go into cryptocurrency,\" added Rubenstein, who co-founded Carlyle in 1987 after serving in the Jimmy Carter administration.\n\nFor crypto investors, one lingering question is whether the U.S. government will step up its regulation of digital assets. Securities and Exchange Commission Chairman Gary Gensler, who is new to the role, told CNBC earlier this month that he believes \"we need greater investor protection\" around bitcoin.\n\n\"To the extent that something is a security, the SEC has a lot of authority. And a lot of crypto tokens — I won't call them cryptocurrencies for this moment — are indeed securities,\" Gensler said May 7 on \"Squawk Box.\"\n\nRubenstein weighed in on the prospect of more regulation, saying the idea that \"the government is going to be able to stop cryptocurrency from being something investors want is unrealistic at this point.\"", "Link": "https://www.cnbc.com/2021/05/20/david-rubenstein-says-cryptocurrencies-like-bitcoin-are-here-to-stay.html", "Authors": ["Kevin Stankiewicz"], "Image": "https://image.cnbcfm.com/api/v1/image/104653933-IMG_6594a.jpg?v=1547144222", "Date": "20 May, 2021"}, {"index": 48, "Headline": "Cramer says he owns 'a lot' of red-hot cryptocurrency ether that's tripled bitcoin's 2021 gain", "Article": "CNBC's Jim Cramer said Tuesday he owns ether, the world's second-largest cryptocurrency by market value.\n\n\"I've got a lot of ether,\" Cramer said on \"Squawk Box,\" explaining he initially acquired it in order to bid on nonfungible tokens, or NFTs, being auctioned in March by Time magazine. \"I didn't get it, so I just kept the ether.\"\n\nWhile Cramer did not specify exactly when he bought ether, the digital currency entered March at about $1,400 and rose to around $1,900 by the end of the month. The Time NFT auction closed March 24.\n\nCramer's comments Tuesday came as ether extended its massive rally so far in 2021, setting an all-time high just above $3,500. Ether, which runs on the Ethereum blockchain, has soared more than 370% year to date, with a total market value now above $400 billion, according to CoinMarketCap.\n\nCramer said perhaps he will eventually \"buy a house\" with his ether, a reference to his recent revelation that he sold some of his bitcoin holdings in order to pay off a mortgage. \"I now own a house — lock, stock and barrel — because I bought this currency,\" bitcoin, the \"Mad Money\" host said April 15 on CNBC.\n\nIn a video for his financial news website The Street, Cramer said Monday, \"My Ethereum has gone up tremendously in value, and I'm not selling it.\" He added, \"I sold a lot of bitcoin because I had my eye on a place.\"\n\nBitcoin, which has the biggest market cap of any digital coin, traded above $55,000 per token Tuesday, about 15% lower than last month's all-time high but it's still nearly doubled in 2021. The current price level put bitcoin's total market value at just over $1 trillion, nearly half of the entire crypto market.\n\nCryptocurrencies broadly speaking have moved further into the mainstream throughout 2021. Crypto exchange Coinbase's direct listing last month on the Nasdaq was heralded as a major milestone for the burgeoning digital asset industry.", "Link": "https://www.cnbc.com/2021/05/04/cramer-says-he-owns-a-lot-of-ether-thats-tripled-bitcoin-2021-gain.html", "Authors": ["Kevin Stankiewicz"], "Image": "https://image.cnbcfm.com/api/v1/image/106193851-1571685180347img_3991r.jpg?v=1571685247", "Date": "04 May, 2021"}, {"index": 49, "Headline": "You Have Cryptocurrency Questions. We Have Answers", "Article": "Editorial Independence We want to help you make more informed decisions. Some links on this page — clearly marked — may take you to a partner website and may result in us earning a referral commission. For more information, see How We Make Money.\n\nCryptocurrency is going mainstream — and becoming increasingly difficult for investors to ignore.\n\nCoinbase made headlines recently as the first crypto exchange to go public on the Nasdaq, and established firms like Fidelity are adding crypto to their investment offerings. The adoption of online payments using crypto is growing too, thanks to brands ranging from legacy publisher (and NextAdvisor partner) TIME to digital payment facilitator PayPal and international auction house Sotheby’s.\n\nYou may be wondering what to make of cryptocurrency and whether it has a place in your portfolio. But if you’re not familiar with digital currencies or blockchain technology, even the basic concept can be overwhelming.\n\nHere’s our guide to crypto, and why so many people are talking about it these days.\n\nWhat Is Cryptocurrency?\n\nCryptocurrency is a type of currency that’s digital and decentralized. Cryptocurrencies can be used to buy and sell things, and their potential to store and grow value has also caught the eye of many investors.\n\nThere are thousands of different cryptocurrencies available today. The most popular — and the original — is Bitcoin, which was created in 2009. Other common cryptocurrencies include Ethereum, XRP, and Bitcoin Cash. Each of these currencies serves a different purpose, with some optimized for use in place of cash, and others designed for private, direct transactions.\n\nCryptocurrencies are wholly digital, so there’s no physical coin or bill connected to the crypto you own. Instead, owners hold cryptocurrency in a digital wallet, and buy or sell through an online exchange. Your wallet may be online (some popular exchanges like Coinbase offer an in-app wallet) or stored offline on a hardware device similar to a USB drive.\n\nDecentralization is a primary tenet of cryptocurrency. Whereas most currencies are backed by a central bank — the U.S. dollar, for example, is backed by the “full faith and credit” of the U.S. government — cryptocurrencies are maintained and valued by their users.\n\nCryptocurrency transactions are recorded on a decentralized ledger. This ledger is called a blockchain. Every time crypto is bought or sold, the transaction is added to the blockchain — a public database of the transactions, which is available to other crypto holders. Anyone can join and participate in the blockchain, but data on individual transactions — and the people involved with them — are secured using cryptography (the basis for the term cryptocurrency). For each transaction added to the blockchain, there’s a digital validation process to verify it and prevent fraud.\n\nWhat Can You Do With Cryptocurrency?\n\nWhile it shares characteristics of both currency and investments, there’s still debate among experts about whether cryptocurrency is clearly one or the other.\n\nAs its name suggests, you can use cryptocurrency to make purchases. But your purchasing power is limited; crypto isn’t yet widely accepted among retailers and other businesses.\n\nThat lack of widespread adoption, plus crypto’s volatility, limits its use as a currency, says Roger Aliaga-Díaz, principal and senior economist with Vanguard Investment Strategy Group.\n\nFor many people, crypto is a type of alternative investment. Just as you can buy and trade stock in public companies, you can buy cryptocurrency with the hope that it will increase in value over time, allowing you to cash out for a profit at a later date. Some people invest in crypto less for the belief that it will become a popular currency and more as a bet on the blockchain technology behind it.\n\nBut classifying crypto as an investment is complicated, too. It doesn’t quite fit the mold of a traditional stock or bond, and while cryptocurrencies do share characteristics of commodities like gold — they can be bought and sold for cash and as derivatives based on expected future value — they have no inherent physical value or use.\n\nWithout a clear track record to assess long-term value, cryptocurrency rises and falls on an unpredictable demand cycle. And for individual investors, the challenge is “you really don’t know where supply and demand can end up,” Aliaga-Díaz says.\n\nSimilar to forex — foreign exchange — trading, there can be significant risks involved with a largely unregulated market, and your best bet is to get informed beforehand, and don’t invest any money you can’t afford to lose. Regulators are still trying to figure out how to classify cryptocurrencies, for purposes of trading, payments, antifraud, taxation, and more. Clear regulation may help us understand how to use cryptocurrency and what its future may look like, but we aren’t there yet.\n\n“Where digital assets land, at the end of the day … will be driven in part by regulation, both domestic and international,” Former SEC Chairman Jay Clayton recently told CNBC.\n\nWhat Are the Cryptocurrency Terms You Should Know?\n\nBlockchain: A blockchain is a type of database in which a cryptocurrency’s digital transaction records are stored in groups, or blocks. New blocks are continually created as extensions of the previous block, forming a chain. These blockchains build upon themselves within the database, storing an ever-increasing amount of data about the transactions for a specific cryptocurrency.\n\nA blockchain is a type of database in which a cryptocurrency’s digital transaction records are stored in groups, or blocks. New blocks are continually created as extensions of the previous block, forming a chain. These blockchains build upon themselves within the database, storing an ever-increasing amount of data about the transactions for a specific cryptocurrency. Decentralized: In the context of cryptocurrency, the term decentralized means the currency isn’t backed by a central bank or other financial institution.\n\nIn the context of cryptocurrency, the term decentralized means the currency isn’t backed by a central bank or other financial institution. Distributed ledger technology (DLT): A decentralized digital record. Unlike typical databases, there’s no central authority; the record is stored across multiple locations simultaneously and once a transaction is recorded it’s permanent. Blockchain is a type of DLT, but the technology can serve a number of purposes beyond cryptocurrency trade.\n\nA decentralized digital record. Unlike typical databases, there’s no central authority; the record is stored across multiple locations simultaneously and once a transaction is recorded it’s permanent. Blockchain is a type of DLT, but the technology can serve a number of purposes beyond cryptocurrency trade. Bitcoin: The first cryptocurrency, and still the most popular today.\n\nThe first cryptocurrency, and still the most popular today. Altcoins: Any cryptocurrency that is not Bitcoin. Some popular altcoins today include Ethereum, Dogecoin, and Litcoin. These altcoins each have different features and purposes.\n\nAny cryptocurrency that is not Bitcoin. Some popular altcoins today include Ethereum, Dogecoin, and Litcoin. These altcoins each have different features and purposes. Exchange: A marketplace where you can buy and sell cryptocurrency.\n\nA marketplace where you can buy and sell cryptocurrency. Wallet: A place to store your crypto currency holdings. Many exchanges offer digital wallets.\n\nIs Crypto Safe?\n\nThe blockchain technology backing cryptocurrency is inherently secure, thanks to the decentralized — and public — nature of distributed ledger technology and the encryption process every transaction undergoes.\n\nBut that doesn’t mean it’s completely secure in the same way most people consider the U.S. dollar or other established currencies to be secure. Since cryptocurrency isn’t backed by any governmental authority, it doesn’t have the same protections as many standard currencies throughout the world.\n\nUnlike the money you save in a bank insured by the Federal Deposit Insurance Corporation (FDIC), “If a virtual currency company fails – and many have – the government will not cover the loss,” the Consumer Financial Protection Bureau warned in a 2014 notice about cryptocurrency (its most recent guidance).\n\nThe CFPB names more specific risks that consumers should be prepared for, including volatile exchange rates, potential high fees on exchange platforms, and fraud risk. If your funds are lost or stolen, they can be especially difficult to recover, thanks to the decentralized nature of blockchain and lack of any governmental oversight.\n\nAnd, importantly, just because cryptocurrency is secure does not make it safe. As much as some of the recent popularity of cryptocurrency is driven by investors’ belief in its value, that value is still based on speculation. For those who invest in crypto, it will be among the riskiest investments they make.\n\n“I believe everyone should have a diversified portfolio,” says Daniel Johnson, a financial advisor and founder of RE|Focus Financial Planning in Asheville, North Carolina. Any investment you make should be appropriately weighted against the rest of your portfolio as well as the overall market. Just as you wouldn’t invest all your money in one company, it’s unwise to put every dollar you have into crypto.\n\nWhat Does the Future Hold for Cryptocurrency?\n\nBitcoin and some other cryptocurrencies’ values have skyrocketed in recent years. Bitcoin’s price has more than doubled in 2021, and Ethereum has more than quadrupled in value this year.\n\nBut whether that growth is sustainable, and what it means long-term, is still in question. “This crypto, blockchain technology, the public interest in it right now is being driven by a kind of speculative fever,” says Dr. Richard Smith, executive director of the Foundation for the Study of Cycles, a nonprofit organization dedicated to studying recurring patterns throughout economies and cultures.\n\nStill, an increasing number of big, powerful players are validating crypto’s potential.\n\n“Every single day, the concept that it could be worth something, it could be a store of value is being continually approved by more large, powerful entities,” Johnson says, pointing to established financial institutions holding digital currencies and large corporations adding them to their corporate balance sheets. “The idea that it’s actually worth something is continuing to grow as adoption and acceptance continues to grow as well.”\n\nUltimately, the future of cryptocurrencies — their value, security, and staying power — is still up in the air. But the experts we spoke to believe owning some crypto could create value over time. Whatever your interest or motivation, experts stress the importance of making sure you understand the unique volatility and risk factors of cryptocurrency before investing.\n\n“I think it’s really important to keep your eyes open,” Johnson says. “Don’t get the FOMO at a fever, because it’s very volatile. No one should invest anything that they can’t afford to lose, and that’s the same advice I give for any kind of an investment.”", "Link": "https://time.com/nextadvisor/investing/cryptocurrency/what-is-cryptocurrency/", "Authors": ["Kendall Little", "May"], "Image": "https://time.com/nextadvisor/wp-content/uploads/2021/05/na-what-is-cryptocurrency-1000x630.jpg", "Date": "12 May, 2021"}, {"index": 50, "Headline": "As cryptocurrency goes wild, fear grows about who might get hurt", "Article": "“Why is this happening now; culturally, where are we? We’ve had major world-shaking events, this massive global pandemic, stimulus packages and lots of government spending in the U.S. and elsewhere,” she said. “This is your safe haven; the world is falling apart. Think of it as buying a lottery ticket. Spend whatever you would be comfortable spending in Vegas. You may win big. But you also treat it as entertainment value — the chance to win big.”", "Link": "https://www.washingtonpost.com/business/2021/05/17/dogecoin-bitcoin-cryptocurrency/", "Authors": [], "Image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5GZSL4VYBEI6XPCKMKCJZ5WMVE.jpg&w=1440", "Date": "17 May, 2021"}, {"index": 51, "Headline": "Elon Musk, Snoop Dogg and Mark Cuban love Dogecoin. Should you? How to stay safe when investing in cryptocurrency", "Article": "Billionaires, celebrities and athletes can’t get enough of the crypto craze.\n\nTesla CEO Elon Musk thinks digital currencies are here to stay. So does investor and Dallas Mavericks owner Mark Cuban.\n\nThey’re not alone. Rapper Snoop Dogg jumped on the Dogecoin bandwagon along with Kiss singer Gene Simmons and restaurateur Guy Fieri after the meme-inspired cryptocurrency surged a whopping 10,000% this year.\n\nAthletes are also flocking to bigger cryptos like bitcoin and ether following a record-breaking rally. Trevor Lawrence, the No. 1 NFL draft pick in 2021, partnered with a global cryptocurrency investment app called Blockfolio and plans to place his signing bonus into an account with the company.\n\nWant to invest in crypto? Here’s your guide to the biggest names in digital currency From Dogecoin to Bitcoin to Coinbase, cryptocurrency is the hottest trend in investing right now. Here’s what you need to know before buying in. USA TODAY\n\nSPAC mania: Shaq, Ciara and A-Rod have one, but are SPACs, the latest investment craze, right for you?\n\nBut it’s no longer just enthusiasts and public figures who are dabbling with digital coins.\n\nAmateurs like Earl S. Bell of Brooklyn, New York, are jumping in. He says he’s been an investor for a decade and started to put his money in different cryptocurrencies about a year ago.\n\n“I saw crypto as freedom. In the COVID era, I wasn’t able to get enough work,” says Bell, an architect by trade. “My future plans are to come out with my own coin.”\n\nBell says his plan would include creating bank-like safes for cryptocurrency investors to store their crypto wallets.\n\nSo with all the hype around cryptocurrencies like Dogecoin, bitcoin and ether, should you jump in on the mania, too? It depends on how much you can tolerate extreme volatility in your portfolio.\n\nWhat are cryptos?\n\nCryptocurrencies are digital currency created and exchanged over a decentralized computer network where transactions are secured and verified through coding.\n\nBitcoin, which launched in 2009, is the original and the world’s most popular crypto. It was designed as an alternative to government money and is based on blockchain technology, which acts as a public ledger of transactions.\n\nBitcoin’s value depends on investors’ confidence in it because there is no central authority governing supply. It has mainly been used for speculation by traders rather than for payments.\n\nTweet Facebook Email Email this story Share Share this story Earl S. Bell, amateur cryptocurrency investor I saw crypto as freedom. In the COVID era, I wasn’t able to get enough work. My future plans are to come out with my own coin, and I’m in the process of creating a hardware crypto wallet. Quote icon\n\nPrices for cryptocurrencies are based on supply and demand. That means the rate at which a cryptocurrency can be exchanged for another currency can fluctuate vastly since the design of many cryptocurrencies ensures a high degree of scarcity.\n\nBitcoin bulls have called it a “store of value” – which has historically been reserved for safe-haven investments like gold – and argue that it’s a good investment to hedge against inflation.\n\nThat's because there’s not an unlimited supply of bitcoin. In fact, there are only 21 million bitcoins that can be mined, and about 18 million have been mined so far. Bitcoin mining is the process that creates cryptocurrency. It is resource-intensive in an effort to control the number of bitcoins in circulation.\n\nTrevor Lawrence, the No. 1 NFL draft pick in 2021, partnered with a global cryptocurrency investment app called Blockfolio and plans to place his signing bonus into an account with the company.\n\nEnthusiasm around Bitcoin spurred other digital tokens.\n\nEthereum, which launched in 2015, is a blockchain-based software platform that is primarily used to support ether, the world's second-largest cryptocurrency by market value at more than $400 billion. It eclipsed $3,900 on Saturday to touch another all-time high, rising more than 400% in 2021.\n\nEther supply, however, isn't capped and new tokens are created through a similar mining process as bitcoin.\n\nA screengrab from the dogecoin.com website. One of the Dogecoin founders told a cryptocurrency news site that the token's rise makes him worry about market excess. dogecoin.com\n\nThe \"memecoin\" Dogecoin was created in 2013 as a joke poking fun at the surge in other digital coins. Dogecoin was inspired by the popular Doge meme, which is an image of a Shiba Inu dog staring sideways at the camera with raised eyebrows.\n\nThe latest surge has pushed Dogecoin’s market capitalization to $62 billion, which means it’s valued more highly than Ford and Twitter. In 2021, it has surged from less than half a penny to a record of nearly 75 cents. It's currently trading just below 50 cents.\n\nWhat cryptos aren't\n\nCryptocurrencies aren't a currency supported by governments, and they aren't a piece of a company, like a stock. But the factors that determine their underlying worth are unclear, experts say.\n\nFor those who invest in a stock, the price of a share should be the present value or future profit that a company is going to generate, according to Itay Goldstein, a professor of finance and economics at the University of Pennsylvania's Wharton School of Business.\n\nItay Goldstein, a professor of finance and economics at the University of Pennsylvania's Wharton School of Business No one can tell you whether bitcoin priced at $50,000, $60,000, or $70,000 is too much or too little. So as a result, it takes on a life of its own. ...People start to believe that’s what it should be and then it crashes with no clear guidance on where it should stop. Quote icon\n\nWhen it comes to cryptocurrencies, it’s really up in the air, he says.\n\n“No one can tell you whether bitcoin priced at $50,000, $60,000, or $70,000 is too much or too little,” says Goldstein. “So as a result, it takes on a life of its own. ... People start to believe that’s what it should be and then it crashes with no clear guidance on where it should stop.”\n\nWhy Mark Cuban loves them\n\nCuban is one of the core investors on NBC’s reality show \"Shark Tank.\" He told USA TODAY he’s a big believer and investor in cryptocurrency.\n\nCuban says he first started investing in cryptocurrencies in 2017 and added to his investments last year and this year. He declined to say how much he has invested, except that it’s “not enough.”", "Link": "https://www.usatoday.com/in-depth/money/investing/2021/05/09/dogecoin-bitcoin-ethereum-cryptocurrency-investment-elon-musk/4976894001/", "Authors": ["Jessica Menton", "Craig Harris", "Usa Today"], "Image": "https://www.gannett-cdn.com/-mm-/b2b05a4ab25f4fca0316459e1c7404c537a89702/c=0-0-1365-768/local/-/media/2021/03/07/USATODAY/usatsports/imageforentry84-1aw.jpg?width=1200", "Date": "09 May, 2021"}, {"index": 52, "Headline": "Media mogul Barry Diller says cryptocurrencies are a 'con'", "Article": "Veteran investor and IAC chairman Barry Diller said Friday that he doesn't trust cryptocurrencies and believes that the digital assets are \"a con.\"\n\n\"I watch some of the people that you have on and they talk about it – $40,000, $12,000, whatever – I think 'this is nutso talk,'\" Diller said CNBC's \"Squawk Box\" after originally indicating he didn't want to talk about the crypto space.\n\nDiller's comments came after a volatile week in the cryptocurrency world, in which a major sell-off on Tuesday and Wednesday dragged the price of bitcoin down more than 30% to $30,000 at one point before stabilizing near $40,000. Other crypto assets, including ether and dogecoin, also declined.\n\nThe dramatic sell-off happened amid increased worry about regulation from the U.S. and China and environmental issues around bitcoin, highlighted by Tesla CEO Elon Musk.", "Link": "https://www.cnbc.com/2021/05/21/media-mogul-barry-diller-says-cryptocurrencies-are-a-con.html", "Authors": ["Jesse Pound"], "Image": "https://image.cnbcfm.com/api/v1/image/106216489-1572545732717nup_187507_0391.jpg?v=1572545981", "Date": "21 May, 2021"}, {"index": 53, "Headline": "Top cryptocurrency 2021 by value: Bitcoin, Ether, Dogecoin, BinanceCoin and more", "Article": "Editor's note Be careful with cryptocurrency. The crypto market is highly volatile and we do not recommend any particular cryptocurrency.\n\nIt's pretty easy to find out what the top cryptocurrency is at any given time: it's been Bitcoin for years now and that's unlikely to change soon. However, the market below it moves very quickly, which can make it hard to keep up with all of the various altcoins.\n\nHowever, it's important that you do know about them, because investing in cryptocurrency can be a risky business. The crypto market is far more volatile than traditional stocks, with some coins growing in value swiftly, then dropping just as rapidly. Bitcoin, for instance, rose from $45,000 in March to a high of $63,000 in mid-April — then plunged to $35,000 in May.\n\nIf you do decide to buy cryptocurrency, a good piece of advice is never to spend more than you can afford to lose. Calculate the effect on your investment if the coin you owned were to fall by 20%, 50% or even 80% overnight and weigh up whether you could afford to hold on in the hope that values rose again, or if you'd be tempted to sell at a loss.\n\nThat said, even if you're not thinking of investing, cryptocurrency is a fascinating subject.\n\nWhile we all know about Bitcoin, there are hundreds, if not thousands, or other cryptocurrencies. Many are alternative — supposedly improved — versions of Bitcoin, but others, like Ethereum, Cardano and Chainlink, are much more than just a currency. And then there's Dogecoin, which started off as a joke but is now one of the most valuable cryptocurrencies, plus other \"memecoins\" such as Shiba Inu coin.\n\nIn our guide to the top cryptocurrency performers, we outline the stories behind some of the key cryptos to be aware of, plus their current value, latest news and more.\n\nDogecoin climbed to its highest value for two weeks on the back of the news that it will this week be listed on the Coinbase Pro exchange. At one point today it reached $0.43 and is currently up by 20% in the past 24 hours.\n\nPresident Joe Biden's 2022 budget proposal includes several new crypto reporting requirements, according to Coindesk.\n\nApple is recruiting for a person with cryptocurrency experience to work on \"Alternative Payments.\"\n\nWhat is the top cryptocurrency by value?\n\nSo, which is the top cryptocurrency right now? One approach is to look at market capitalization — essentially the total dollar value of a company's shares of stock. And in that regard, it's hard to see beyond Bitcoin and Ethereum, which have sizable leads over their respective competition.\n\nYou can also look at the price of an individual cryptocurrency share, or coin, which is useful for knowing how well (or otherwise) a crypto is performing, but it doesn't always tell the full story. So we're sticking with market cap for this guide to the top cryptocurrency performers right now.\n\nThat said, many of the other crypto projects listed below are super interesting and certainly worth looking further into. And with new cryptocurrencies such as SafeMoon and Chia springing up seemingly every day, we'll be updating this top cryptocurrency list regularly.\n\nHere are all the top cryptocurrencies (by market cap as of June 2).\n\n1. Bitcoin (BTC)\n\n(Image credit: Shutterstock)\n\nBitcoin market cap: $706.1 billion\n\nBitcoin value: $37,757\n\nThe Bitcoin story: Bitcoin has been around since 2008 and is the blue chip cryptocurrency. It has, by far, the largest market cap, the highest coin value, and the largest network of users.\n\nBitcoin was created by an unknown person or group who goes by the name of Satoshi Nakamoto. It was supposed to be the cash of the future, and although you can use it today to purchase many goods and services, you wouldn’t use it to buy a cup of coffee because the cost of the transaction would be too high.\n\nThink of Bitcoin instead like the gold of the future: not really useful for daily transactions, but you want to have some for its stored value. It’s also like gold in that it has a limited supply, which is one of the things that makes Bitcoin so attractive to investors: a total of 21 million Bitcoins will ever be released, which makes Bitcoin inflation-proof.\n\nBitcoin performance history: Like all cryptos, Bitcoin started out worth virtually nothing. In 2017 it took off from under $1,000 to over $20,000, but within a year was down around $4,000. In late 2020 it began skyrocketing again, this time from around $10,000 to a high of more than $60,000, before dropping in the past few weeks, mostly due to various Elon Musk tweets. It's currently worth around $37,700.\n\nHow to buy Bitcoin: Bitcoin can be purchased on crypto exchanges such as Coinbase, Binance, and Kraken; at Bitcoin ATMs; on PayPal; and on Robinhood. Don’t be put off by the high price of a coin: you can invest as little as $25 in Bitcoin on Coinbase.\n\n2. Ethereum (ETH)\n\n(Image credit: Filippo Ronca Cavalcanti/Shutterstock)\n\nEthereum market cap: $317.5 billion\n\nEther value: $2,731\n\nThe Ethereum story: If there is another contender for the top cryptocurrency title, it's Ethereum. But it doesn’t compete with Bitcoin. It’s important to note that many so-called cryptocurrencies aren’t straight-up currencies like Bitcoin. Some, like Ethereum, are instead unique technologies that also have a coin component. In Ethereum’s case, its currency is called Ether, and it can be used in applications run on the Ethereum platform.\n\nEthereum is the leader in what’s known as these “smart contract” platforms. While Bitcoin was created for one use case — as a currency — Ethereum was founded by Vitalik Buterin in 2015 with bigger and broader ambitions. The blockchain it runs on is programmable, meaning it can run programs, or apps, in a decentralized way, i.e., on millions of computers at once. This opens up many possible use cases, from technology and finance to gaming and collectibles, making Ethereum an attractive investment.\n\nIt's also worth noting that a new version of Ethereum is coming soon. Among other things, Ethereum 2.0 will reportedly by 99.95% more environmentally friendly than the current model.\n\nEthereum performance history: In the past year, Ethereum’s price has shot up from around $200 to well over $3,000. In fact, it recently passed $4,000 for the first time in early May and reached an all-time high of more than $4,350 recently, but has fallen sharply recently and currently stands at around $2,700.\n\nHow to buy Ethereum: You can buy ETH on the major crypto exchanges, Robinhood, and PayPal.\n\n3. Binance Coin (BNB)\n\n(Image credit: Shutterstock)\n\nBinance Coin market cap: $62.1 billion\n\nBinance Coin value: $404.9\n\nThe Binance Coin story: Binance Coin was launched in 2017 by the Binance cryptocurrency exchange, the world’s largest crytpo exchange by volume. During its initial coin offering (ICO), it sold 100 million coins to the public at $0.15 per coin. Binance Coin can be used to pay transaction fees on the Binance exchange, to trade for other cryptocurrencies, and to pay for some goods and services. Every quarter, Binance uses 20% of its profits to buy back and destroy Binance Coins. This will continue until Binance buys back and destroys 50% of the total supply, making its coin scarcer and therefore more valuable.\n\nBinance Coin performance history: Since launching in 2017, Binance Coin has made a long, slow climb to about $60 a coin, before shooting upwards in February 2021 and reaching more than $600 at one point. As with virtually all of the top cryptocurrencies, it suffered a major fall recently; it's currently trading in the $375 range.\n\nHow to buy Binance Coin: The best place to buy, sell, trade, and hold Binance Coin is Binance\n\n4. Tether (USDT)\n\n(Image credit: Shutterstock)\n\nTether market cap: $61.7 billion\n\nTether value: $1\n\nThe Tether story: Tether is unique among the options in our top cryptocurrency list: it's the leader in the category of cryptocurrency known as “stable coins.” Why stable? Because they are pegged to a traditional currency, in this case the US dollar.\n\nFor investors, these tokens offer the joint benefits of open blockchain technology and traditional currency. Tether was launched in 2015 and operates on the Ethereum platform. USD Coin is another stable coin, and many crypto folks think it’s a safer bet than Tether, citing a greater transparency.\n\nTether performance history: One Tether token = one USD. Always has, always will.\n\nHow to buy Tether: Buy, sell, and use Tether tokens at Coinbase, Binance, Kraken, and other major crypto exchanges.\n\n5. Cardano (ADA)\n\n(Image credit: Shutterstock)\n\nCardano market cap: $56.4 billion\n\nCardano value: $1.76\n\nThe Cardano story: Cardano, founded in 2017, is another Ethereum-like contender for the top cryptocurrency crown: a blockchain platform that supports applications, systems, and real-life business use cases. It’s a promising technology but, like all the others, has a lot of catching up to do with Ethereum in terms of its network size.\n\nWhat makes Cardano unique is that it is the first blockchain platform to evolve out of a scientific philosophy and a research-first driven approach. The development team consists of a large global collective of expert engineers and researchers, and the platform was built through peer-reviewed research.\n\nCardano performance history: Cardano was cruising along at about $0.10 from its founding in 2017 until early 2021, when it jumped to well over a dollar and was recently trading at around $2. Cardano had weathered the recent crypto market problems better than most, due to being one of the more environmentally friendly cryptocurrency options, but suffered a big fall recently and is now back to around $1.76.\n\nHow to buy Cardano: Cardano can be purchased on Coinbase, Binance, Kraken, and many other crypto exchanges.\n\n6. Dogecoin (DOGE)\n\n(Image credit: Shutterstock)\n\nDogecoin market cap: $53.1 billion\n\nDogecoin value: $0.41\n\nThe Dogecoin story: Dogecoin bills itself as “the fun and friendly internet currency.” Launched in 2013 by software developers Billy Markus and Jackson Palmer as a satire of Bitcoin and the exploding popularity of crypto, it’s basically a Bitcoin clone with a cute dog meme for a mascot.\n\nDogecoin has no real use (though some people use it to give small tips on social media), but it’s developed a growing fanbase that’s boosted the price of a Dogecoin from less than a penny a few months ago to about $0.40 today, making it one of the top cryptocurrency performers by market cap if nothing else. Dogecoin also started what is now known as the “memecoin” space. If you’re looking for the next big memecoin, it could be SafeMoon, which launched in March 2021 and already has over a million users. SafeMoon encourages investors to buy and hold by imposing a 10% fee on anyone who sells their tokens.\n\nDogecoin performance history: In early 2021, Dogecoin crossed the $0.05 threshold for the first time, then went to the moon in April, recently trading at an all-time high of $0.70. It dropped to below $0.45 following Elon Musk's appearance on Saturday Night Live, but climbed today (June 2) following the news that it will be listed on the Coinbase Pro exchange. It is currently worth $0.41.\n\nHow to buy Dogecoin: You can buy Dogecoin on Robinhood and many of the major crypto exchange like Binance and Kraken, but it's not available on Coinbase.\n\n7. XRP/Ripple (XRP)\n\n(Image credit: Shutterstock)\n\nXRP/Ripple market cap: $47.3 billion\n\nXRP value: $1.03\n\nThe XRP/Ripple story: XRP’s claim to fame is that it's the fastest digital asset, enabling near real-time global payments anywhere in the world. As such, some payment providers use XRP to expand their reach, lower foreign exchange costs, and settle payments more quickly.\n\nXRP was launched in 2012 by a trio of developers, who then created a private company called OpenCoin, now called Ripple Labs, and gifted it 80 billion XRP. This is what makes XRP unique — it is, essentially, a for-profit platform, unlike almost every other crypto project in the world.\n\nBuyer beware: in late 2020, the US Securities and Exchange Commission filed suit against Ripple and its two cofounders, claiming they raised over $1.3 billion through an unregistered, ongoing digital asset securities offering (aka XRP). The lawsuit is still unsettled.\n\nXRP performance history: Aside from a blip of a spike in December 2017-January 2018, XRP didn’t crack the $0.60 threshold until 2020. However it's grown throughout April and May is currently trading at just over $1.\n\nHow to buy XRP: The easiest way to purchase XRP is on one of the big crypto exchanges such as Coinbase, Binance, or Kraken.\n\n8. Polkadot (DOT)\n\n(Image credit: Shutterstock)\n\nPolkadot market cap: $24.1 billion\n\nPolkadot value: $26.1\n\nThe Polkadot story: Lots of the top cryptocurrency projects have lofty goals, but Polkadot’s is one of the loftiest: to “enable a completely decentralized web where users are in control.” Launched in 2020, Polkadot is the flagship project of the Swiss Web3 foundation. If Web 1.0 was commerce, and Web 2.0 was social, think of Web3 as decentralization. Polkadot’s technology stitches together different blockchains, enabling them to exchange information and transactions and operate together seamlessly.\n\nPolkadot performance history: This crypto was trading at about a nickel until late 2020, when it took off (stop us if you’ve heard this one before) and was recently trading at around $41. However a big fall recently has seen it drop back to around $26.\n\nHow to buy Polkadot: Buy Polkadot on major crypto exchanges such as Coinbase, Binance and Kraken.\n\n9. USD Coin (USDC)\n\n(Image credit: Shutterstock)\n\nUSD Coin market cap: $22.7 billion\n\nUSD Coin value: $1\n\nThe USD Coin story: Like Tether, USD Coin is a so-called stable coin that's linked to the U.S. dollar. That makes it far less subject to price fluctuations than many other cryptocurrencies — and indeed, USD Coin has been relatively unaffected by the recent turmoil in the market. USD is also big on transparency, assuring investors that they will be able to withdraw 1 USDC and receive $1 in return.\n\nUSD Coin performance history: USDC is worth $1\n\nHow to buy USD Coin: Buy USD Coin on major crypto exchanges such as Coinbase and Binance.\n\n10. Uniswap (UNI)\n\n(Image credit: Shutterstock)\n\nUniswap market cap: $15.7 billion\n\nUniswap value: $27.7\n\nThe Uniswap story: Most cryptocurrency trading takes place on centralized exchanges such as Coinbase, Binance, and Kraken. Uniswap, launched in 2018, is a decentralized crytpo exchange that runs on the Ethereum platform — transaction fees must be paid for in ETH.\n\nThe Uniswap app can swap all different types of tokens but does not connect to the traditional financial network, meaning you can’t convert to USD or Euro or other fiat currencies. (Though you can convert to some stablecoins — see Tether above.) Uniswap also has its own “governance token”: if you own this token, you have a right to vote on the direction of the project’s development. Uniswap recently passed Coinbase in trading volume, and many crypto followers think it could be the future of all exchanges.\n\nUniswap performance history: Launched in 2018, Uniswap hit a high of $42 in late April 2021. It is currently trading at around $27.\n\nHow to buy Uniswap: Buy Uniswap on major crypto exchanges such as Coinbase, Binance and Kraken.\n\n11. Chainlink (LINK)\n\n(Image credit: Shutterstock)\n\nChainlink market cap: $13.2 billion\n\nChainlink value: $30.8\n\nThe Chainlink story: Like Ethereum, Chainlink is less a single cryptocurrency but rather a technology that helps underpin the entire crypto structure. Essentially — and this is necessarily a very stripped-back explanation — it's a network that enables blockchains to interact with each other and with non-blockchain technologies. You can read more about how it works here. Chainlink also has its own currency, called LINK tokens, of which 1 billion were issued. A total of 35% of these were issued to Node Operators, another 35% were sold to the public and the company retains the remaining 30%.\n\nChainlink performance history: LINK grew steadily from being worth less than a dollar initially to around $12 at the end of 2020. Its soared in 2021 but since came back down, and is currently worth around $31 as of June 2.\n\nHow to buy Chainlink: Buy Chainlink on major crypto exchanges such as Coinbase and Binance.\n\n12. Internet Computer (ICP)\n\n(Image credit: Shutterstock)\n\nInternet Computer market cap: $13.1 billion\n\nInternet Computer value: $106\n\nThe Internet Computer story: Internet Computer only officially launched on May 10, 2021, but it immediately jumped into the Top 10 list of the biggest cryptocurrencies by market cap. And that's no surprise, because Internet Computer, or ICP, is a big deal. According to CoinMarketCap, it's \"the world’s first blockchain that runs at web speed with unbounded capacity\" and also \"the third major blockchain innovation, alongside Bitcoin and Ethereum.\"\n\nBold claims, indeed, but ICP — which was created by tech startup Dfinity — is an ambitious project that seeks nothing less than the reinvention of the internet. Around 469 million ICP tokens were issued on its launch, of which approximately 26% are expected to be in circulation.\n\nInternet Computer performance history: ICP enjoyed a stellar launch on the open market, jumping from $0 to $488 in a day. It then fell back sharply, and is currently at around $106.\n\nHow to buy Internet Computer: ICP is already available on Coinbase and is expected to come to Binance and other crypto exchanges soon.\n\n13. Bitcoin Cash (BCH)\n\n(Image credit: Shutterstock)\n\nBitcoin Cash market cap: $13.3 billion\n\nBitcoin Cash value: $700\n\nThe Bitcoin Cash story: Don't be confused by the name, because Bitcoin Cash is a completely different cryptocurrency to Bitcoin. That said, it does owe its existence to the market leader, in that it was created by a group of developers intent on bringing down the cost of Bitcoin transactions. A further split then resulted in the creation of Bitcoin SV.\n\nBitcoin Cash performance history: Bitcoin Cash has a lot of catching up to do to Bitcoin in terms of the size of its network. After reaching a high of nearly $4,000 back in 2018, it then dropped considerably and settled to around $300-400 for the next couple of years. A big jump in recent weeks saw it climb back to more than $1,500, but it's been steadily falling since then and and is currently valued at around $700.\n\nHow to buy Bitcoin Cash: You can buy Bitcoin Cash on major crypto exchanges such as Coinbase, Binance and Kraken.\n\n14. Litecoin (LTC)\n\n(Image credit: Shutterstock)\n\nLitecoin market cap: $12.4 billion\n\nLitecoin value: $186\n\nThe Litecoin story: Litecoin, created in 2011 by Charlie Lee, is one of the earliest Bitcoin clones, aka “altcoins,” and is a well-established crypto. It was developed with a focus on speed, efficiency, and wider initial coin distribution than Bitcoin. For example, Litecoin transactions are confirmed every two and a half minutes, which is four times more frequently than Bitcoin transactions. Another difference: Litecoin has a supply cap of 84 million coins, exactly four times Bitcoin’s — this is what makes many investors think of Litecoin as the silver to Bitcoin’s gold.\n\nLitecoin performance history: Litecoin spiked briefly over $300 in late 2017 before dipping as low as $25 in 2019. In late 2020, it began another ascent and recently passed the $400 mark for the first time, although it's since dropped back to around $185.\n\nHow to buy Litecoin: Litecoin can be purchased on any major crypto exchange, as well as on Robinhood and PayPal.\n\n15. Polygon (MATIC)\n\n(Image credit: Shutterstock)\n\nPolygon market cap: $11.3 billion\n\nPolygon value: $1.81\n\nThe Polygon story: Polygon is another cryptocurrency that is far more than just a currency. In fact, Polygon isn't a currency at all — it's a network which provides a framework for building and connecting blockchains, supported by Ethereum technology. However, it does also have a token, in this case MATIC,\n\nPolygon performance history: As recently as January 2021, MATIC was valued at just $0.19. It shot up over the past few months to a high of $2.63, before falling back to its current value of $1.81\n\nHow to buy Polygon: Buy Polygon on major crypto exchanges such as Coinbase and Binance.\n\nJonathan Lesser is a writer and editor covering cryptocurrency and personal finance. He has worked for two Fortune 100 financial services companies and has been published in Men’s Health, Men’s Journal, Vibe, Travel + Leisure Golf and other publications. View all articles by Jonathan here.", "Link": "https://www.tomsguide.com/news/top-cryptocurrency-by-value-bitcoin-ether-dogecoin-binancecoin", "Authors": ["Jonathan Lesser"], "Image": "https://cdn.mos.cms.futurecdn.net/pXaBrdnvbaXaKZJjYpDByn-1200-80.jpg", "Date": "02 June, 2021"}, {"index": 54, "Headline": "Major bitcoin mining region in China sets tough penalties for cryptocurrency activities", "Article": "In this article BTC.BS=-USS\n\nA bitcoin mine near Kongyuxiang, Sichuan, China on August 12, 2016. Paul Ratje | The Washington Post | Getty Images\n\nGUANGZHOU, China — China's Inner Mongolia region has proposed punishments for companies and individuals involved in digital currency mining as it looks to further crack down on the practice. The move comes after Chinese Vice Premier Liu He said last week in a statement that it is necessary to \"crack down on Bitcoin mining and trading behavior\" to prevent the \"transmission of individual risks to the social field.\" Those comments were seen as Beijing's intentions to continue a four-year crackdown on bitcoin trading and other cryptocurrency-related activities. Inner Mongolia's latest draft proposals aim to target companies such as telecommunications and internet firms engaging in virtual currency mining. The Inner Mongolia Development and Reform Commission said such companies could have their business licenses revoked if they are found to be involved in mining.\n\nCloud computing or data centers could have preferential government support policies they currently enjoy revoked. There are also harsh punishments for individuals involved in money laundering of fundraising via digital currencies.", "Link": "https://www.cnbc.com/2021/05/26/major-china-bitcoin-mining-hub-lays-out-harsher-crackdown-measures.html", "Authors": ["Arjun Kharpal"], "Image": "https://image.cnbcfm.com/api/v1/image/105156883-GettyImages-610823798.jpg?v=1532563650", "Date": "26 May, 2021"}, {"index": 55, "Headline": "Dogecoin: Is it bad or good for cryptocurrency?", "Article": "Dogecoin co-creator Billy Markus said Monday that Dogecoin acts as a gateway for people to enter the field of cryptocurrency.\n\nWhat did Dogecoin’s creator say about Doge?\n\nSomeone tweeted at Markus this week about how Dogecoin shouldn’t be seen as a “gateway drug” into cryptocurrency. But Markus said it is a learning tool for people.\n\n“Doge is very likely the thing this makes someone interested in crypto,” he wrote on Twitter.\n\n“What they do after that is up to them! But it’s not a threat to the space, it’s quite the opposite,” he added. “It’s helped the space tremendously.”\n\nThis mirrors what Dallas Mavericks owner Mark Cuban told Ellen DeGeneres on “Ellen” when he was trying to explain Dogecoin. As I wrote for the Deseret News, Cuban said he lets his son invest in Dogecoin so he can understand the markets of cryptocurrency.\n\n“So the question everyone wants to know, is Dogecoin a good investment? And here’s the reason I got Jake into it. It’s not necessarily the best investment you can make, but you can buy it on Robinhood, and signing up and trading on Robinhood is free. So that’s one thing,” Cuban said on “Ellen.”\n\n“The second thing is it’s about 26 cents per Dogecoin. So if you go and spend $5, $10, $15, that’s a better investment than buying a lottery ticket. And you know what? It could go up,” he added. “It’s also becoming a digital currency, which is crazy if you think back to its origins.”\n\nShould you invest in Dogecoin?\n\nJordan Awoye, the managing partner at Awoye Capital, a financial service company, wrote in an opinion piece for CNBC that people who want to make money fast probably should avoid Dogecoin because it has a volatile market. There’s also a lot of risk with such a fast-moving market that could cost you a lot of money.\n\nHowever, he said one of the benefits of Dogecoin is that it requires a low investment. it’s worth less than $1 in value — hovering in the $0.40 to $0.70 range in recent weeks — so there’s a not a huge risk if you invest a little bit, as per CNBC.", "Link": "https://www.deseret.com/2021/5/18/22441918/dogecoin-crypto-cryptocurrency-market", "Authors": ["Herb Scribner", "Sarah Todd", "Jay Drew", "Ryan Mcdonald", "Carter Williams", "May"], "Image": "https://cdn.vox-cdn.com/thumbor/hA1NbTKkRfozu9mzcRqdoHGcFSk=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22524142/Dogecoin_4.jpg", "Date": "18 May, 2021"}, {"index": 56, "Headline": "Dental Clinic in Ontario to Accept Cryptocurrency for Its Services – News Bitcoin News", "Article": "Dental Clinic in Ontario to Accept Cryptocurrency for Its Services\n\nSouthdown Dental, a clinic in Mississauga, Ontario, is introducing a new payment option. Patients will soon be able to pay with cryptocurrency for its services. The dental clinic says it will take digital money for any procedure, from regular checkups to children’s braces.\n\nCanadian Dental Clinic Meets Rising Demand for Crypto Acceptance\n\nThe dental clinic is stepping into the crypto world to address a “growing positive sentiment towards cryptocurrency.” Its management noted the increased use of digital coins in Canada’s consumer and services industry. Cryptocurrency offers users autonomy, reduces transaction fees, and facilitates quick and easy payments, the clinic pointed out in a press release.\n\nSouthdown Dental provides services to the residents of Mississauga in the Greater Toronto Area, in Canada’s most populous province, Ontario. The clinic, which was established in 1989, takes pride in being an “early adopter of innovations” in the dental field, utilizing the latest available technologies to provide its patients with the best care. The dental clinic stated:\n\nSeeing the rise in cryptocurrency usage, Southdown Dental is excited to be part of this movement and to meet the rising demand of Canadians for more cryptocurrency acceptance.\n\nThe dental center also admitted that many patients don’t have full coverage for some of the more expensive procedures. And in these unpredictable times, the clinic says, they might want to keep their cash in their bank accounts and spend some of their crypto holdings instead. With the exception of the recent market correction, the value of cryptocurrencies has been on rise since last year.\n\nFrom Regular Checkups to Surgery and Braces – Patients Can Pay for Everything With Cryptocurrency\n\nSouthdown Dental offers its clients financing, if they need it, different payment plans, and a variety of payment options that now becomes even greater with the addition of crypto payments. The press release did not mention the supported coins but Dr. Kal Khaled, co-owner of the clinic, assured:\n\nWhether it is a regular checkup, a surgical procedure, or braces, our patients will be able to choose traditional payment methods or cryptocurrency going forward.\n\n“This is an exciting shift to be the first Canadian dental clinic to take the leap into a new territory that will offer our patients new options during a very uncertain time,” added his partner, Dr. Bob Vavaroutsos.\n\nAccording to a report by Canadian local news outlet Daily Hive, quoting Coinmap data, Downtown Dental Hygiene Clinic in Toronto also accepts cryptocurrency. But even if Southdown Dental is not the first in the sector to take crypto, it’s certainly among the pioneers.\n\nDo you know of other dental clinics accepting cryptocurrency payments? Tell us in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/dental-clinic-in-ontario-to-accept-cryptocurrency-for-its-services/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2021/06/shutterstock_1390790267.jpg", "Date": "02 June, 2021"}, {"index": 57, "Headline": "Wall Street stocks advance after cryptocurrency jitters", "Article": "Investors on Wall Street looked past last week’s cryptocurrency jitters to send stocks higher on Monday, led by the technology sector.\n\nTech shares were the top performers on the S&P 500, propelling the blue-chip benchmark to close 1 per cent higher, while the tech-focused Nasdaq Composite index gained 1.4 per cent.\n\nEnergy stocks also climbed after Goldman Sachs forecast Brent crude, which leapt 3 per cent to $68.45 a barrel on Monday, would reach $80 this year as economies recovered from the pandemic.\n\nWall Street was rattled last week by the prospect that a cryptocurrency rout could ripple into other asset classes. Bitcoin fell 13 per cent on Sunday, before rising 18 per cent on Monday, although it remains roughly 38 per cent below its April peak.\n\nAnalysts are examining correlations between trends in cryptocurrency and other financial markets, such as richly valued tech stocks, citing the possibility that investors who borrowed money to trade digital currencies could sell other assets to offset losses.\n\n“The cross-asset consequences have been mild,” said John Normand, strategist at JPMorgan. But he warned that a deflation of what he said was a $2tn market could create “a substantial wealth loss, which can impact the real economy by impairing the balance sheets of households, corporates and the banking sector”.\n\nThe People’s Bank of China has warned financial institutions against using digital currencies for payments while the US government said cryptocurrency transactions exceeding $10,000 should be reported to tax authorities.\n\nThe S&P has traded choppily since closing at an all-time high on May 7. Almost nine out of 10 S&P-listed companies beat earnings forecasts for the first quarter, according to DataTrek Research.\n\nUS equities would remain volatile, DataTrek’s Nicholas Colas said, until companies reported second-quarter results and investors could assess whether the first three months of this year represented the peak of the recovery from last year’s industry shutdowns.\n\n“The volatility you see in stock prices day to day is the tug of war between earnings bulls and bears,” Colas said.\n\nInvestors also bid up the price of longer-dated US government bonds on Monday, sending yields lower. The benchmark 10-year Treasury note traded 0.02 percentage points lower to 1.61 per cent.\n\nThis yield, which sets the tone for equity valuations and global borrowing costs, has risen from about 0.9 per cent at the start of the year. It has stayed within a narrow range for the past month as Federal Reserve rate-setters repeated a long-held message that jumps in inflation would be transitory as the US economy recovers.\n\n“I’m still leaning bearish on bonds,” said Jack McIntyre, fixed income portfolio manager at Brandywine Global, as the Fed inches towards talk of tapering its $120bn of monthly bond purchases.\n\n“But it is going to be more of a gradual slowdown,” he added, as investors in the eurozone and Japan, where income yields from government bonds are lower, “find 1.6 per cent quite attractive”.\n\nIn currencies, the dollar index fell 0.2 per cent. The euro added 0.3 per cent against the dollar to $1.2217, remaining around its highest point since January.\n\nUnhedged — Markets, finance and strong opinion Robert Armstrong dissects the most important market trends and discusses how Wall Street’s best minds respond to them. Sign up here to get the newsletter sent straight to your inbox every weekday\n\n\n\n", "Link": "https://www.ft.com/content/90c1096d-ab3b-44d0-9bae-f7690d49c30c", "Authors": ["Naomi Rovnick"], "Image": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fcbad55a9-c6d3-4db0-8389-5547567915d0.jpg?source=next-opengraph&fit=scale-down&width=900", "Date": "24 May, 2021"}, {"index": 58, "Headline": "Tom Brady says he's a 'big believer' in cryptocurrencies", "Article": "Seven-time Super Bowl champion Tom Brady said he's a \"big believer\" in cryptocurrencies, confirming that he's purchased digital coins.\n\n\"I don't think it's going anywhere,\" Brady said at the CoinDesk Consensus 2021 forum on Thursday. \"I'm still learning so much. It's definitely something I'm going to be in for a long time.\"\n\n\"How we pay for things now is very different from how we paid for things when I was a kid,\" Brady said. \"At the end of the day it's transactions and how they're happening between people in the space of 3 to 4 feet … it's not exchanging dollar bills anymore, it's passing along technology.\"\n\n\"The world is changing, we all just have to understand it's constant change and you can either be ahead of the curve or behind it and I'm choosing to be ahead of it,\" he said. \"As someone who wants to be on the forefront of things, I'm going to help create the trend and adopt it and recognize this is where the world is heading.\"\n\nBrady didn't say which coins he's bought, but he's indicated an interest in bitcoin. Earlier this month, for example, he changed his Twitter profile picture to include \"laser eyes,\" which is something many bitcoin enthusiasts do to show their support.\n\n\"I've been following that community for a while on Twitter, someone had really called me out to change my profile picture and use the laser eyes,\" he said. \"In my understanding it was a vote of confidence, to really get into the conversation as I'm such a believer in crypto and where things are headed in the world.\"\n\nBrady doesn't think NFL players will paid in bitcoin anytime soon. \"At the end of the day, technically, that can't happen. What they pay is in dollars.\" But he said it's \"absolutely\" a good vehicle for investing money.\n\n\"I definitely think there will be more solutions as this is more widely adopted,\" he added.\n\nEarlier this year, Brady announced an NFT platform called Autograph that will auction off pieces of digital content linked to the blockchain when it launches sometime this spring.\n\nInterest in cryptocurrencies has surged over this past year, with athletes, celebrities and business executives investing in different digital coins, believing cryptocurrencies are a portfolio diversifier. The price of a single bitcoin, the world's most valuable cryptocurrency, is up more than 280% year over year, according to data from CoinDesk.\n\nSubscribe to CNBC on YouTube.", "Link": "https://www.cnbc.com/2021/05/28/tom-brady-says-hes-a-big-believer-in-cryptocurrencies.html", "Authors": ["Jessica Bursztynsky"], "Image": "https://image.cnbcfm.com/api/v1/image/106836802-16127545552021-02-08t032015z_2038437739_up1eh28099rmc_rtrmadp_0_football-nfl-superbowl.jpeg?v=1612754644", "Date": "28 May, 2021"}, {"index": 59, "Headline": "Want to invest in crypto? Here's what you need to know", "Article": "Between the meteoric rise of dogecoin accepting bitcoin as payment for its vehicles andall of which happenedin just over a month — there is growing attention on and interest in the digital asset space.\n\nMainstream adoption of crypto has been gaining steam for years, and was accelerated by the pandemic. Cryptocurrencies, especially bitcoin, are increasingly seen as investments to hedge against inflation during times of economic uncertainty, much like to gold. And Covid-19 stimulus checks meant some Americans had extra funds to invest\n\nIn 2020, the market of potential bitcoin investors grew to 32 million people in the United States, up 52% from the year prior, according to a survey by digital currency asset management firm Grayscale Investments, published in October . Of the respondents who had bought bitcoin in the preceding four months, 63% said the pandemic impacted their decision to invest.\n\nThere has also been more institutional acceptance of crypto recently, which increases awareness and trust among retail investors.\n\n\"Because it's been around for longer people are starting to accept it,\" Gavin Smith, Group CEO of crypto investment firm Panxora, told CNN Business. \"That's led to professional involvement because now they understand a bit better how to manage the risk,\" Gavin Smith, Group CEO of crypto investment firm Panxora, told CNN Business. That's creating more confidence from the general public, he added.\n\nBut for new investors in the space, some caution and education is needed, experts say.\n\n\"Crypto is not for the faint of heart,\" said R.A. Farrokhnia, Columbia Business School professor and executive director of the Columbia Fintech Initiative . For investors who do want to invest in cryptocurrency, \"you have to take a very conscientious and disciplined approach,\" he said.\n\nWhich cryptocurrency should I buy?\n\nThere is a wide variety of digital tokens and other crypto-related projects that one could invest in — with more emerging all the time as the so-called decentralized finance (or \"DeFi\") movement gains traction.\n\n\"Many digital currencies have distinct use cases, and you should understand the value proposition of a potential investment before committing capital,\" Grayscale Investments CEO Michael Sonnenshein said in an email.\n\nFor novice crypto investors, it's probably best to start with the larger, more established options , such as bitcoin and ethereum. While still highly volatile, the regulatory framework around them is clearer than with other tokens, which could help temper future risk.\n\nBitcoin is also the most liquid cryptocurrency, which should make it easier for investors to buy and sell with relative ease, compared to smaller, more niche coins with less demand, Farrokhnia said.\n\nAfter starting with the usual suspects, Panxora's Smith said, invvestors should do some research \"then maybe branch out into some of the other tokens that offer specific use cases in decentralized finance ... There's a few tokens out there that are really exciting and quite small at the moment.\"\n\nHow do you buy it?\n\nKeep it simple.\n\nStick with well-known, regulated exchanges such as Coinbase, Kraken or Binance, to buy and hold crypto investments — at least to begin with.\n\nDigital wallets that allow a person to hold crypto without the involvement of an intermediary are often associated with crypto and considered a perk of the decentralized finance space. But these \"non-custodial\" wallets come with unique security risks, such as the possibility of losing your password and losing access to your funds with no hope of regaining it (for a cautionary tale, read about these would-be bitcoin millionaires who lost their fortunes this way).\n\n\"With bitcoin, while it's on the exchange, you're quite safe,\" Smith said. \"Until you get familiar with the technology, I wouldn't recommend holding in your own wallet.\"\n\nOne thing to note: Crypto exchanges often have higher transaction fees than many stock trading apps, Farrokhnia said.\n\nAs for when to invest, experts advise against trying to time the market or buying a certain token just because the internet is buzzing about it. (FOMO is not a good investment strategy). Instead, many recommend the dollar cost averaging tactic, which entails buying smaller amounts at regular intervals over a set period of time.\n\n\"Dollar cost averaging is a great tactic for investors who want to invest and hold digital currencies over the long term,\" Smith said.\n\nHow risky is it, really?\n\nCryptocurrency is still quite risky compared with most other asset classes.\n\n\"For an average investor with a few thousand dollars of savings, this may not be the best domain to invest your money,\" Farrokhnia said.\n\nThe price of most mainstream cryptocurrencies isn't pegged to something specific and observable, in the way that stock prices typically fluctuate with the fundamental performance of a company. That can make it hard to understand or predict the current or future trajectory of a digital coin.\n\nFor this reason, experts recommend allocating only a small portion of your total investment portfolio (if any) to crypto.\n\nBut for some, the higher risk could be attractive because it may mean higher reward.\n\n\"The volatility inherent in the asset class makes crypto a riskier asset than most equities, but it comes with higher potential upside. Many digital currencies, including bitcoin, offer superior risk-adjusted returns over time,\" Grayscale's Sonnenshein said. He added: \"Bitcoin may not be for everyone, but everyone should at least consider it.\"", "Link": "https://www.cnn.com/2021/05/04/investing/cryptocurrency-how-to-invest/index.html", "Authors": ["Clare Duffy", "Cnn Business"], "Image": "https://cdn.cnn.com/cnnnext/dam/assets/210503143837-01-cryptocurrency-0416-super-tease.jpg", "Date": "04 May, 2021"}, {"index": 60, "Headline": "Companies need to be careful with accounting for crypto", "Article": "As businesses invest funds in cryptocurrencies and sell assets like nonfungible tokens, they should be aware of the accounting and tax issues surrounding them, or risk running afoul of regulators.\n\nWith corporations like MicroStrategy investing billions of dollars in cryptocurrencies, more companies are considering incorporating crypto into their business operations. The use of crypto presents opportunities and challenges for businesses, but as with any new frontier, there are some unknown dangers, along with enticing incentives. A new paper from Deloitte, Corporates Using Crypto , offers companies an overview of the types of questions and insights they should consider as they determine whether and how to use crypto, including issues related to corporate treasury, strategy, operations, risk, compliance, accounting and tax.\n\n“We’re starting to see more and more corporates recognizing that as retail customers become more comfortable with holding cryptocurrencies, they are looking for other avenues to use that, rather than just investing in it,” said Tim Davis, a risk and financial advisory principal at Deloitte & Touche. “Retail-based companies don’t want to limit a customer that would prefer to pay in crypto by saying, 'We’re only going to accept payment in regular [currency.]' Some of that is making sure they’re providing the broadest possible outreach to how customers want to pay for the products and services.”\n\n\n\nConcept Of Bitcoin Like A Computer Processor On Motherboard. 3D Scene. Picasa/3dsculptor - Fotolia\n\nAs the value of assets like Bitcoin and Dogecoin rise, customers aren’t likely to pay in those cryptocurrencies. But there are other forms of crypto known as stablecoin, which try to peg their value to some external reference like a national currency, and so are less subject to volatility.\n\n“Obviously when you’re in a particular asset class like Bitcoin, the theory is that it will continue to rise in value,” said Davis. “It does not make sense for a customer to pay in an asset that’s going to increase in price. It just means you’re going to pay more for something than you would have otherwise. So while that dynamic is out there, with cryptocurrencies increasing in value, I think you will see more and more customers preferring to pay in some kind of stablecoin. There are many different varieties of them. Stablecoins are also becoming an important piece of the basket of currencies when we’re talking about how corporates can accept payments for that reason.”\n\nCompanies also want to get into the crypto trend to show customers they’re not falling behind their competitors. “They may decide to take it as a form of payment from their customer ... simply because it sounds cool,” said Rob Massey, global tax and blockchain assets leader at Deloitte Tax. “They want to be viewed as progressive. Quickly what they find out is there are a number of customers out there who would like to pay in stablecoin or crypto. There may be vendors that want to be paid in crypto or stablecoin. And then that begins the journey of how commerce is evolving.”\n\nCompanies that want to get involved in the crypto world need to make sure they have the tax and accounting systems in place to handle it. “There’s a number of people that believe it’s not too far out anymore that we can actually start using smart contracts and programmable money to elevate commerce,” said Massey. “If you think it’s not too far out, then why not start to engage in using crypto as a method of payment now, just in terms of readiness.”\n\nCrypto can be complicated from a tax perspective. “Whenever you’re using something that is not fiat, then you’re realizing a gain or a loss from a tax perspective every time you use it, because the value that it has when you use it is probably different than your basis, so that triggers a gain or loss,” said Massey. “That does bring some complexity. We’re not used to a world of barter transactions. That’s kind of what it is for tax, because you’re using property of some kind that’s moving in value for property and services. Every time you’re using it, you’re triggering a gain or loss. Think about going through all of your accounting cycles and making sure that you’re tracking it when you’re using it for payroll, for a vendor, or for a customer. Then it requires a different level of tracking and frankly hygiene throughout your systems to make sure you catch it.”\n\nIn some cases, companies may want to use a reputable intermediary to process the payments for them. “The first decision they’ve really go to make is do they actually want to be accepting crypto themselves and holding it, or do they want to engage the services of an intermediary, who will essentially be cashing out the crypto for them, taking a fee and paying them in fiat,” said Davis. “Both of them are options, and there are service providers to provide that type of service. Obviously if you’re utilizing a third party, then you want to do some due diligence, that this company has got the controls to be doing it effectively because you have some customer relationship risk that you’re ceding to this third party, but you also have some compliance risk as well. If you’re accepting money in crypto, you at least have a responsibility to the Office of Foreign Access Control to make sure that you’re not accepting from what would otherwise be on a sanctioned or restricted list. Even if you’re not a financial institution, if you’re accepting crypto for payment, you still have that responsibility at a minimum when it comes to accepting payment.”\n\nCompanies need to be careful that they’re not being tricked into a money laundering scheme by accepting crypto payments. “It’s certainly a risk I think all companies need to be concerned with, but it’s typically businesses where there’s an inflow and outflow that represent a much greater risk for money laundering,” said Davis. “A casino, as an example, might be one where it provides the money launderer the opportunity to launder the money and get the proceeds back. If you were buying a car, it’s a little more difficult because you probably have to then go sell the car to get the proceeds laundered, and I think it’s unlikely that most launderers would go to all that effort. It’s not impossible, but they are likely to choose easier ways to do it.”\n\nHe noted that the Department of Justice issued a cryptocurrency enforcement framework last year to indicate which kinds of businesses might be prone to such activity. “In that document, it laid out those businesses that it believes are at high risk when it comes to crypto transactions and the likelihood that there’s money laundering going on,” said Davis. “You’d probably want to pay attention to those types of entities and have some sort of risk-based decisioning on how and when you’d accept money from those kinds of entities and, if so, what additional checks and balances you might want to put in place.”\n\nNFT accounting\n\nAccountants need to take note of price fluctuations in the crypto market, which can be different from how it works with regular currency. “There are instances where you’re dealing in something, if you’re going to contract in a digital asset, a cryptocurrency which is moving in value, what does that do? It really creates potentially a derivative, which is different,” said Massey.\n\nThe auction of a work of art in the form of a nonfungible token, or NFT, by the artist Beeple in March by Christie’s for $69 million raised awareness of the intersection of cryptocurrency and real currency. “Traditional crypto is one thing, and it’s continuing now with NFTs, which have a lot of popularity now,” said Massey. “What can nonfungible tokens do? We’re seeing them across a lot of different industries, in sports, media, and entertainment, even traditional financial services.”\n\nSome companies are offering to pay their employees and directors in cryptocurrency, which could increase the use of NFTs. “Some of that is driven by the company just wanting to promote the asset class,” said Davis. “Some of it is coming from the individual who is saying, ‘If I had a choice, I’d rather be paid in crypto than in fiat.’ You’ve got online businesses that are increasingly looking at ways in which they could have their own tokens that are within their own ecosystem, and they might even have a rewards component. You’re creating some type of customer loyalty by rewarding them with some additional tokens. They can then exchange those tokens for other things in the environment. It might be a gaming platform or a social media platform, where you can create your own e-commerce environment on your own coin, and then possibly give the individual some ability to then cash out of the coin. It has this utility where you can actually do things like create customer loyalty with owning a token associated with that particular brand. It just has that additional benefit that fiat doesn’t have.”\n\nSome NFT owners have found that they couldn’t even access the NFT once it was purchased, and the accounting for an NFT is likely to be complex. “I think the accounting treatment is going to be dictated based on the type of entity that holds it,” said Massey. “You’re going to get to a different answer for corporate versus an issuer versus an investment company, and then you also have considerations about what it is you’ve invested in. Not all NFTs are created equal, just like not all crypto is created equal. What it represents is going to bear weight in the accounting treatment as well as tax.”\n\nNFTs might be treated like other collectibles. “It’s almost the next evolution of baseball cards,” said Davis. “You collected it because of your love of the game, not because you were hoping to make some profit on it in the future. ... It’s not so much an investment vehicle. But you have to think through the platform that you’re going to use to provide it, make sure it’s going to be there for the customer when they need it, and you probably need some kind of backup option, so if it’s being kept on someone’s phone and the phone gets lost, they can come back to you, authenticate themselves, and get their copy back again. It’s still early days, and we’re just starting to see the emergence of some of these marketplaces and portals, but it’s signaling the start of a trend that we’re going to see much more of is this ability to own things and to have the creator of that, the artist or producer, put some rights and conditions over that.”\n\nThe use of NFTs is likely to raise accounting and tax issues, but Massey had some advice. \"Think about, first of all, what is it that they’ve created or bought? Then what does it represent when it’s sold? Is it really a sale or a license? Sometimes the sale of an NFT is more akin to a perpetual license than it is an actual transfer of a copyrighted thing,” he said. “There’s questions in there that would impact both the tax and the accounting treatment. It’s also the sourcing. How do you source a transaction? There’s really interesting questions around indirect taxes, like the sales tax or the VAT around the world. There are things like information reporting, 1099s, so as we go down to these new concepts and increasingly marketplaces, where people can either issue or sell for the first time or resell, then it’s important for the accountants to step in. It’s all of our normal list of things we would consider, but it all starts with what is it that we’re transacting with? What is the property? What is the NFT and then what is the transaction? We tend to get involved in these really interesting conversations with innovative new models and take a step back. Here we are, the bean counters. Let’s figure out what it is.”\n\nSEC and FASB standard-setting\n\nThe Securities and Exchange Commission is also keeping a close eye on the crypto market, although public companies still haven’t waded in too deeply yet.\n\n“It’s still early days, and we as yet haven’t seen a lot of evidence of widespread use of digital assets, notwithstanding some fairly recent one-off significant transactions, but beyond that we haven’t seen widespread use of it,” said SEC chief accountant Paul Munter during Baruch College’s financial reporting conference last week. “There are some huge scoping issues here because not all digital assets are the same. A lot of times, people pose the question assuming we’re just talking about Bitcoin, but in reality the spectrum of digital assets is very broad and continues to evolve. If we were to think about a standard-setting solution, it has to start with a question of scope. What exactly do we mean by digital assets? What kinds of things are we contemplating? How would we scope it in a fashion that not only would be fit for purpose for the type of digital assets that exist now, but that may exist in the not too distant future? Beyond that, who are we talking about? Where in the digital asset space are we trying to develop guidance for? Is it the holders? Is it the miners? Is it the broker-dealer type entities, etc.?”\n\nThe chairman of the Financial Accounting Standards Board, Richard Jones, said at the same conference that FASB decided not to add a project on digital assets to its agenda this year. “When we looked at it, we didn’t see a lot of diversity in practice in the accounting for similar items,” he explained. \"We also saw that there was an AICPA paper out there that I think does a great job of explaining particularly the intangible asset model and how it would be applied to digital assets that qualify as intangibles. Finally when we think about our agenda, it's not just what would be a good accounting question to answer, but we also look at prevalence and to date we haven’t seen that broad prevalence. Certainly there are some big names that have some presence in this space, but we didn’t see that broad material presence that meant it should be at the top of our standard-setting agenda.”", "Link": "https://www.accountingtoday.com/news/companies-need-to-be-careful-with-accounting-for-crypto", "Authors": ["Picasa - Fotolia", "Editor-In-Chief"], "Image": "https://arizent.brightspotcdn.com/dims4/default/ffd9503/2147483647/strip/true/crop/6200x3255+0+349/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsource-media-brightspot.s3.amazonaws.com%2F9e%2F40%2F7945e5934f7f9ad24e1e534ded83%2Fbitcoindigital.jpg", "Date": "12 May, 2021"}, {"index": 61, "Headline": "Bank of America, Citigroup, Wells Fargo Unveil Their Cryptocurrency Policies – News Bitcoin News", "Article": "Bank of America, Citigroup, Wells Fargo Unveil Their Cryptocurrency Policies\n\nBank of America, Citigroup, and Wells Fargo have shared their policies regarding cryptocurrency before the U.S. Senate banking committee. The three banks are in different stages of offering crypto services to their clients. They also lag behind some of their peers, such as Morgan Stanley and Goldman Sachs, in offering access to investments with exposure to bitcoin or other cryptocurrencies.\n\nBank of America Evaluating Crypto Opportunities\n\nThe CEOs of Bank of America, Citigroup, and Wells Fargo gave their testimonies on cryptocurrency before the Senate banking committee last week. The committee, headed by Senator Sherrod Brown, summoned the investment bankers for its annual oversight hearing on Wall Street firms.\n\nBank of America CEO Brian Moynihan said that BofA was keeping distance from bitcoin and other cryptocurrencies as the bank continued “to evaluate the opportunities, risks and client demand for products and services related to cryptocurrency.” Noting that his bank holds more than 60 blockchain-related patents, he emphasized, “We still have not found a use case at scale.” The Bank of America executive confirmed:\n\nCurrently, we do not lend against cryptocurrencies and do not bank companies whose primary business is cryptocurrency or the facilitation of cryptocurrency trading and investment.\n\nBank of America’s analyst said in January that bitcoin was the “mother of all bubbles.” Nonetheless, the bank’s most recent fund manager survey saw “long bitcoin” as the most crowded trade. In March, the bank says the only good reason for holding bitcoin was “sheer price appreciation.”\n\nSenator Brown is skeptical of cryptocurrencies. He recently sent a letter to the new Acting Comptroller of the Currency, Michael Hsu, urging him to review the cryptocurrency regulation under the purview of the Office of the Comptroller of the Currency (OCC).\n\nCitigroup Taking Measured Approach to Crypto\n\nCitigroup CEO Jane Fraser talked about her company taking a “measured approach” to cryptocurrency as the bank sought “to understand changes in the digital asset space and the use of distributed ledger technology, including demand and interest by our clients, regulatory developments and technology advancements.” The Citi executive noted:\n\nBefore we engage with cryptocurrencies, we see it as our responsibility to ensure we have clear governance and controls in place.\n\nCitigroup is reportedly planning to launch crypto services as the firm sees a “very rapid” accumulation of interest in bitcoin. In March, Citigroup says bitcoin was at a tipping point and could become the preferred currency for international trade.\n\nWells Fargo Closely Watching Crypto Space\n\nWells Fargo CEO Charles Scharf said that his company was close to announcing a pilot project using blockchain technology “to complete internal book transfers of cross-border payments within our global branch network.” However, in terms of cryptocurrency, he said:\n\nWe continue to closely and actively follow developments around cryptocurrencies, which have emerged as alternative investments products, though their status as a currency and mechanism of payment remains fluid.\n\nDarrell Cronk, the president of Wells Fargo Investment Institute, said last week that his firm is in the final stages of adding an actively managed cryptocurrency investment strategy to its platform. “We think the cryptocurrency space has just kind of hit an evolution and maturation of its development that allows it now to be a viable investable asset,” the executive opined.\n\nWhen do you think these three banks will adopt cryptocurrency? Let us know in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/bank-of-america-citigroup-wells-fargo-cryptocurrency/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2019/09/bofa-citi-wells.jpg", "Date": "29 May, 2021"}, {"index": 62, "Headline": "Dogecoin: What is Safemoon? Is it better than Doge?", "Article": "There’s a new hot cryptocurrency gathering investors’ attention instead of Dogecoin. It’s called Safemoon, and it has all the looks of what made Dogecoin popular in the first place.\n\nThe rise of Safemoon\n\nDogecoin has suffered in recent days from a bumpy ride with investors. The darling Dogecoin was getting all sorts of attention leading up to Tesla CEO Elon Musk’s appearance on “Saturday Night Live.” After Musk called Dogecoin a “hustle” on “SNL,” investors sold their holdings, leading to a quick drop in Dogecoin’s value.\n\nSo, experts have turned to the cryptocurrency Safemoon as a potential investment opportunity. Per Yahoo! Finance, Safemoon is worth around $0.000007, giving it huge room to grow in value if more people invest,\n\nThis is similar to Dogecoin’s original rise. As the Deseret News reported, Dogecoin was worth $0.0023 back in July before spiking to $0.70 in the last few weeks. That doesn’t sound like a lot at first. But when you invest a lot of money into it, the slight spikes can lead to huge gains over time if you’re lucky and if the market works in your favor, experts say. Nothing is guaranteed.\n\nSo what is Safemoon?\n\nSafemoon is a new cryptocurrency with almost no history. According to Benzinga, Safemoon began trading in March at $0.000000001 per Safemoon coin. The cryptocurrency’s value jumped to $0.000012 before dropping back down to $0.000004. That’s a 1,000% gain in a few months.\n\nSafemooon “doesn’t have any clear use cases,” though, according to Benzinga. This means you can’t use it to buy real things yet.\n\nIs Safemoon a scheme?\n\nPossibly. According to Benzinga, Safemoon resembles “a pyramid scheme instead of a sound monetary policy” since investors are charged a 10% fee when they sell their holdings. And 5% of that fee is given back to other Safemoon investors.\n\n“Essentially, investors rely on more people buying into Safemoon to increase their investment,” according to Benzinga.\n\nSo what’s the deal? Should you invest? Well, it sounds a little sketchy. But, per Benzinga, “most investors would agree that Safemoon has higher potential for returns than DOGE, albeit an extremely high risk investment.”", "Link": "https://www.deseret.com/2021/5/11/22430356/dogecoin-safemoon-cryptocurrency-predictions", "Authors": ["Herb Scribner", "Sarah Todd", "Jay Drew", "Ryan Mcdonald", "Carter Williams", "May"], "Image": "https://cdn.vox-cdn.com/thumbor/6SVOHi10qoBgJt9VXEY0X1Hh5i8=/0x680:9504x5656/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22476220/AP21089552118817.jpg", "Date": "11 May, 2021"}, {"index": 63, "Headline": "NYU's 'dean of valuation' argues ether has a better chance of becoming a commodity than bitcoin", "Article": "The cryptocurrency ether \"has a better shot\" at becoming a commodity than bitcoin, argues New York University's Aswath Damodaran.\n\n\"If the future lies in blockchain transactions — and ether is going to be a better lubricant of those blockchain transactions — you could actually argue that ether has a stronger upside story than bitcoin does,\" Damodaran, a professor of finance at NYU's Stern School of Business, told CNBC's \"Street Signs Asia\" on Thursday.\n\nEther is the cryptocurrency that runs on the Ethereum blockchain. It currently sits in second place behind bitcoin in terms of market cap, according to Coinmarketcap. Noted proponents of Ethereum include billionaire investor Mark Cuban, who told CNBC previously that it \"dwarfs\" bitcoin.\n\nDamodaran, a longtime skeptic of the cryptocurrency, said bitcoin lacks an \"endgame\" and called it a \"purely speculative game.\"\n\n\"All that bitcoin bulls seem to talk about, their biggest sales pitch for bitcoin is: 'Look at how much money I've made on bitcoin.' That's it, that's the end of the sales pitch,\" he said. \"That's not a sales pitch. That tells me nothing about the substance here.\"", "Link": "https://www.cnbc.com/2021/05/20/nyus-aswath-damodaran-discusses-bitcoin-crash-cryptocurrency-sector.html", "Authors": ["Eustance Huang"], "Image": "https://image.cnbcfm.com/api/v1/image/106885738-1621490902783-gettyimages-1317812942-dsc01436.jpeg?v=1621490465", "Date": "20 May, 2021"}, {"index": 64, "Headline": "JPMorgan Boss Jamie Dimon Personally Advises People to 'Stay Away' From Cryptocurrency – News Bitcoin News", "Article": "JPMorgan Boss Jamie Dimon Personally Advises People to 'Stay Away' From Cryptocurrency\n\nJPMorgan Chase CEO Jamie Dimon has given personal advice to investors regarding investing in cryptocurrencies, like bitcoin. He said that his own personal advice to people is to “stay away” from cryptocurrencies. However, his bank, JPMorgan, will not stay away as clients want exposure to this asset class.\n\nJamie Dimon’s Personal Advice to Investors About Bitcoin, Other Cryptocurrencies\n\nJamie Dimon, the CEO of JPMorgan Chase, the largest bank in the U.S., gave his congressional testimony before the House of Financial Services Committee regarding cryptocurrency on Thursday. While admitting that JPMorgan’s clients are interested in investing in bitcoin, Dimon said:\n\nMy own personal advice to people is stay away from it. That does not mean the clients don’t want it. This goes back to how you have to run a business. I don’t smoke marijuana but if you make it nationally legal, I’m not going to stop our people from banking it.\n\n“We are debating should we make it available in some way, in a safe way, that people can buy and sell it” and put it in their financial statements and balance sheets, the JPMorgan CEO continued. “But my own personal view, it’s nothing like a fiat currency. It’s nothing like gold. Buyer beware.”\n\nDimon clarified that his statements only apply to cryptocurrencies, not blockchains or stablecoins, which are “supported by assets,” he said.\n\nThe JPMorgan boss further emphasized that his personal views do not influence the financial services that JPMorgan Chase offers to its clients. “A lot of our clients are asking, ‘can we help them buy or sell cryptocurrency?” Dimon said at JPMorgan Chase’s annual shareholder meeting last week. “And we’re investing in that as we speak.”\n\nThe JPMorgan executive further said during his congressional testimony Thursday:\n\nI don’t tell people how to spend their money, regardless of how I might personally feel about something.\n\nReiterating his view expressed in April that cryptocurrencies are emerging issues that need to be dealt with quickly, Dimon said in his congressional testimony that the crypto asset class could benefit from more regulation.\n\n“I do think that eventually the regulators who are a day late and a dollar short should be paying a lot more attention to the future, like payment for the order flow, a high-frequency trading, cryptocurrency, and put a legal regulatory framework around it,” he opined.\n\nDimon has long been a bitcoin skeptic. He called the cryptocurrency a fraud back in September 2017. Now JPMorgan is slowly getting into the crypto space. In March, the bank launched a crypto investment product tracking public company stocks with bitcoin exposure. The bank is also reportedly working on providing clients access to bitcoin investments.\n\nJPMorgan recently highlighted three reasons for investing in bitcoin after its analysts predicted that the price of the cryptocurrency could reach $146K as its competition with gold heats up. The firm subsequently lowered its bitcoin price estimate to $130K but said that clients can put 1% of their portfolios in BTC. Last week, JPMorgan initiated coverage of the Coinbase stock with an overweight rating and a 60% upside from the current price.\n\nWhat do you think about Jamie Dimon’s personal advice to investors about bitcoin and cryptocurrencies? Let us know in the comments section below.\n\nImage Credits: Shutterstock, Pixabay, Wiki Commons\n\nDisclaimer: This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article.", "Link": "https://news.bitcoin.com/jpmorgan-jamie-dimon-personally-advises-stay-away-from-cryptocurrency/", "Authors": [], "Image": "https://news.bitcoin.com/wp-content/uploads/2019/09/dimon.jpg", "Date": "30 May, 2021"}]